<?
$title = "Ч.З.В. - Общие вопросы";
$cvs_author = 'Author: gecko2';
$cvs_date = 'Date: 2012/11/11 15:20:14';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Ч.З.В. Contents"><link rel="next" href="relations.php?phpLang=ru" title="Связь с другими проектами"><link rel="prev" href="index.php?phpLang=ru" title="Ч.З.В. Contents">';


include_once "header.ru.inc";
?>
<h1>Ч.З.В. - 1. Общие вопросы</h1>
        
        
        <a name="what">
            <div class="question"><p><b><? echo FINK_Q ; ?>1.1: Что такое Fink?</b></p></div>
            <div class="answer"><p><b><? echo FINK_A ; ?>:</b> Целью Fink является максимальный перенос ПО Unix в Mac OS X, из чего вытекают
                    две основные задачи:</p><p>Задача номер один: перенос ПО в Mac OS X. Это значит, что
                    мы берем ПО Unix с открытым исходным кодом и вносим корректировки,
                    необходимые для его компилирования и работы в Mac OS X.
                    Иногда это нетрудно, но в некоторых случаях бывает крайне сложно и даже
                   невозможно для некоторых пакетов. Мы стараемся предоставлять инструменты
                    и документацию для облегчения этого процесса. </p><p>Задача номер два: обеспечение доступа обычным пользователям к результатам работы.
                    Для этого мы основываем дистрибуцию на применении
                    инструментов управления пакетами, перенесенных из Linux, а именно
                    <code>dpkg</code> и <code>apt-get</code>, созданными в рамках проекта
                     <a href="http://www.debian.org/">Debian
                    GNU/Linux</a> и предназначенными для него же. При бинарной дистрибуции используется
                    пакетный формат<code>.deb</code>. Для построения пакетов на основе исходного кода
                    у нас имеется собственный инструмент, названный <code>fink</code>, который
                    создает пакетные файлы <code>.deb</code>.</p></div>
        </a>
        <a name="naming">
            <div class="question"><p><b><? echo FINK_Q ; ?>1.2: Что означает название Fink?</b></p></div>
            <div class="answer"><p><b><? echo FINK_A ; ?>:</b>  Ничего, это просто имя. Это даже не аббревиатура.</p><p> Вообще-то Fink - это немецкий вариант слова Finch (зяблик), названия
                    породы птиц. Я искал название для проекта и название
                    Darwin OS навело на мысль о Чарльзе Дарвине, Галапагосских островах
                    и эволюции. Я со школьных времен помнил о так называемых
                    зябликах Дарвина и их клювах,
                    и вот ...</p></div>
        </a>
        <a name="bsd-ports">
            <div class="question"><p><b><? echo FINK_Q ; ?>1.3:  Чем Fink отличается от механизма переноса BSD (включая
                    OpenPackages и GNU-Darwin)? </b></p></div>
            <div class="answer"><p><b><? echo FINK_A ; ?>:</b>  Некоторые главные преимущества:</p><ul>
                    <li>
                        <p> Он написан с использованием Perl, а не make/оболочки. То есть он
                            не опирается на особые параметры, которые можно найти только в BSD make.
                            Нет необходимости отмечать пакеты, которые нуждаются в
                            GNU make для построения.</p>
                    </li>
                    <li>
                        <p> dpkg обеспечивает развитое управление бинарными пакетами - 
                            равномерное обновление, специальную обработку
                            файлов конфигурации, виртуальных пакетов и другие
                            усовершенствованные взаимозависимости. </p>
                    </li>
                    <li>
                        <p> Fink ничего не инсталлирует в /usr/local, если нет конкретного запроса,
                            и не требует действий с
                             /usr/bin/make или другими командами, обеспечиваемыми
                            системой. Это делает его более безопасным в использовании и снижает
                            интерференцию в отношении Mac OS X и пакетов третьих лиц
                            до минимума.</p>
                    </li>
                </ul></div>
        </a>
        <a name="usr-local">
            <div class="question"><p><b><? echo FINK_Q ; ?>1.4: Почему Fink ничего не инсталлирует в  /usr/local?</b></p></div>
            <div class="answer"><p><b><? echo FINK_A ; ?>:</b>  Для этого есть несколько причин, но в основном "потому что
                    произойдет сбой в работе".</p><p> Первая причина: ПО третьих лиц.  /usr/local является
                    хорошим местом для размещения ПО, которое не является частью
                    системы, поставленной первоначальным продавцом. Это
                    хорошее место для размещения всякой всячины. Но это также значит, что
                    и другие будут там что-нибудь размещать. Большинство программ
                    инсталляции будут просто записывать поверх того, что там находится - это также
                    относится и к dpkg. Конечно, можно решить не инсталлировать
                    ПО третьих лиц в  /usr/local. Но к сожалению, большинство
                    инсталляторов не предупреждают заранее о том, что и где они установят.</p><p> Вторая причина: /usr/local/bin находится в PATH по умолчанию. Это
                    значит, что ваша оболочка найдет инсталлированные программы
                    без дополнительных мер. Но это также значит, что вам надо
                    принять дополнительные меры, если вы не хотите использовать
                    программы. В наихудших случаях это может также повлиять на
                    саму систему - многие части зависят от скриптов оболочки. </p><p> Третья причина: Цепочка инструментов компилятора находит /usr/local по
                    умолчанию. Компилятор находит /usr/local/include для
                    файлов заголовков, а компоновщик производит поиск /usr/local/lib для библиотек.
                    Опять же, иногда это безусловно удобно, но очень трудно
                    сделать дезактивацию в случае необходимости.  Можно без труда дезактивировать
                    компилятор, поместив файл с ненужными данными, названный
                    <code>stdio.h</code>, в /usr/local/include.</p><p> С учетом всего сказанного, можно инсталлировать Fink в
                    /usr/local. Скрипт инсталляции сделает предупреждение,
                    но продолжит выполнение после подтверждения с вашей стороны, что вы
                    делаете это на свой страх и риск.</p></div>
        </a>
        <a name="why-sw">
            <div class="question"><p><b><? echo FINK_Q ; ?>1.5: Тогда почему вы выбрали /sw?</b></p></div>
            <div class="answer"><p><b><? echo FINK_A ; ?>:</b>  Данный выбор совершенно произвольный, но возможно, мы на нем остановимся
                    в обозримом будущем по практическим соображениям (обновление),
                   а также потому, что это безопасно, т.к. предотвращается конфликт  с другими
                    системами пакетирования.</p></div>
        </a>
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="relations.php?phpLang=ru">2. Связь с другими проектами</a></p>
<? include_once "../footer.inc"; ?>


