<?
$title = "Руководство пользователя - Инсталляция";
$cvs_author = 'Author: dmacks';
$cvs_date = 'Date: 2004/12/09 18:17:04';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Руководство пользователя Contents"><link rel="next" href="packages.php?phpLang=ru" title="Инсталляция пакетов"><link rel="prev" href="intro.php?phpLang=ru" title="Введение">';


include_once "header.ru.inc";
?>
<h1>Руководство пользователя - 2. Первоначальная инсталляция</h1>
        
        
        
            <p> В процессе первоначальной инсталляции на вашей машине
                инсталлируется базовая система с инструментами управления пакетами.
                После этого вам надо настроить свою среду оболочки для использования ПО,
                инсталлированного при помощи Fink. Это надо сделать только один раз; любое инсталлированное ПО Fink
               (начиная с версии 0.2.0)  может быть обновлена на месте без
                реинсталляции. См. раздел <a href="upgrade.php?phpLang=ru">Обновление</a>.</p>
            <p> После инсталляции инструментов управления пакетами вы можете
                их использовать для инсталляции другого ПО. См. раздел <a href="packages.php?phpLang=ru">Инсталляция пакетов</a>.</p>
        
        <h2><a name="bin">2.1 Инсталляция при бинарной дистрибуции</a></h2>
            
            <p> Бинарная дистрибуция представлена в виде пакета Mac OS X
                (.pkg) в загрузочном модуле диска (.dmg). После скачивания
                загрузочного модуля диска со страницы <a href="http://fink.sourceforge.net/download/bindist.php">Скачивание
                </a> (возможно, вам придется использовать на браузере функцию "Save Target
                as..." или "Download to Disk") щелкните дважды на его изображении.
                Откройтке иконку диска "Fink 0.x.x Installer" на рабочем столе
                (или там, куда вы скачали) после проверки файла дисковым утилитом
                (Disk Copy для версий OS до 10.3).
                В нем вы найдете документацию и пакет инсталлятора.
                Сделайте двойной щелчок на пакете инсталлятора и следуйте указаниям
                на экране.</p>
            <p> Вам будет задан вопрос о пароле администратора и затем появятся
                тексты. Прочтите их - они могут быть написаны позже, чем
                данное Руководство. При появлении опций инсталлятора для дискового
                накопителя, на котором надо инсталлировать, надо правильно выбрать объем системы (где
                вы инсталлировали Mac OS X). Если вы выберите неправильный объем,
                инсталляция продолжится, но Fink после этого не будет работать. Когда инсталлятор
                закончит работу, перейдите к разделу <a href="#setup">Настройка среды</a>.</p>
        
        <h2><a name="src">2.2 Инсталляция при дистрибуции на основе исходного кода</a></h2>
            
            <p> Дистрибуция на основе исходного кода является стандартным тарболом Unix
                (.tar.gz). Он содержит только менеджер пакетов <code>fink</code>
                с описанием пакетов и скачивает исходный код
                для пакетов на fly. Его можно получить со страницы <a href="http://fink.sourceforge.net/download/srcdist.php">Скачивание
                </a>. Важно не использовать StuffIt Expander
                для извлечения архива архиватора на магнитной ленте. По какой-то причине StuffIt все еще
                не может обрабатывать имена файлов. Если StuffIt Expander уже извлек архив,
                надо удалить созданную им папку.</p>
            <p> Версия исходного кода должна инсталлироваться со строки команд,
                т.е. надо открыть Terminal.app и перейти к каталогу, в котором вы поместили архив
                fink-0.x.x-full.tar.gz . Следующая команда извлекает
                архив:</p>
            <pre>tar -xzf fink-0.x.x-full.tar.gz</pre>
            <p> Создается каталог с таким же именем, как архив.
                Мы просто будем продолжать здесь использовать заполнитель
                <code>fink-0.x.x-full</code>. Теперь перейдите в этот каталог и выполните
                сценарий загрузки:</p>
            <pre>cd fink-0.x.x-full ./bootstrap.sh</pre>
            <p> Сценарий произведет проверку вашей системы и использует sudo,
                чтобы стать суперпользователем - вы увидите опцию для пароля. Затем
                сценарий спросит о маршруте инсталляции. Если у вас нет иной
                веской причины, надо использовать
                -<code>/sw</code> по умолчанию. Только это позволит вам впоследствии инсталлировать
                скачанные бинарные пакеты. Кроме того, все примеры используют
                этот маршрут; если вы используете другой, надо убедиться, что ваш действительный маршрут
                заменен.</p>
            <p> Следующий шаг - конфигурация Fink. Вам будут заданы вопросы о
                настройках прокси и зеркала, а также о том, хотите ли вы получать многословные сообщения.
                Если вы не поняли какой-то вопрос, надо нажать на return для принятия
                выбора по умолчанию. Можно перезапустить этот процесс позднее с использованием команды
                    <code>fink configure</code>.</p>
            <p> Когда сценарий загрузки будет иметь всю необходимую информацию, он
                начнет скачивание исходного кода для базовой системы и
                компиляцию. С этого момента не требуется никакое вмешательство.
                Не надо беспокоиться, если вы увидите некоторые пакеты, скомпилированные дважды.
                Это необходимо, т.к. для построения бинарного пакета в менеджере пакетов
                сначала надо получить менеджер пакетов.</p>
            <p> По окончании загрузки перейдите к разделу <a href="#setup">Настройка среды</a>.</p>
        
        <h2><a name="setup">2.3 Настройка среды</a></h2>
            
            <p> Для использования ПО, установленного в иерархии каталогов Fink,
                в т.ч. самих программ управления пакетами, необходимо
                настроить переменную величину вашей среды PATH (и кое-что другое)
                соответствующим образом. В большинстве случаев можно это сделать при помощи команды</p>
            <pre>open /sw/bin/pathsetup.command</pre>
            <p> либо для <code>fink-0.18.3</code> или <code>fink-0.19.2</code> 
                (в точности, как показано ниже):</p>
            <pre>/sw/bin/pathsetup.sh</pre>
            <p> Если по какой-то причине это не сработает, можно сделать
                конфигурацию вручную. Но это будет зависеть от используемой оболочки.
                Можно определить используемую оболочку, открыв терминал
                и выполнив команду</p>
            <pre>echo $SHELL</pre>
            <p> Если результат будет "csh" или "tcsh", значит, вы используете оболочку C. Если
                это bash, zsh, sh и т.п., у вас вероятно
                вариант bourne shell.</p>
            <ul>
                <li>
                    <p>
                        Bourne Shell (по умолчанию в Mac OS X 10.3
                        и более поздних версиях) </p>
                    <p> Если вы используете Bourne shell (н-р sh, bash, zsh),
                        добавьте следующие строки к файлу
                        <code>.profile</code> в своем базовом каталоге (либо, если
                        у вас есть файл <code>.bash_profile</code>, надо
                        использовать следующее вместо него): </p>
                    <pre>. /sw/bin/init.sh</pre>
                    <p> Если вы не знаете, как добавить строку, примените
                         </p>
                    <pre>cd pico .profile</pre>
                    <p> Теперь вы в полноэкранном текстовом редакторе (с полным терминальным
                        окном) и можете просто начать печатать строку
                            <code>. /sw/bin/init.sh</code>. Если есть отметка
                        "New file", значит, все хорошо. Убедитесь, что вы нажали
                        клавишу Return не менее одного раза, затем нажмите
                        Control-O, Return, Control-X для выхода из редактора. </p>
                </li>
                <li>
                    <p>
                        Оболочка C (по умолчанию в Mac OS X 10.2 и
                        более ранних версиях) </p>
                    <p> Если вы используете tcsh, добавьте следующую строку к файлу
                        <code>.cshrc</code> в своем базовом каталоге: </p>
                    <pre>source /sw/bin/init.csh</pre>
                    <p> Если вы не знаете, как добавить строку, примените
                        следующие команды: </p>
                    <pre>cd pico .cshrc</pre>
                    <p> Теперь вы в полноэкранном текстовом редакторе (с полным терминальным
                        окном) и можете просто начать печатать строку
                            <code>source /sw/bin/init.csh</code>. Если есть отметка
                        "New file", значит, все хорошо. Убедитесь, что вы нажали
                        клавишу Return не менее одного раза, затем нажмите
                        Control-O, Return, Control-X для выхода из редактора.
                         </p>
                    <p>Есть пара общих ситуаций, в которых вам может понадобиться
                        редактирование дополнительных файлов:</p>
                    <ol>
                        <li>
                            <p>У вас есть <code>~/.tcshrc</code>.</p>
                            <p>Такой файл иногда создается приложениями
                                третьих лиц или самими вами.
                                Так или иначе, случается так, что
                                <code>~/.tcshrc</code> становится читаемым, а
                                <code>~/.cshrc</code> игнорируется.
                                Рекомендуется отредактировать
                                <code>~/.tcshrc</code> также, как вы это сделали с
                                <code>~/.cshrc</code> ранее, а также
                                добавить следующую строку в конце:</p>
                            <pre>source ~/.cshrc</pre>
                            <p>Таким образом, если вам когда-либо понадобится удалить
                                <code>~/.tcshrc</code>, вы сможете запускать Fink.</p>
                        </li>
                        <li>
                            <p>Вы следовали указаниям в <code>/usr/share/tcsh/examples/README</code>.</p>
                            <p>Они объясняют, как создать
                                <code>~/.tcshrc</code> и <code>
                                ~/.login</code>.  В данном случае проблема заключается в
                                <code>~/.login</code>, который запускается после
                                <code>~/.tcshrc</code>, и исходных кодах
                                <code>/usr/share/tcsh/examples/login</code>. Последние
                                содержат строку, которая делает запись поверх вашей
                                предыдущей настройки PATH. В данном случае надо
                                создать <code>~/Library/init/tcsh/path</code>:</p>
                            <pre>mkdir -p ~/Library/init/tcsh pico ~/library/init/tcsh/path</pre>
                            <p>и внести туда </p>
                            <pre>source ~/.cshrc</pre>
                            <p>. Надо также модифицировать ваш .tcshrc, как описано
                                в п.1 выше, и убедиться, что ваш PATH настроен правильно
                                на случай ситуаций, когда
                                <code>~/.login</code> не читается.</p>
                        </li>
                    </ol>
                    <p> Редактирование .cshrc (и других файлов инициализации) только
                        негативно отразится на новых оболочках (т.е. вновь открытых терминальных окнах),
                        таким образом надо также применить данную команду во всех
                        терминальных окнах, открывающихся до того, как вы отредактировали файл.
                        Вам также понадобится выполнить <code>rehash</code>, т.к. tcsh
                        кэширует список имеющихся команд внутрениим образом. </p>
                </li>
            </ul>
            <p> Имейте в виду, что сценарии также добавляют
                <code>/usr/X11R6/bin</code>
                и <code>/usr/X11R6/man</code> к вашему PATH, чтобы
                вы могли использовать  X11 после его инсталляции. Пакеты Fink обладают способностью
                самостоятельно добавлять настройки, н-р пакет qt  устанавливает переменные величины среды QTDIR.
                </p>
            <p> После настройки своей среды перейдите к главе <a href="packages.php?phpLang=ru">Инсталляция пакетов</a>, чтобы
                увидеть, как вы можете инсталлировать некоторые действительно полезные пакеты,
                используя различные инструменты управления пакетами, входящие в Fink.</p>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="packages.php?phpLang=ru">3. Инсталляция пакетов</a></p>
<? include_once "../../footer.inc"; ?>


