<?
$title = "Руководство пользователя - Введение";
$cvs_author = 'Author: horsager';
$cvs_date = 'Date: 2005/02/01 02:34:17';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Руководство пользователя Contents"><link rel="next" href="install.php?phpLang=ru" title="Первоначальная инсталляция"><link rel="prev" href="index.php?phpLang=ru" title="Руководство пользователя Contents">';


include_once "header.ru.inc";
?>
<h1>Руководство пользователя - 1. Введение</h1>
        
        
        <h2><a name="what">1.1 Что такое Fink?</a></h2>
            
            <p> Fink - дистрибуция ПО Mac OS X и Darwin с открытым исходным кодом. 
                Она обеспечивает широкий выбор свободной строки команд и
                графического ПО, разработанных для Linux и аналогичных операционных
                систем вашего Mac.</p>
        
        <h2><a name="req">1.2 Требования</a></h2>
            
            <p> В любом случае вам понадобится:</p>
            <ul>
                <li>
                    <p> Инсталлированная система Mac OS X, версия 10.2 или более поздняя, либо
                        эквивалентные версии Darwin. Более ранние версии
                        <b>не</b> будут работать. См. далее информацию
                        о поддерживаемых системах.</p>
                </li>
                <li>
                    <p> Доступ к Internet. Исходный код и бинарные пакеты
                        скачиваются с сайтов скачивания Internet.</p>
                </li>
            </ul>
            <p> Если вы намерены использовать дистрибуцию на основе исходного кода (см. ниже), вам также
                понадобятся:</p>
            <ul>
                <li>
                    <p> Инструменты разработки. В Mac OS X надо инсталлировать
                        пакет Developer.pkg с компакт-диска Developer Tools. Имейте в виду, что
                        инструменты должны соответствовать вашей версии Mac OS X. В
                        Darwin инструменты инсталлированы по умолчанию.</p>
                    <p> Идея инсталлировать Developer Tools хороша,
                        даже если вы не намерены строить пакеты от исходного кода.
                        Некоторые программы, инсталлированные пакетом,
                        являются инструментами строки команд общего назначения. Некоторые
                        пакеты могут зависеть от них в своей работе.</p>
                </li>
                <li>
                    <p> Терпение. Компилирование нескольких больших пакетов требует времени.
                        Во время этого процесса можно болтать в течение часов и даже дней.</p>
                </li>
            </ul>
        
        <h2><a name="supported-os">1.3 Поддерживаемые системы</a></h2>
            
            <p>
                <b>Mac OS X 10.3</b> - операционная система, выбранная
                для работы Fink. Ее используют все разработчики и в ней проверяются все пакеты.
                Она считается "полностью поддерживаемой и проверяемой",
                хотя все еще могут быть некоторые проблемы компиляции в случае отдельных пакетов. </p>
            <p>
                <b>Mac OS X 10.2</b> все еще поддерживается, хотя некоторые
                более новые пакеты могут не иметь версий 10.2.</p>
            <p>
                <b>Mac OS X 10.1</b> все еще поддерживается до некоторой степени. Надо
                использовать Fink 0.4.1, но не более поздние версии.</p>
            <p> Darwin 7.0.1 - версия Darwin, соответствующая Mac OS X
                10.3, а <b>Darwin 6.0.2</b> - версия Darwin,
                соответствующая Mac OS X 10.2. В целом они должны работать, но
                не очень хорошо проверены, т.к. вместо этого люди используют параметры, присущие Mac OS X.
                Можно столкнуться с проблемами в случае пакетов, использующих
                параметры, присущие Mac OS X - затрагиваемые пакеты включают
                XFree86 и возможно esound.</p>
        
        <h2><a name="src-vs-bin">1.4 Дистрибуция исходного кода и бинарная дистрибуция</a></h2>
            
            <p> ПО пишется ("разрабатывается") на языках программирования,
                доступных для человеческого понимания; эта форма называется "исходным кодом".
                До того, как компьютер сможет выполнить программу, она должна быть преобразована
                в инструкции машинного кода низкого уровня (которые большинство людей не могут прочитать).
                Это процесс называется "компиляцией", а конечная программа
                называется "выполняемой" или "бинарной". (Процесс также называется
                "построением", т.к. обычно включает больше действий, чем
                просто компиляция.)</p>
            <p> Когда вы приобретаете коммерческое ПО, вы не видите его
                исходный код - он является коммерческой тайной компаний. Вы можете
                получить только готовый выполняемый материал, а это значит, что
                вы никак не сможете модифицировать программу или даже узнать,
                что она делает во время своей работы.</p>
            <p> Программное обеспечение с <a href="http://www.opensource.org/">открытым исходным
                кодом</a> совсем иное. Как видно из названия, исходный код
                открыт каждому для просмотра и модификации. Фактически, большинство ПО
                с открытым исходным кодом только распространяется авторами как открытый код,
                и вы должны скомпилировать его на своем компьютере для получения рабочей программы.
                </p>
            <p> Fink предоставляет выбор между двумя моделями. При дистрибуции на основе
                исходного кода первоначальный исходный код скачивается, адаптируется к политике Mac
                OS X и Fink и компилируется на вашем компьютере. Процесс полностью автоматизирован,
                но занимает некоторое время. При бинарной дистрибуции,
                с другой стороны, предварительно скомпилированные пакеты скачиваются 
                с сайта Fink и инсталлируются, что экономит ваше время, необходимое на
                компиляцию. При желании можно совместить обе модели.
                Далее Руководство рассказывает, как это сделать.</p>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="install.php?phpLang=ru">2. Первоначальная инсталляция</a></p>
<? include_once "../../footer.inc"; ?>


