<?
$title = "Руководство пользователя - Пакеты";
$cvs_author = 'Author: horsager';
$cvs_date = 'Date: 2005/02/01 02:34:17';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Руководство пользователя Contents"><link rel="next" href="upgrade.php?phpLang=ru" title="Обновление Fink"><link rel="prev" href="install.php?phpLang=ru" title="Первоначальная инсталляция">';


include_once "header.ru.inc";
?>
<h1>Руководство пользователя - 3. Инсталляция пакетов</h1>
        
        
        
            <p> Теперь, когда у вас есть то, что может называться инсталляцией Fink,
                данная глава дает информацию, как инсталлировать настоящие пакеты ПО,
                которые вам необходимы. Сначала мы объясним, как
                инсталлировать пакеты с использованием дистрибуции на основе исходного кода и
                бинарной дистрибуции, а также дадим важные сведения, относящиеся к обоим видам дистрибуции.</p>
        
        <h2><a name="bin-dselect">3.1 Инсталляция бинарных пакетов при помощи dselect</a></h2>
            
            <p>
                <code>dselect</code> - программа, которая позволяет просматривать список
                имеющихся пакетов и выбирать те, которые вы хотите инсталлировать.
                Она запускается в Terminal.app, но занимает весь экран
                и обеспечивает простые перемещения при помощи клавиатуры. Как и другие инструменты управления
                пакетами, <code>dselect</code> требует привилегий суперпользователя,
                т.е. вам надо использовать sudo (со счета с привилегиями администратора):</p>
            <pre>sudo dselect</pre>
            <p>
                <b>Примечание:</b>
                У <code>dselect</code> были проблемы с терминальным приложением Mac OS X.
                Надо применить следующие команды
                перед ее использованием или ввести их в соответствующий файл инициализации
                (н-р <code>.cshrc</code> / <code>.profile</code>):</p>
            <p>для пользователей tcsh:</p>
            <pre>setenv TERM xterm-color</pre>
            <p>для пользователей bash:</p>
            <pre>export TERM=xterm-color</pre>
            <p> Главное меню имеет несколько опций:</p>
            <ul>
                <li>
                    <p>
                        <b>[A]ccess</b> - конфигурирует используемый метод доступа к сети.
                        <b>Не надо ее использовать</b>,
                        т.к. Fink предварительно конфигурирует все за вас. 
                        Вообще надо избегать этот пункт меню, т.к. он может перезаписать
                        конфигурацию по умолчанию так, что она не будет работать.</p>
                </li>
                <li>
                    <p>
                        <b>[U]pdate</b> - скачивает список имеющихся пакетов
                        с сайта Fink. Данная опция не инсталлирует
                        и не обновляет пакеты, а просто обновляет
                        листинги, используемые для браузера пакетов.
                        Надо выполнить ее хотя бы однократно после инсталляции Fink.</p>
                </li>
                <li>
                    <p>
                        <b>[S]elect</b> - предоставляет листинг реальных пакетов,
                        в котором вы можете активировать/дезактивировать пакеты
                        в своей системе. Более подробно см. об этом далее.</p>
                </li>
                <li>
                    <p>
                        <b>[I]nstall</b> - именно здесь происходит действие.
                        Пункты меню, указанные выше, влияют только на листинги пакетов dselect
                        и базы данных статуса. Данная опция скачивает и
                        инсталлирует запрошенные пакеты.
                        Она также удаляет пакеты, которые вы дезактивируете в браузере. </p>
                </li>
                <li>
                    <p>
                        <b>[C]onfig</b> и <b>[R]emove</b> - реликвии,
                        оставшиеся со времен, предшествующих apt. Они не нужны,
                        хотя и безвредны.</p>
                </li>
                <li>
                    <p>
                        <b>[Q]uit</b> - теперь поговорим о том, что вы должны для себя уяснить.</p>
                </li>
            </ul>
            <p> Вы потратите большую часть времени на dselect в браузере
                пакетов, доступных через пункт меню "[S]elect". Перед тем, как
                dselect покажет вам список пакетов, вы увидите экран
                вводной помощи. Можно нажать 'k' для получения
                полного списка команд клавиатуры или просто пробел для получения
                списка пакетов.</p>
            <p> Можно передвигаться по списку вверх-вниз при помощи клавиш up и down.
                Выбор осуществляется при помощи '+' и '-'. Когда вы выбираете пакет,
                для которого требуются другие пакеты, dselect показывает подсписок
                с соответствующими пакетами. В большинстве случаев вы можете нажать
                Return для утверждения варианта в dselect. Можно также сделать
                корректировки в подсписке (н-р выбрать другую альтернативу
                для взаимозависимости виртуальных пакетов) или нажать 'R' (н-р Shift-R)
                для возврата к предыдущему состоянию. Оба подсписка и главный список
                пакетов остаются, если нажать Return. Если выбранный вариант вас устраивает,
                оставьте главный список и используйте пункт меню "[I]nstall"
                для инсталляции пакетов.</p>
        
        <h2><a name="bin-apt">3.2 Инсталляция бинарных пакетов при помощи apt-get</a></h2>
            
            <p>
                <code>dselect</code> сам по себе не скачивает пакеты.
                Вместо этого он применяет apt для грязной работы. Если вы
                предпочитаете интерфейс чистой строки команд, можно получить доступ к функциям
                apt напрямую благодаря команде <code>apt-get</code>.</p>
            <p> Как и при работе с dselect, надо сначала скачать текущие листинги
                имеющихся пакетов при помощи </p>
            <pre>sudo apt-get update</pre>
            <p> Подобно пункту меню "[U]pdate" в dselect, эта опция обновляет не
                реальные файлы на вашем компьютере, а только список имеющихся пакетов apt.
                Для инсталляции пакетов просто дайте имя apt-get,
                н-р:</p>
            <pre>sudo apt-get install lynx</pre>
            <p> Если apt-get определит, что пакеты требуют инсталляции других пакетов,
                вам будет предоставлен список и у вас запросят подтверждение.
                Затем запрошенные пакеты будут скачаны и инсталлированы.
                Удалить пакеты можно очень просто:</p>
            <pre>sudo apt-get remove lynx</pre>
            <p>
                
            </p>
        
        <h2><a name="bin-exceptions">3.3 Инсталляция зависимых пакетов, недоступных при бинарной
                дистрибуции</a></h2>
            
            <p>Иногда во время бинарной инсталляции вы можете получить сообщение о том, что
                взаимозависимость не может быть инсталлирована. Пример:</p>
            <pre>Sorry, but the following packages have unmet
                dependencies: foo: Depends: bar (&gt;= version) but it is
                not installable E: Sorry, broken packages</pre>
            <p>Дело в том, что пакет, который вы пытаетесь инсталлировать,
                зависит от другого пакета, который не подлежит бинарной дистрибуции из-за
                лицензионных требований. Вам надо инсталлировать взаимозависимость от исходного кода
                (см. следующий раздел).</p>
        
        <h2><a name="src">3.4 Инсталляция бинарных пакетов и пакетов на основе исходного кода при помощи fink</a></h2>
            
            <p> Инструмент <code>fink</code> позволяет инсталлировать пакеты, которые
                еще не доступны в <a href="intro.php?phpLang=ru#src-vs-bin">бинарной дистрибуции</a>. </p>
            <p>Прежде всего вам нужна соответствующая версия инструментов разработки
                (Development Tools) для системы. Их можно бесплатно скачать после регистрации
                на сайте <a href="http://connect.apple.com">http://connect.apple.com</a>.</p>
            <p> Для получения списка пакетов, готовых к инсталляции на основе исходного кода,
                надо попросить инструмент <code>fink</code>:</p>
            <pre>fink list</pre>
            <p> Первая колонка отражает в списке статус инсталляции (незаполненный в случае
                неинсталированной версии, <code>i</code> при инсталлированной и <code>(i)</code> при
                инсталлированной, но не последней версии), после чего указывается
                имя пакета, последняя версия и краткое описание.Можно
                запросить больше информации об отдельном пакете при помощи команды </p>
            <pre>fink describe xmms</pre>
            <p> После нахождения пакета, который вы хотите инсталлировать, примените команду
                "install":</p>
            <pre>fink install wget-ssl</pre>
            <p> Команда <code>fink</code> сначала проверит наличие всех необходимых
                предварительных условий ("взаимозависимостей") и спросит вашего разрешения
                на их инсталляцию в случае отсутствия некоторых из них. Затем
                продолжит выполнение действий и скачает исходный код, распакует его, сделает патчи,
                компиляцию и инсталлирует результаты в вашей системе.Это может
                занять много времени. Если в течение этого процесса возникнут ошибки,
                сначала обратитесь к <a href="http://fink.sourceforge.net/faq/">Ч.З.В.</a>. </p>
            <p> Для версий <code>fink</code> начиная с 0.23.0 можно попытаться
                скачать предварительно компилированные бинарные пакеты, если они есть в наличии,
                вместо того чтобы строить их. Просто перенесите <a href="usage.php?phpLang=ru#options">--use-binary-dist (or -b) option</a> в
                <code>fink</code>. Это может сэкономить много времени. Н-р, при обращении к </p>
            <pre>fink --use-binary-dist install wget-ssl</pre>
            <p>или</p>
            <pre>fink -b install wget-ssl</pre>
            <p> сначала скачиваются все зависимости для wget-ssl, которые
                обеспечиваются бинарной дистрибуцией, и только
                остальное строится на основе исходного кода. Данная опция также может быть постоянно активированной
                в <a href="conf.php?phpLang=ru">Fink configuration
                file</a> (fink.conf) или благодаря команде <code>fink
                configure</code>. </p>
            <p> Более подробную информацию об инструментах  <code>fink</code> см. в
                главе <a href="usage.php?phpLang=ru">"Использование инструмента fink при помощи
                    строки команд"</a>. </p>
        
        <h2><a name="fink-commander">3.5 Fink Commander</a></h2>
            
            <p>Fink Commander является интерфейсом Aqua и для <code>apt-get</code>,
                и для инструмента <code>fink</code>. Бинарное меню позволяет осуществлять
                операции бинарной дистрибуции, а меню исходного кода -
                операции дистрибуции на основе исходного кода.</p>
            <p>Fink Commander входит в бинарный инсталлятор Fink. Если вы хотите скачать его
                отдельно (н-р, если вы загрузили Fink от
                исходного кода) или получить дополнительные сведения, посетите сайт<a href="http://finkcommander.sourceforge.net">Fink Commander</a>.</p>
        
        <h2><a name="available-versions">3.6 Имеющиеся версии</a></h2>
            
            <p>Если вы хотите инсталлировать пакет, сначала надо проверить
                    <a href="http://fink.sourceforge.net/pdb/index.php">базу данных
                по пакетам</a> и посмотреть, можно ли это сделать через Fink.
                Имеющиеся версии пакета отражены в нескольких
                строках таблицы. А именно:</p>
            <ul>
                <li>
                    <p>
                        <b>0.4.1:</b> версия, которую можно инсталлировать
                        на основе бинарных файлов для OS 10.1.</p>
                </li>
                <li>
                    <b>0.6.3:</b> версия, которую можно инсталлировать
                        на основе бинарных файлов для OS 10.2.</li>
                <li>
                    <p>
                        <b>0.7.1:</b> базовая версия,
                        которую можно инсталлировать на основе бинарных файлов для OS 10.3,
                        в рамках текущего выпуска Fink. Если вы делаете <a href="upgrade.php?phpLang=ru">upgrade</a> Fink, возможно наличие
                        более поздней версии специально для OS, которая здесь не отражена.</p>
                </li>
                <li>
                    <p>
                        <b>current-10.2-gcc3.3 stable:</b> последняя
                        стабильная версия, которую можно инсталлировать на основе
                        исходного кода для OS 10.2 с обновлением <code>gcc 3.3</code> для
                        Developer Tools. Для инсталляции этой версии вам
                        возможно понадобится активировать доступ <a href="http://fink.sourceforge.net/doc/cvsaccess/index.php">CVS</a>
                        или rsync. Если вы не примените обновление <code>gcc
                        3.3</code>, то можете не увидеть эту версию (или
                        даже сам пакет).</p>
                    <p>Прим.: В отличие от других проектов, Fink
                        распространяет наиболее свежие стабильные версии пакетов
                        через CVS, а также версии, нуждающиеся в проверке (см.
                        далее раздел о нестабильных пакетах). Активация опции обновления CVS или rsync
                        дает доступ к новым стабильным версиям пакетов еще до того,
                        как обновляется бинарная дистрибуция.</p>
                </li>
                <li>
                    <p>
                        <b>current-10.3 stable:</b> последняя версия,
                        которую можно инсталлировать от исходного кода в OS 10.3.
                        Опять же, может потребоваться доступ к данной версии через CVS или rsync.</p>
                </li>
                <li>
                    <p>
                        <b>current-10.2-gcc3.3 unstable:</b> последняя
                        нестабильная версия, которую можно инсталлировать от
                        исходного кода в OS 10.2 с <code>gcc 3.3</code>. Для ее инсталляции
                        следуйте <a href="http://fink.sourceforge.net/faq/usage-fink.php#unstable">инструкциям</a>
                        о том, как инсталлировать нестабильные пакеты.</p>
                    <p>Прим.: нестабильность не обязательно значит, что их нельзя использовать, но
                        инсталляция таких пакетов будет на ваш риск.</p>
                </li>
                <li>
                    <b>current-10.3 unstable:</b> последняя нестабильная версия,
                    которую можно инсталлировать от исходного кода в OS 10.3.
                    Надо активировать нестабильное дерево указанным выше образом.</li>
            </ul>
        
        <h2><a name="x11">3.7 Сортировка X11</a></h2>
            
            <p>Многие пакеты, доступные через Fink, требуют инсталляции
                определенной формы X11. По этой причине одно из первых действий,
                которое обычно выполняется - выбор вида реализации X11.</p>
            <p> Т.к. есть несколько видов реализации X11 для Mac OS
                X (XFree86, Tenon Xtools, eXodus) и несколько способов их инсталляции
                (вручную или через Fink), есть несколько альтернативных пакетов -
                один для каждой настройки. Fink не может угадывать, что у вас есть,
                значит, очень важно сделать правильный выбор пакета и инсталлировать его
                до инсталляции приложений X11. Далее приведен список
                имеющихся пакетов и способов инсталляции X11:</p>
            <ul>
                <li>
                    <p>
                        <b>xfree86-base:</b> (только 10.1 или 10.2) Это реальный пакет.
                        Он инсталлирует всю загрузку XFree86
                        4.2.1.1 как пакет Fink. Для максимальной гибкости он не
                        содержит реальный сервер XDarwin. Для получения данного пакета
                        надо инсталлировать пакет xfree86-rootless.</p>
                </li>
                <li>
                    <p>
                        <b>xfree86:</b> Это одинарный пакет (в который входит
                        сервер дисплея) для инсталляции XFree86 4.3.0 (только 10.2
                        ) или 4.3.99 (только 10.3). Данная версия быстрее, чем
                        4.2.1.1, но не проверена в такой же степени.</p>
                </li>
                <li>
                    <p> system-xfree86: Данный пакет автоматически появляется
                        (в случае Fink 0.6.2 и более поздних версий), если вы инсталлируете XFree86
                        вручную от исходного кода или на основе официальной (или неофициальной) бинарной
                        дистрибуции, либо если вы инсталлируете
                        Apple X11. Затем он действует как заполнитель зависимости.</p>
                </li>
                <li>
                    <p> system-xtools: Инсталлирует этот пакет, если у вас инсталлирован продукт Tenon
                        Xtools. Как и system-xfree86, он просто производит
                        проверку на чистоту и не трогает реальные файлы.</p>
                </li>
            </ul>
            <p> Для получения более подробной информации об инсталляции и выполнении X11 см.
                    документ <a href="http://fink.sourceforge.net/doc/x11/">X11 в
                    Darwin и Mac OS X</a>.</p>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="upgrade.php?phpLang=ru">4. Обновление Fink</a></p>
<? include_once "../../footer.inc"; ?>


