<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"><title>Fink Documentation - Fink &#12518;&#12540;&#12470;&#12540;&#12460;&#12452;&#12489;</title></head><body><h1 style="text-align: center;">Fink &#12518;&#12540;&#12470;&#12540;&#12460;&#12452;&#12489;</h1>
<p>
<b>&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#26410;&#23436;&#25104;&#12391;&#12377;&#12290;</b>
&#20197;&#19979;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12424;&#12426;&#24195;&#31684;&#22258;&#12394;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;:
<a href="http://fink.sourceforge.net/doc/bundled/install.php">&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a>,
<a href="http://fink.sourceforge.net/doc/bundled/usage.php">&#20351;&#29992;&#26041;&#27861;</a>
&#12362;&#12424;&#12403;&#12496;&#12452;&#12490;&#12522;&#12398;&#12487;&#12451;&#12473;&#12463;&#12452;&#12513;&#12540;&#12472;&#12395;&#12354;&#12427; ReadMe.rtf &#12290;
&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#20013;&#12398; <a href="http://fink.sourceforge.net/doc/">Documentation &#12475;&#12463;&#12471;&#12519;&#12531;</a> &#12418;&#20341;&#12379;&#12390;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12371;&#12371;&#12395;&#12354;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12418;&#24441;&#12395;&#31435;&#12388;&#12391;&#12375;&#12423;&#12358;&#12290;
</p>
<p>
Fink &#12518;&#12540;&#12470;&#12540;&#12474;&#12460;&#12452;&#12489;&#12408;&#12424;&#12358;&#12371;&#12381;&#12290;
&#12371;&#12398;&#12460;&#12452;&#12489;&#12391;&#12399;&#12289;&#12477;&#12540;&#12473;&#12363;&#12425;&#12392;&#12496;&#12452;&#12490;&#12522;&#12363;&#12425;&#12398;&#20001;&#26041;&#12395;&#12388;&#12356;&#12390;&#12289;&#21021;&#12417;&#12390;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12392;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12398;&#20181;&#26041;&#12395;&#12388;&#12356;&#12390;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12392;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12398;&#12371;&#12392;&#12418;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<h2>Contents</h2><ul><li><a href="#intro"><b>1 &#12399;&#12376;&#12417;&#12395;</b></a><ul><li><a href="#intro.what">1.1 Fink &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.req">1.2 &#24517;&#35201;&#26465;&#20214;</a></li><li><a href="#intro.supported-os">1.3 &#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;</a></li><li><a href="#intro.src-vs-bin">1.4 &#12477;&#12540;&#12473; vs. &#12496;&#12452;&#12490;&#12522;</a></li></ul></li><li><a href="#install"><b>2 &#21021;&#12417;&#12390;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</b></a><ul><li><a href="#install.bin">2.1 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#install.src">2.2 &#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#install.setup">2.3 &#29872;&#22659;&#12398;&#35373;&#23450;</a></li></ul></li><li><a href="#packages"><b>3 &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</b></a><ul><li><a href="#packages.bin-dselect">3.1 dselect &#12395;&#12424;&#12427;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#packages.bin-apt">3.2 apt-get &#12434;&#20351;&#12387;&#12383;&#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#packages.bin-exceptions">3.3 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#12394;&#12356;&#20381;&#23384;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#packages.src">3.4 &#12477;&#12540;&#12473;&#12363;&#12425;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#packages.fink-commander">3.5 Fink Commander</a></li><li><a href="#packages.">3.6 &#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;</a></li><li><a href="#packages.x11">3.7 X11 &#12434;&#20351;&#12358;</a></li></ul></li><li><a href="#upgrade"><b>4 Fink &#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</b></a><ul><li><a href="#upgrade.bin">4.1 &#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></li><li><a href="#upgrade.src">4.2 &#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></li><li><a href="#upgrade.mix">4.3 &#12496;&#12452;&#12490;&#12522;&#12392;&#12477;&#12540;&#12473;&#12398;&#28151;&#22312;</a></li></ul></li><li><a href="#conf"><b>5 Fink &#35373;&#23450;&#12501;&#12449;&#12452;&#12523;</b></a><ul><li><a href="#conf.about">5.1 fink.conf &#12395;&#12388;&#12356;&#12390;</a></li><li><a href="#conf.syntax">5.2 fink.conf &#25991;&#27861;</a></li><li><a href="#conf.required">5.3 &#24517;&#38920;&#35373;&#23450;</a></li><li><a href="#conf.optional">5.4 &#12518;&#12540;&#12470;&#12540;&#35373;&#23450;</a></li><li><a href="#conf.downloding">5.5 &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#35373;&#23450;</a></li><li><a href="#conf.mirrors">5.6 &#12511;&#12521;&#12540;&#35373;&#23450;</a></li><li><a href="#conf.developer">5.7 &#38283;&#30330;&#32773;&#29992;&#35373;&#23450;</a></li></ul></li><li><a href="#usage"><b>6 &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531; fink &#12484;&#12540;&#12523;&#12398;&#20351;&#29992;&#26041;&#27861;</b></a><ul><li><a href="#usage.using">6.1 fink &#12484;&#12540;&#12523;&#12398;&#20351;&#29992;</a></li><li><a href="#usage.install">6.2 install</a></li><li><a href="#usage.remove">6.3 remove</a></li><li><a href="#usage.update-all">6.4 update-all</a></li><li><a href="#usage.list">6.5 list</a></li><li><a href="#usage.apropos">6.6 apropos</a></li><li><a href="#usage.describe">6.7 describe</a></li><li><a href="#usage.fetch">6.8 fetch</a></li><li><a href="#usage.fetch-all">6.9 fetch-all</a></li><li><a href="#usage.fetch-missing">6.10 fetch-missing</a></li><li><a href="#usage.build">6.11 build</a></li><li><a href="#usage.rebuild">6.12 rebuild</a></li><li><a href="#usage.reinstall">6.13 reinstall</a></li><li><a href="#usage.configure">6.14 configure</a></li><li><a href="#usage.selfupdate">6.15 selfupdate</a></li><li><a href="#usage.index">6.16 index</a></li><li><a href="#usage.validate">6.17 validate</a></li><li><a href="#usage.scanpackages">6.18 scanpackages</a></li><li><a href="#usage.checksums">6.19 checksums</a></li><li><a href="#usage.cleanup">6.20 cleanup</a></li></ul></li></ul><h2><a name="intro">1 &#12399;&#12376;&#12417;&#12395;</a></h2>


<h3><a name="intro.what">1.1 Fink &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
Fink &#12399; Unix &#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12539;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434; Mac OS X &#12392; Darwin &#21521;&#12369;&#12395;&#25552;&#20379;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
Linux &#12420;&#21516;&#27096;&#12398;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#21521;&#12369;&#12395;&#38283;&#30330;&#12373;&#12428;&#12383;&#12289;&#12383;&#12367;&#12373;&#12435;&#12398;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12420;&#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12394;&#12501;&#12522;&#12540;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434; Mac &#12391;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
</p>

<h3><a name="intro.req">1.2 &#24517;&#35201;&#26465;&#20214;</a></h3>

<p>
&#24517;&#38920;:
</p>
<ul>
<li>
<p>
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12415;&#12398; Mac OS X &#12471;&#12473;&#12486;&#12512;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531; 10.2 &#12414;&#12383;&#12399;&#12381;&#12428;&#20197;&#38477;&#12289;&#12354;&#12427;&#12356;&#12399;&#21516;&#31561;&#12398; Darwin &#12522;&#12522;&#12540;&#12473;&#12290;
&#12371;&#12428;&#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;<b>&#21205;&#20316;&#12375;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;</b>&#12290;
&#12469;&#12509;&#12540;&#12488;&#23550;&#35937;&#12471;&#12473;&#12486;&#12512;&#12398;&#35443;&#32048;&#12399;&#12289;&#20197;&#19979;&#12434;&#24481;&#35239;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#25509;&#32154;&#12290;
&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12392;&#12496;&#12452;&#12490;&#12522;&#12398;&#20001;&#26041;&#12392;&#12418;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12469;&#12452;&#12488;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
</p>
</li>
</ul>
<p>
&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531; (&#19979;&#35352;&#21442;&#29031;) &#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;&#20197;&#19979;&#12418;&#24517;&#35201;&#12391;&#12377;:
</p>
<ul>
<li>
<p>
Development tools&#12290;
Mac OS X &#12391;&#12399;&#12289; Developer.pkg &#12497;&#12483;&#12465;&#12540;&#12472;&#12434; Developer Tools CD &#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399; Mac OS X &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
Darwin &#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12484;&#12540;&#12523;&#12364;&#12354;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p>
<p>
&#12477;&#12540;&#12473;&#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12377;&#12427;&#20104;&#23450;&#12364;&#12394;&#12367;&#12390;&#12418;&#12289; Developer Tools &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12362;&#12367;&#12392;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#20013;&#12395;&#12399;&#12289;&#19968;&#33324;&#30340;&#12394;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12484;&#12540;&#12523;&#12418;&#12354;&#12426;&#12414;&#12377;&#12375;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12424;&#12387;&#12390;&#12399;&#24517;&#35201;&#12394;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
&#24525;&#32784;&#12290;
&#22823;&#12365;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#12398;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12371;&#12391;&#12356;&#12358;&#26178;&#38291;&#12399;&#12289;&#25991;&#23383;&#36890;&#12426;&#25968;&#26178;&#38291;&#12363;&#12425;&#25968;&#26085;&#12363;&#12363;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
</li>
</ul>

<h3><a name="intro.supported-os">1.3 &#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;</a></h3>

<p>
<b>Mac OS X 10.3</b> &#12399; Fink &#12434;&#23455;&#34892;&#12377;&#12427;&#12398;&#12395;&#26368;&#36969;&#12394;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
&#20840;&#12390;&#12398;&#38283;&#30330;&#32773;&#12364;&#12371;&#12428;&#12434;&#20351;&#12387;&#12390;&#12356;&#12390;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12486;&#12473;&#12488;&#12434;&#34892;&#12394;&#12358;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
"&#23436;&#20840;&#12395;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12486;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;" &#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#31232;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12398;&#21839;&#38988;&#12364;&#12354;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
<b>Mac OS X 10.2</b> &#12399;&#29694;&#22312;&#12391;&#12418;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12424;&#12387;&#12390;&#12399; 10.2 &#29256;&#12364;&#12394;&#12356;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
<b>Mac OS X 10.1</b> &#12399;&#29694;&#22312;&#12391;&#12418;&#21046;&#38480;&#20184;&#12365;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
Fink 0.4.1 &#12364;&#20351;&#29992;&#12391;&#12365;&#12427;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12377;&#12290;
</p>
<p>
<b>Darwin 7.0.1</b> &#12364; Mac OS X 10.3 &#12395;&#12289; <b>Darwin 6.0.2</b> &#12364; Mac OS X 10.2 &#30456;&#24403;&#12377;&#12427; Darwin &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12377;&#12290;
&#22522;&#26412;&#30340;&#12395;&#12399;&#21205;&#20316;&#12377;&#12427;&#12399;&#12378;&#12391;&#12377;&#12364;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#20154;&#12399; Mac OS X &#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#12486;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
Mac OS X &#22266;&#26377;&#12398;&#27231;&#33021;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12399;&#21839;&#38988;&#12364;&#30330;&#29983;&#12377;&#12427;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
&#24433;&#38911;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289; XFree86 &#12392;&#12289;&#12362;&#12381;&#12425;&#12367; esound &#12391;&#12377;&#12290;
</p>

<h3><a name="intro.src-vs-bin">1.4 &#12477;&#12540;&#12473; vs. &#12496;&#12452;&#12490;&#12522;</a></h3>

<p>
&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;&#20154;&#38291;&#12364;&#35501;&#12417;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#35328;&#35486;&#12391;&#26360;&#12363;&#12428;&#12390; ("&#38283;&#30330;&#12373;&#12428;&#12390;") &#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#24418;&#24335;&#12399; "&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;" &#12392;&#21628;&#12400;&#12428;&#12427;&#12418;&#12398;&#12391;&#12289;&#20302;&#12524;&#12505;&#12523;&#12398; (&#22823;&#25269;&#12398;&#20154;&#38291;&#12399;&#35501;&#12417;&#12394;&#12356;) &#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12364;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12428;&#12434;&#27231;&#26800;&#35486;&#12395;&#22793;&#25563;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399; "&#12467;&#12531;&#12497;&#12452;&#12523;" &#12392;&#12356;&#12356;&#12289;&#12391;&#12365;&#12383;&#12418;&#12398;&#12434; "&#23455;&#34892;&#21487;&#33021;&#12501;&#12449;&#12452;&#12523;" &#12420; "&#12496;&#12452;&#12490;&#12522;"&#12392;&#12356;&#12356;&#12414;&#12377;&#12290;
(&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#20197;&#22806;&#12398;&#12473;&#12486;&#12483;&#12503;&#12418;&#21547;&#12416;&#12398;&#12391;&#12289;&#12499;&#12523;&#12489;&#12392;&#21628;&#12406;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;)
</p>
<p>
&#21830;&#26989;&#29992;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#36092;&#20837;&#12377;&#12427;&#38555;&#12399;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#35211;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#20225;&#26989;&#12399;&#31192;&#23494;&#12392;&#12375;&#12390;&#25201;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#20837;&#25163;&#12377;&#12427;&#12398;&#12399;&#23455;&#34892;&#21487;&#33021;&#12501;&#12449;&#12452;&#12523;&#12384;&#12369;&#12391;&#12377;&#12398;&#12391;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12420;&#12289;&#23455;&#34892;&#26178;&#12395;&#20309;&#12364;&#36215;&#12371;&#12387;&#12390;&#12356;&#12427;&#12398;&#12363;&#30693;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p>
<p>
&#12371;&#12428;&#12399; <a href="http://www.opensource.org/">&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;</a> &#12398;&#22580;&#21512;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;
&#21517;&#31216;&#12364;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12399;&#20844;&#38283;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#35501;&#12416;&#12371;&#12392;&#12418;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;
&#20107;&#23455;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12539;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12399;&#12289;&#20316;&#32773;&#12363;&#12425;&#12399;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12398;&#24418;&#24335;&#12391;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12427;&#12384;&#12369;&#12391;&#12289;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399;&#33258;&#20998;&#12398;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#19978;&#12391;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
Fink &#12391;&#12399;&#12289;&#20108;&#12388;&#12398;&#36984;&#25246;&#32930;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
" &#12477;&#12540;&#12473; " &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#20803;&#12398;&#12477;&#12540;&#12473;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289; Mac OS X &#12392; Fink &#12509;&#12522;&#12471;&#12540;&#12395;&#23550;&#24540;&#12373;&#12379;&#12390;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#20840;&#12390;&#33258;&#21205;&#30340;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#22810;&#23569;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
&#20182;&#26041;&#12289; " &#12496;&#12452;&#12490;&#12522; " &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#28168;&#12415;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434; Fink &#12469;&#12452;&#12488;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12467;&#12531;&#12497;&#12452;&#12523;&#12395;&#35201;&#12377;&#12427;&#26178;&#38291;&#12434;&#31680;&#32004;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20108;&#12388;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;
&#12371;&#12398;&#12510;&#12491;&#12517;&#12450;&#12523;&#12391;&#12399;&#12289;&#20001;&#26041;&#12398;&#20351;&#29992;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p>

<h2><a name="install">2 &#21021;&#12417;&#12390;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h2>



<p>
&#21021;&#12417;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#38291;&#12289;&#12510;&#12471;&#12531;&#12395;&#12399;&#22522;&#26412;&#12471;&#12473;&#12486;&#12512;&#12392;&#12497;&#12483;&#12465;&#12540;&#12472;&#31649;&#29702;&#12484;&#12540;&#12523;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12398;&#24460;&#12395;&#12399;&#12289; Fink &#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12383;&#12417;&#12289;&#12471;&#12455;&#12523;&#12398;&#29872;&#22659;&#22793;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20316;&#26989;&#12399;&#19968;&#24230;&#12384;&#12369;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;
Fink &#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12399;&#12289;&#20877;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12394;&#12375;&#12391;&#34892;&#12394;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377; (&#12522;&#12522;&#12540;&#12473; 0.2.0 &#20197;&#38477;)&#12290;
<a href="#upgrade">&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12398;&#31456;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
&#12497;&#12483;&#12465;&#12540;&#12472;&#31649;&#29702;&#12484;&#12540;&#12523;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12425;&#12289;&#12371;&#12428;&#12434;&#20351;&#12387;&#12390;&#12373;&#12425;&#12395;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
<a href="#packages">&#12497;&#12483;&#12465;&#12540;&#12472;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#31456;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>

<h3><a name="install.bin">2.1 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12451;&#12473;&#12463;&#12452;&#12513;&#12540;&#12472; (.dmg) &#12398;&#20013;&#12395;&#12289; Mac OS X &#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12497;&#12483;&#12465;&#12540;&#12472;&#24418;&#24335; (.pkg) &#12391;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12487;&#12451;&#12473;&#12463;&#12452;&#12513;&#12540;&#12472;&#12434;<a href="http://fink.sourceforge.net/download/bindist.php">&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12510;&#12454;&#12531;&#12488;&#12375;&#12414;&#12377;&#12290;
"Fink 0.x.x Installer" &#12434;&#38283;&#12365;&#12414;&#12377;&#12290;
Disk Copy &#12364;&#12501;&#12449;&#12452;&#12523;&#12434;&#28857;&#26908;&#12375;&#12383;&#24460;&#12395;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#20986;&#12390;&#12367;&#12427;&#12487;&#12451;&#12473;&#12463;&#12450;&#12452;&#12467;&#12531;&#12398;&#12371;&#12392;&#12391;&#12377;&#12290;
&#12371;&#12398;&#20013;&#12395;&#12399;&#12289;&#12489;&#12461;&#12517;&#12513;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#20837;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#35500;&#26126;&#12395;&#24467;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#32862;&#12363;&#12428;&#12289;&#25991;&#31456;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12460;&#12452;&#12489;&#12424;&#12426;&#12418;&#26032;&#12375;&#12356;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12289;&#12394;&#12427;&#12409;&#12367;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#20808;&#12398;&#12489;&#12521;&#12452;&#12502;&#12434;&#32862;&#12356;&#12390;&#12365;&#12383;&#12425;&#12289;&#12471;&#12473;&#12486;&#12512;&#12508;&#12522;&#12517;&#12540;&#12512; (Mac OS X &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12508;&#12522;&#12517;&#12540;&#12512;) &#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12418;&#12375;&#38291;&#36949;&#12387;&#12383;&#12508;&#12522;&#12517;&#12540;&#12512;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289; Fink &#12399;&#21205;&#20316;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#32066;&#20102;&#12375;&#12383;&#12425;&#12289;<a href="#install.setup">&#29872;&#22659;&#12398;&#35373;&#23450;</a>&#31680;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>

<h3><a name="install.src">2.2 &#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399;&#27161;&#28310;&#30340;&#12394; Unix tarball (.tar.bz) &#12391;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399; <tt style="white-space: nowrap;">fink</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12510;&#12493;&#12540;&#12472;&#12515;&#12392;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12384;&#12369;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12390;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#29992;&#12398;&#12477;&#12540;&#12473;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
<a href="http://fink.sourceforge.net/download/srcdist.php">&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12506;&#12540;&#12472;</a>&#12363;&#12425;&#20837;&#25163;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
tar &#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#35299;&#20941;&#12377;&#12427;&#38555;&#12395;&#12289; StuffIt Expander &#12434;&#20351;&#12431;&#12394;&#12356;&#12424;&#12358;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
StuffIt &#12399;&#12414;&#12384;&#38263;&#12356;&#12501;&#12449;&#12452;&#12523;&#21517;&#12434;&#25201;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
StuffIt Expander &#12364;&#35299;&#20941;&#12375;&#12390;&#12375;&#12414;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#12501;&#12457;&#12523;&#12480;&#12372;&#12392;&#25448;&#12390;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
&#12477;&#12540;&#12473;&#12522;&#12522;&#12540;&#12473;&#12399;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12414;&#12378;&#12479;&#12540;&#12511;&#12490;&#12523;.app &#12434;&#38283;&#12365;&#12289; fink-0.x.x-full.tar.gz &#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;
&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12391;&#12450;&#12540;&#12459;&#12452;&#12502;&#12434;&#35299;&#20941;&#12375;&#12414;&#12377;&#12290;
</p>
<pre>tar -xzf fink-0.x.x-full.tar.gz</pre>
<p>
&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12450;&#12540;&#12459;&#12452;&#12502;&#12392;&#21516;&#21517;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;
&#20197;&#19979;&#12418; <tt style="white-space: nowrap;">fink-0.x.x-full</tt> &#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12395;&#20837;&#12426;&#12289;&#12502;&#12540;&#12488;&#12473;&#12488;&#12521;&#12483;&#12503;&#12467;&#12510;&#12531;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;:
</p>
<pre>cd fink-0.x.x-full
./bootstrap.sh</pre>
<p>
&#12473;&#12463;&#12522;&#12503;&#12488;&#12364;&#12471;&#12473;&#12486;&#12512;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289; sudo &#12434;&#20351;&#12387;&#12390; root &#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#26178;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#32862;&#12356;&#12390;&#12365;&#12414;&#12377;&#12290;
&#27425;&#12395;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12497;&#12473;&#12434;&#32862;&#12356;&#12390;&#12365;&#12414;&#12377;&#12290;
&#29305;&#12395;&#29702;&#30001;&#12364;&#12394;&#12356;&#38480;&#12426;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12497;&#12473; /sw &#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12497;&#12473;&#12434;&#20363;&#12392;&#12375;&#12390;&#20351;&#12356;&#12414;&#12377;&#12398;&#12391;&#12289;&#12497;&#12473;&#12434;&#25563;&#12360;&#12383;&#22580;&#21512;&#12399;&#36969;&#23452;&#32622;&#12365;&#25563;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
&#27425;&#12395;&#12367;&#12427;&#12398;&#12399; Fink &#12398;&#35373;&#23450;&#12391;&#12377;&#12290;
&#12503;&#12525;&#12461;&#12471;&#12289;&#12511;&#12521;&#12540;&#12398;&#35373;&#23450;&#12420; verbose &#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#32862;&#12363;&#12428;&#12414;&#12377;&#12290;
&#36074;&#21839;&#12364;&#29702;&#35299;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12479;&#12540;&#12531;&#12461;&#12540;&#12434;&#25276;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399;&#12289;&#24460;&#12391;&#12418; <tt style="white-space: nowrap;">fink configure</tt> &#12467;&#12510;&#12531;&#12489;&#12391;&#20877;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
&#12502;&#12540;&#12488;&#12473;&#12488;&#12521;&#12483;&#12503;&#12473;&#12463;&#12522;&#12503;&#12488;&#12395;&#12399;&#12289;&#24517;&#35201;&#12394;&#24773;&#22577;&#12364;&#20840;&#12390;&#12354;&#12426;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#12467;&#12531;&#12497;&#12452;&#12523;&#12434;&#22987;&#12417;&#12414;&#12377;&#12290;
&#12371;&#12398;&#26178;&#28857;&#12391;&#12399;&#12371;&#12428;&#20197;&#19978;&#12398;&#12452;&#12531;&#12479;&#12521;&#12463;&#12471;&#12519;&#12531;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12414;&#12383;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#20108;&#24230;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#24515;&#37197;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12377;&#12427;&#12398;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12510;&#12493;&#12540;&#12472;&#12515;&#12364;&#24517;&#35201;&#12394;&#12383;&#12417;&#12391;&#12377;&#12290;
</p>
<p>
&#12502;&#12540;&#12488;&#12473;&#12488;&#12521;&#12483;&#12503;&#12364;&#32066;&#12387;&#12383;&#12425;&#12289;<a href="#install.setup">&#29872;&#22659;&#12398;&#35373;&#23450;</a> &#31680;&#12408;&#36914;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>

<h3><a name="install.setup">2.3 &#29872;&#22659;&#12398;&#35373;&#23450;</a></h3>

<p>
Fink &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#38542;&#23652;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#31649;&#29702;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#21547;&#12417;&#12390;&#12289;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289; PATH &#29872;&#22659;&#22793;&#25968;&#12394;&#12393;&#12434;&#12381;&#12428;&#12382;&#12428;&#35373;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12399;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12387;&#12390;
</p>
<pre>open /sw/bin/pathsetup.command</pre>
<p>
&#12392;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12371;&#12428;&#12364;&#21177;&#12363;&#12394;&#12356;&#22580;&#21512;&#12399;&#25163;&#21205;&#12391;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12471;&#12455;&#12523;&#12395;&#12424;&#12387;&#12390;&#12420;&#12426;&#26041;&#12364;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;
&#29694;&#22312;&#12398;&#12471;&#12455;&#12523;&#12434;&#30693;&#12427;&#12395;&#12399;&#12289;&#12479;&#12540;&#12511;&#12490;&#12523;&#12434;&#38283;&#12365;:
</p>
<pre>echo $SHELL</pre>
<p>
&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20013;&#12395; "csh" &#12363; "tcsh" &#12392;&#12354;&#12387;&#12383;&#12425;&#12289; C &#12471;&#12455;&#12523;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
bash, zsh, sh &#12414;&#12383;&#12399;&#20284;&#12383;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12354;&#12428;&#12400;&#12289; bourne &#12471;&#12455;&#12523;&#12398;&#27966;&#29983;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<ul>
 <li>
  <p>Bourne &#12471;&#12455;&#12523; (Mac OS X 10.3 &#20197;&#38477;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;) </p>
  <p>
   Bourne &#12471;&#12455;&#12523;&#31995; (sh, bash, zsh &#12394;&#12393;) &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#34892;&#12434;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398; <tt style="white-space: nowrap;">.profile</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#36861;&#21152;&#12375;&#12390;&#19979;&#12373;&#12356; (&#12354;&#12427;&#12356;&#12399;&#12289; <tt style="white-space: nowrap;">.bash_profile</tt> &#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12385;&#12425;&#12434;&#20351;&#12387;&#12390;&#19979;&#12373;&#12356;):
  </p>
  <pre>source /sw/bin/init.sh</pre>
  <p>
   &#34892;&#36861;&#21152;&#12398;&#26041;&#27861;&#12434;&#30693;&#12425;&#12394;&#12356;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;:
  </p>
  <pre>cd pico .profile</pre>
  <p>
   &#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531; (&#12501;&#12523;&#12539;&#12479;&#12540;&#12511;&#12490;&#12523;&#12454;&#12451;&#12531;&#12489;&#12454;) &#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12395;&#12394;&#12426;&#12289; <tt style="white-space: nowrap;">source /sw/bin/init.sh</tt> &#34892;&#12434;&#12479;&#12452;&#12503;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
   "New file" &#12392;&#12356;&#12358;&#25991;&#23383;&#12364;&#20986;&#12390;&#12356;&#12390;&#12418;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;
   &#34892;&#12434;&#36861;&#21152;&#12375;&#12383;&#12425;&#12289;&#26368;&#20302;&#19968;&#22238;&#12399;&#12522;&#12479;&#12540;&#12531;&#12461;&#12540;&#12434;&#25276;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
   &#12381;&#12398;&#24460;&#12289; Control-O, Return, Control-X &#12392;&#25276;&#12375;&#12390;&#12289;&#12456;&#12487;&#12451;&#12479;&#12363;&#12425;&#25244;&#12369;&#12390;&#19979;&#12373;&#12356;&#12290;
  </p>
 </li>
 <li>
  <p>C &#12471;&#12455;&#12523; (Mac OS X 10.2 &#12414;&#12391;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;) </p>
  <p>
   tcsh &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#34892;&#12434;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398; <tt style="white-space: nowrap;">.cshrc</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#36861;&#21152;&#12375;&#12390;&#19979;&#12373;&#12356;:
  </p>
  <pre>source /sw/bin/init.csh</pre>
  <p>
   &#34892;&#36861;&#21152;&#12398;&#26041;&#27861;&#12434;&#30693;&#12425;&#12394;&#12356;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;:
  </p>
  <pre>cd pico .cshrc</pre>
  <p>
   &#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531; (&#12501;&#12523;&#12539;&#12479;&#12540;&#12511;&#12490;&#12523;&#12454;&#12451;&#12531;&#12489;&#12454;) &#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12395;&#12394;&#12426;&#12289; <tt style="white-space: nowrap;">source /sw/bin/init.csh</tt> &#34892;&#12434;&#12479;&#12452;&#12503;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
   "New file" &#12392;&#12356;&#12358;&#25991;&#23383;&#12364;&#20986;&#12390;&#12356;&#12390;&#12418;&#22823;&#19976;&#22827;&#12391;&#12377;&#12290;
   &#34892;&#12434;&#36861;&#21152;&#12375;&#12383;&#12425;&#12289;&#26368;&#20302;&#19968;&#22238;&#12399;&#12522;&#12479;&#12540;&#12531;&#12461;&#12540;&#12434;&#25276;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
   &#12381;&#12398;&#24460;&#12289; Control-O, Return, Control-X &#12392;&#25276;&#12375;&#12390;&#12289;&#12456;&#12487;&#12451;&#12479;&#12363;&#12425;&#25244;&#12369;&#12390;&#19979;&#12373;&#12356;&#12290;
  </p>
  <p>&#29366;&#27841;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12373;&#12425;&#12395;&#25968;&#34892;&#32232;&#38598;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;:</p>
  <ol>
  <li>
  <p><tt style="white-space: nowrap;">~/.tcshrc</tt> &#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
  <p>&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12540;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#12424;&#12387;&#12390;&#20316;&#12425;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12354;&#12394;&#12383;&#12364;&#33258;&#20998;&#12391;&#20316;&#12387;&#12383;&#12398;&#12363;&#12418;&#30693;&#12428;&#12414;&#12379;&#12435;&#12290;
  &#12356;&#12378;&#12428;&#12398;&#22580;&#21512;&#12418;&#12289; <tt style="white-space: nowrap;">~/.tcshrc</tt> &#12364;&#35501;&#12414;&#12428;&#12390;&#12289; <tt style="white-space: nowrap;">~/.cshrc</tt> &#12399;&#28961;&#35222;&#12373;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
  <tt style="white-space: nowrap;">~/.tcshrc</tt> &#12434; <tt style="white-space: nowrap;">~/.cshrc</tt> &#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#32232;&#38598;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;:
  </p>
  <pre>source ~/.cshrc</pre>
  <p>&#12371;&#12358;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289; <tt style="white-space: nowrap;">~/.tcshrc</tt> &#12434;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12394;&#12367; Fink &#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
  </li>
  <li>
  <p> <tt style="white-space: nowrap;">/usr/share/tcsh/examples/README</tt> &#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#23455;&#34892;&#12375;&#12383;&#12290;</p>
  <p>&#12371;&#12371;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12399;&#12289; <tt style="white-space: nowrap;">~/.tcshrc</tt> &#12392; <tt style="white-space: nowrap;"> ~/.login</tt> &#12434;&#20316;&#12427;&#12424;&#12358;&#12395;&#25351;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
  &#12371;&#12371;&#12391;&#21839;&#38988;&#12399;&#12289; <tt style="white-space: nowrap;">~/.login</tt> &#12364; <tt style="white-space: nowrap;">~/.tcshrc</tt> &#12398;&#24460;&#12391;&#23455;&#34892;&#12373;&#12428;&#12289; <tt style="white-space: nowrap;">/usr/share/tcsh/examples/login</tt> &#12434; source &#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
  &#24460;&#32773;&#12399;&#12289;&#12354;&#12394;&#12383;&#12398;&#35373;&#23450;&#12375;&#12383; PATH &#12434;&#19978;&#26360;&#12365;&#12377;&#12427;&#34892;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
  <tt style="white-space: nowrap;">~/Library/init/tcsh/path</tt> &#12434;&#20316;&#25104;&#12377;&#12427;&#12398;&#12364;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;:</p>
  <pre>mkdir ~/Library/init
mkdir ~/Library/init/tcsh
pico ~/library/init/tcsh/path</pre>
  <p>&#12392;&#12375;&#12390;&#12363;&#12425;:</p>
  <pre>source ~/.cshrc</pre>
  <p>&#12434;&#21152;&#12360;&#12390;&#19979;&#12373;&#12356;&#12290;
  &#12414;&#12383;&#12289; .tcshrc &#12418;&#38917;&#30446;&#65297;&#12398;&#12424;&#12358;&#12395;&#32232;&#38598;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
  <tt style="white-space: nowrap;">~/.login</tt> &#12364;&#35501;&#12414;&#12428;&#12394;&#12356;&#29366;&#27841;&#12391;&#12289;PATH &#12364;&#27491;&#12375;&#12367;&#35373;&#23450;&#12373;&#12428;&#12383;&#12363;&#30906;&#35469;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;</p>
  </li>
  </ol>
  <p>
  .cshrc (&#12392;&#12289;&#20182;&#12398;&#36215;&#21205;&#12501;&#12449;&#12452;&#12523;) &#12398;&#32232;&#38598;&#12399;&#12289;&#26032;&#35215;&#12471;&#12455;&#12523; (&#26032;&#12375;&#12367;&#12479;&#12540;&#12511;&#12490;&#12523;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#38283;&#12356;&#12383;&#26178;) &#12363;&#12425;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
   &#12371;&#12398;&#12383;&#12417;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#21069;&#12363;&#12425;&#38283;&#12356;&#12390;&#12356;&#12383;&#12479;&#12540;&#12511;&#12490;&#12523;&#12454;&#12451;&#12531;&#12489;&#12454;&#12399;&#12289;&#12381;&#12428;&#12382;&#12428;&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12414;&#12383;&#12289; <tt style="white-space: nowrap;">rehash</tt> &#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
  &#12371;&#12428;&#12391; tcsh &#12399;&#20351;&#29992;&#12391;&#12365;&#12427;&#12467;&#12510;&#12531;&#12489;&#12434;&#20869;&#37096;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;
  </p>
 </li>
</ul>
<p>
&#12473;&#12463;&#12522;&#12503;&#12488;&#12399; <tt style="white-space: nowrap;">/usr/X11R6/bin</tt> &#12392; <tt style="white-space: nowrap;">/usr/X11R6/man</tt> &#12434;&#12497;&#12473;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12371;&#12428;&#12391; X11 &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#26178;&#12395;&#20351;&#12360;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
Fink &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12381;&#12428;&#12382;&#12428;&#35373;&#23450;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#12289; qt &#12497;&#12483;&#12465;&#12540;&#12472;&#12399; QTDIR &#29872;&#22659;&#22793;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
&#29872;&#22659;&#12434;&#25972;&#12360;&#12383;&#12425;&#12289;&#27425;&#12398;<a href="#packages">&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a>&#12398;&#31456;&#12395;&#36914;&#12415;&#12289; Fink &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#31649;&#29702;&#12484;&#12540;&#12523;&#12434;&#20351;&#12387;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12434;&#12362;&#35501;&#12415;&#19979;&#12373;&#12356;&#12290;
</p>

<h2><a name="packages">3 &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h2>



<p>
&#12371;&#12398;&#26178;&#28857;&#12391;&#12289; Fink &#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
&#12371;&#12398;&#31456;&#12391;&#12399;&#23455;&#38555;&#12395;&#12289;&#22909;&#12365;&#12394;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#26041;&#27861;&#12434;&#35299;&#35500;&#12375;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#35500;&#26126;&#12377;&#12427;&#21069;&#12395;&#12289;&#12477;&#12540;&#12473;&#12392;&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#20001;&#26041;&#12395;&#24403;&#12390;&#12399;&#12414;&#12427;&#37325;&#35201;&#20107;&#38917;&#12434;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="packages.bin-dselect">3.1 dselect &#12395;&#12424;&#12427;&#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
<tt style="white-space: nowrap;">dselect</tt> &#12399;&#12289;&#20837;&#25163;&#21487;&#33021;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#19968;&#35239;&#12434;&#34920;&#31034;&#12375;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12418;&#12398;&#12434;&#36984;&#25246;&#12391;&#12365;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12479;&#12540;&#12511;&#12490;&#12523;.app &#20869;&#12391;&#21205;&#20316;&#12375;&#12414;&#12377;&#12364;&#12289; "&#12473;&#12463;&#12522;&#12540;&#12531;" &#20840;&#20307;&#12434;&#31777;&#21336;&#12394;&#12461;&#12540;&#12508;&#12540;&#12489;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12391;&#20351;&#12356;&#12414;&#12377;&#12290;
&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#31649;&#29702;&#12484;&#12540;&#12523;&#12392;&#21516;&#27096;&#12289; <tt style="white-space: nowrap;">dselect</tt> &#12399;&#12523;&#12540;&#12488;&#27177;&#38480;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12398;&#12391;&#12289;&#12354;&#12425;&#12363;&#12376;&#12417; root &#12395;&#12394;&#12427;&#12363;&#12289; sudo &#12434;&#20351;&#12356;:
</p>
<pre>sudo dselect</pre>
<p>
&#12392;&#12375;&#12414;&#12377;&#12290;
<b>&#27880;&#35352;&#65306;</b>
<tt style="white-space: nowrap;">dselect</tt> &#12399; OSX &#12479;&#12540;&#12511;&#12490;&#12523;&#19978;&#12391;&#12399;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12434;&#36991;&#12369;&#12427;&#12395;&#12399;&#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#20808;&#12395;&#23455;&#34892;&#12377;&#12427;&#12363;&#12289;&#36215;&#21205;&#12501;&#12449;&#12452;&#12523; (&#20363; <tt style="white-space: nowrap;">.cshrc</tt> | <tt style="white-space: nowrap;">.profile</tt>) &#12395;&#26360;&#12356;&#12390;&#12362;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>tcsh &#12398;&#22580;&#21512;:</p>
<pre>setenv TERM xterm-color</pre>
<p>bash &#12398;&#22580;&#21512;:</p>
<pre>export TERM=xterm-color</pre>
<p>&#12513;&#12452;&#12531;&#12513;&#12491;&#12517;&#12540;&#12399;:</p>
<ul>
<li>
<p>
<b>[A]ccess</b> - &#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12450;&#12463;&#12475;&#12473;&#25163;&#27573;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
<b>&#12371;&#12428;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;</b>&#12290;
Fink &#12364;&#12354;&#12425;&#12363;&#12376;&#12417;&#20840;&#12390;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#12434;&#20351;&#12360;&#12394;&#12356;&#35373;&#23450;&#12395;&#26360;&#12365;&#25563;&#12360;&#12427;&#12362;&#12381;&#12428;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;&#20351;&#29992;&#12399;&#36991;&#12369;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
<b>[U]pdate</b> - &#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434; Fink &#12469;&#12452;&#12488;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12289;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12420;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12502;&#12521;&#12454;&#12470;&#12364;&#20351;&#29992;&#12377;&#12427;&#19968;&#35239;&#12434;&#26356;&#26032;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
Fink &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#24460;&#12289;&#26368;&#20302;&#19968;&#22238;&#12399;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
<b>[S]elect</b> - &#36984;&#25246;&#12289;&#38750;&#36984;&#25246;&#21487;&#33021;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
&#35443;&#32048;&#12399;&#24460;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
<b>[I]nstall</b> - &#12371;&#12428;&#12364;&#23455;&#38555;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#19978;&#12398;&#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12399; dselect &#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12392;&#12473;&#12486;&#12540;&#12479;&#12473;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#26360;&#12365;&#25563;&#12360;&#12427;&#12384;&#12369;&#12391;&#12375;&#12383;&#12364;&#12289;&#12371;&#12428;&#12399;&#23455;&#38555;&#12395;&#36984;&#25246;&#12373;&#12428;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#12375;&#12414;&#12377;&#12290;
&#12381;&#12428;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;&#38750;&#36984;&#25246;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#21462;&#12426;&#38500;&#12367;&#12371;&#12392;&#12418;&#12375;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
<b>[C]onfig</b> &#12392; <b>[R]emove</b> - &#12371;&#12428;&#12425;&#12399; apt &#20197;&#21069;&#12363;&#12425;&#12398;&#36986;&#29289;&#12391;&#12377;&#12290;
&#20351;&#12358;&#24517;&#35201;&#12399;&#12394;&#12367;&#12289;&#23475;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>
</li>
<li>
<p>
<b>[Q]uit</b> - &#35500;&#26126;&#12398;&#24517;&#35201;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
</p>
</li>
</ul>
<p>
&#23455;&#38555;&#12399;&#12289;"[S]elect" &#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12434;&#36984;&#25246;&#24460;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12502;&#12521;&#12454;&#12470;&#20869;&#12395;&#12356;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434;&#34920;&#31034;&#12377;&#12427;&#21069;&#12395; dselect &#12399;&#12504;&#12523;&#12503;&#30011;&#38754;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
'k' &#12461;&#12540;&#12434;&#25276;&#12377;&#12392;&#12461;&#12540;&#12508;&#12540;&#12489;&#12467;&#12510;&#12531;&#12489;&#12398;&#19968;&#35239;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#12473;&#12506;&#12540;&#12473;&#12461;&#12540;&#12391;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;
</p>
<p>
&#19968;&#35239;&#12398;&#20013;&#12391;&#12399;&#12289;&#19978;&#12392;&#19979;&#12398;&#12461;&#12540;&#12391;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;
&#36984;&#25246;&#12399;&#12289; '+' &#12392; '-' &#12391;&#12375;&#12414;&#12377;&#12290;
&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#20381;&#23384;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289; dselect &#12399;&#24433;&#38911;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12469;&#12502;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#12522;&#12479;&#12540;&#12531;&#12461;&#12540;&#12434;&#25276;&#12377;&#12384;&#12369;&#12391; dselect &#12395;&#24467;&#12360;&#12400;&#22823;&#19976;&#22827;&#12391;&#12377;&#12364;&#12289;&#12469;&#12502;&#12522;&#12473;&#12488;&#20869;&#12391;&#22793;&#26356;&#12418;&#12391;&#12365;&#12414;&#12377; (&#20363;&#12289;&#12496;&#12540;&#12481;&#12515;&#12523;&#12497;&#12483;&#12465;&#12540;&#12472;&#20381;&#23384;&#12398;&#12383;&#12417;&#20182;&#12434;&#36984;&#25246;&#12377;&#12427;)&#12290;
&#12354;&#12427;&#12356;&#12399;&#12289; 'R' (Shift-R) &#12434;&#25276;&#12375;&#12390;&#20803;&#12398;&#29366;&#24907;&#12395;&#25147;&#12379;&#12400;&#12289;&#12469;&#12502;&#12522;&#12473;&#12488;&#12392;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12399;&#12381;&#12398;&#12414;&#12414;&#12391;&#12377;&#12290;
&#36984;&#25246;&#12364;&#32066;&#20102;&#12375;&#12383;&#12394;&#12425;&#12289;&#19968;&#35239;&#12363;&#12425;&#20986;&#12390; "[I]nstall" &#12434;&#36984;&#25246;&#12375;&#12289;&#23455;&#38555;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="packages.bin-apt">3.2 apt-get &#12434;&#20351;&#12387;&#12383;&#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
<tt style="white-space: nowrap;">dselect</tt> &#12399;&#23455;&#38555;&#12395;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12379;&#12378;&#12289; apt &#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12391;&#12398;&#20316;&#26989;&#12364;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289; <tt style="white-space: nowrap;">apt-get</tt> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12387;&#12390; apt &#12398;&#27231;&#33021;&#12434;&#30452;&#25509;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
dselect &#12398;&#12392;&#21516;&#12376;&#12367;&#12289;&#12414;&#12378;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;:
</p>
<pre>sudo apt-get update</pre>
<p>
dselect &#12398; "[U]pdate" &#12513;&#12491;&#12517;&#12540;&#38917;&#30446;&#12392;&#21516;&#12376;&#12367;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12391;&#12399;&#12394;&#12367;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434;&#26356;&#26032;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289; apt-get &#12395;&#21517;&#21069;&#12434;&#28193;&#12375;&#12414;&#12377;:
</p>
<pre>sudo apt-get install lynx</pre>
<p>
&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#24517;&#35201;&#12392;&#12375;&#12390;&#12356;&#12427;&#12392;&#21028;&#26029;&#12375;&#12383;&#22580;&#21512;&#12289;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12375;&#12390;&#30906;&#35469;&#12434;&#12392;&#12426;&#12414;&#12377;&#12290;
&#12381;&#12398;&#24460;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#21462;&#12426;&#38500;&#12367;&#12398;&#12418;&#31777;&#21336;&#12391;&#12377;:
</p>
<pre>sudo apt-get remove lynx</pre>
<p>
</p>

<h3><a name="packages.bin-exceptions">3.3 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#12394;&#12356;&#20381;&#23384;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>&#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#12375;&#12390;&#12356;&#12427;&#26178;&#12289;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12394;&#12356;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12391;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;:</p>
<pre>Sorry, but the following packages have unmet
dependencies:
foo: Depends: bar (&gt;= version) but it is
not installable
E: Sorry, broken packages</pre>
<p>&#20309;&#12364;&#36215;&#12371;&#12387;&#12383;&#12363;&#12392;&#12356;&#12358;&#12392;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12289;&#12521;&#12452;&#12475;&#12531;&#12473;&#19978;&#12496;&#12452;&#12490;&#12522;&#12392;&#12375;&#12390;&#37197;&#24067;&#12373;&#12428;&#12394;&#12356;&#20182;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12377;&#12290;
&#12371;&#12398;&#22580;&#21512;&#12289;&#12477;&#12540;&#12473;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#19979;&#12373;&#12356; (&#27425;&#12398;&#31680;&#12434;&#21442;&#29031;)&#12290;
</p>

<h3><a name="packages.src">3.4 &#12477;&#12540;&#12473;&#12363;&#12425;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>&#12414;&#12378;&#12289;&#36969;&#20999;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Development Tools &#12364;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
<a href="http://connect.apple.com">http://connect.apple.com</a>
&#12363;&#12425;&#20837;&#25163;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#12477;&#12540;&#12473;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#19968;&#35239;&#12434;&#21462;&#24471;&#12377;&#12427;&#12395;&#12399;&#12289; <tt style="white-space: nowrap;">fink</tt> &#12484;&#12540;&#12523;&#12395;&#32862;&#12365;&#12414;&#12377;:
</p>
<pre>fink list</pre>
<p>
&#26368;&#21021;&#12398;&#21015;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#29366;&#24907; (&#31354;&#30333;&#12399;&#26410;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;, <tt style="white-space: nowrap;">i</tt> &#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;, <tt style="white-space: nowrap;">(i)</tt> &#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12384;&#12364;&#26368;&#26032;&#12391;&#12399;&#12394;&#12356;) &#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
&#27425;&#12364;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12289;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12289;&#30701;&#12356;&#35500;&#26126;&#12391;&#12377;&#12290;
&#29305;&#23450;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35443;&#32048;&#12434;&#35211;&#12427;&#12395;&#12399;&#12289;"describe" &#12467;&#12510;&#12531;&#12489; ("info" &#12399;&#12456;&#12452;&#12522;&#12450;&#12473;&#12391;&#12377;) &#12434;&#20351;&#12356;&#12414;&#12377;:
</p>
<pre>fink describe xmms</pre>
<p>
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#35211;&#12388;&#12363;&#12387;&#12383;&#12425;&#12289; "install" &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;:
</p>
<pre>fink install wget-ssl</pre>
<p>
<tt style="white-space: nowrap;">fink</tt> &#12467;&#12510;&#12531;&#12489;&#12399;&#26368;&#21021;&#12395;&#24517;&#35201;&#12394;&#12418;&#12398; ("&#20381;&#23384;&#24615;") &#12364;&#12354;&#12427;&#12363;&#30906;&#35469;&#12375;&#12289;&#28961;&#12356;&#12418;&#12398;&#12364;&#12354;&#12428;&#12400;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12356;&#12356;&#12363;&#32862;&#12356;&#12390;&#12365;&#12414;&#12377;&#12290;
&#27425;&#12395;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12289;&#35299;&#20941;&#12289;&#12497;&#12483;&#12481;&#24403;&#12390;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20316;&#26989;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20316;&#26989;&#20013;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12289;&#12414;&#12378; <a href="http://fink.sourceforge.net/faq/">FAQ</a> &#12434;&#30906;&#35469;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="packages.fink-commander">3.5 Fink Commander</a></h3> 
 
<p>
Fink Commander &#12399; <tt style="white-space: nowrap;">apt-get</tt> &#12392; <tt style="white-space: nowrap;">fink</tt> &#12398; Aqua &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#12377;&#12290;
Binary &#12513;&#12491;&#12517;&#12540;&#12399;&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12289; Source &#12513;&#12491;&#12517;&#12540;&#12399;&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#25805;&#20316;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
</p> 
<p>
Fink Commander &#12399; Fink &#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12395;&#20184;&#23646;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
Fink &#12434;&#12477;&#12540;&#12473;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#22580;&#21512;&#12394;&#12393;&#12289;&#21029;&#12395;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#12356;&#22580;&#21512;&#12420;&#35443;&#12375;&#12356;&#24773;&#22577;&#12399;&#12289;
<a href="http://finkcommander.sourceforge.net%20">Fink Commander website</a> &#12522;&#12531;&#12463;&#12434;&#36799;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;
</p> 
 
<h3><a name="packages.">3.6 &#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;</a></h3>

<p>&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#22580;&#21512;&#12289;&#12414;&#12378;<a href="http://fink.sourceforge.net/pdb/index.php">Package Database</a>&#12434;&#30906;&#35469;&#12375;&#12390; Fink &#12395;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#30906;&#35469;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#27425;&#12398;&#34892;&#12395;&#26360;&#12363;&#12428;&#12390;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>
<b>0.4.1-stable:</b> OS 10.1 &#12391;&#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;</p>
</li>
<li>
<p>
<b>0.6.2:</b> &#12371;&#12428;&#12399; OS 10.3 &#12392; 10.2 &#21521;&#12369;&#12398;&#12496;&#12452;&#12490;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#22522;&#26412;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;
Fink &#12434; <a href="http://fink.sourceforge.net/doc/users-guide/upgrade.php">&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a>  &#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12428;&#12424;&#12426;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#22580;&#21512;&#12418;&#12354;&#12427;&#12290;
</p>
</li>
<li>
<p>
<b>10.2-gcc3.3 stable:</b> &#12371;&#12428;&#12399;&#12477;&#12540;&#12473;&#12363;&#12425; <tt style="white-space: nowrap;">gcc 3.3</tt> &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427; OS 10.2 &#21521;&#12369;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289; <a href="http://fink.sourceforge.net/doc/cvsaccess/index.php">CVS </a> &#12414;&#12383;&#12399; rsync &#12450;&#12463;&#12475;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12290;
&#12418;&#12375; <tt style="white-space: nowrap;">gcc 3.3</tt> &#12395;&#26356;&#26032;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531; (&#12354;&#12427;&#12356;&#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#33258;&#20307;) &#12364;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12290;
</p>
<p>
&#27880;&#24847;: &#20182;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#22580;&#21512;&#12392;&#12399;&#30064;&#12394;&#12426;&#12289; Fink &#12399;&#26368;&#26032;&#12398;&#23433;&#23450;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#12486;&#12473;&#12488;&#12364;&#24517;&#35201;&#12394;&#12496;&#12540;&#12472;&#12519;&#12531; (&#19979;&#35352;&#21442;&#29031;) &#12434;&#20001;&#26041;&#12392;&#12418;&#12395; CVS &#12391;&#37197;&#24067;&#12375;&#12390;&#12356;&#12427;&#12290;
CVS | rsync &#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#12424;&#12426;&#21069;&#12395;&#26368;&#26032;&#23433;&#23450;&#29256;&#12434;&#25163;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12290;
</p>
</li>
<li>
<p>
<b>10.3 stable:</b> &#12371;&#12428;&#12399;&#12477;&#12540;&#12473;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427; OS 10.3 &#21521;&#12369;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;
CVS &#12414;&#12383;&#12399; rsync &#12450;&#12463;&#12475;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12290;
</p>
</li> 
<li>
<p>
<b>In latest-unstable:</b> &#26368;&#26032;&#12398;&#38750;&#23433;&#23450;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#38750;&#23433;&#23450;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12398;<a href="http://fink.sourceforge.net/faq/usage-fink.php#unstable">&#35500;&#26126;</a> &#12395;&#24467;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>&#27880;&#24847;: &#38750;&#23433;&#23450;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12392;&#35328;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#33258;&#24049;&#36012;&#20219;&#12391;&#20351;&#29992;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p></li>
</ul>

<h3><a name="packages.x11">3.7 X11 &#12434;&#20351;&#12358;</a></h3>

<p>
Mac OS X &#12395;&#12399;&#12289; X11 &#12364;&#25968;&#31278;&#39006; (XFree86, Tenon Xtools, eXodus) &#12354;&#12426;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12418;&#25968;&#31278;&#39006; (&#25163;&#21205;&#12289; Fink &#12434;&#20351;&#12358;) &#12354;&#12427;&#12383;&#12417;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#25968;&#31278;&#39006;&#12354;&#12426;&#12414;&#12377;&#12290;
Fink &#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#12398;&#12364;&#12393;&#12428;&#12363;&#12434;&#12358;&#12414;&#12367;&#21028;&#21029;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12289; X11 &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#21069;&#12395;&#27491;&#12375;&#12356;&#12418;&#12398;&#12434;&#36984;&#12406;&#12371;&#12392;&#12364;&#37325;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#20197;&#19979;&#12364;&#12497;&#12483;&#12465;&#12540;&#12472;&#12392; X11 &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26041;&#27861;&#12398;&#19968;&#35239;&#12391;&#12377;:
</p>
<ul>
<li>
<p>
xfree86-base:
&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12522;&#12450;&#12523;&#12391;&#12377;&#12290;
XFree86 4.2.1.1 &#12398;&#20840;&#12390;&#12434; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12392;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#26580;&#36575;&#24615;&#12395;&#23550;&#24540;&#12391;&#12365;&#12427;&#12424;&#12358;&#12289;&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395; XDarwin &#12469;&#12540;&#12496;&#12540;&#12399;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289; xfree86-rootless &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#19979;&#12373;&#12356;
</p>
</li>
<li>
<p>
xfree86:
&#12371;&#12428;&#12399;&#19968;&#12388;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472; (display &#12469;&#12540;&#12496;&#12540;&#12434;&#21547;&#12416;) &#12391;&#12377;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399; 4.2.1.1 &#12424;&#12426;&#36895;&#12356;&#12391;&#12377;&#12364;&#12289;&#21313;&#20998;&#12395;&#12399;&#12486;&#12473;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
</p>
</li>
<li>
<p>
system-xfree86:
&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;&#12477;&#12540;&#12473;&#12414;&#12383;&#12399;&#20844;&#24335; (&#38750;&#20844;&#24335;) &#12496;&#12452;&#12490;&#12522;&#12363;&#12425;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399; Apple X11 &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#22580;&#21512;&#12394;&#12393;&#12289;&#25163;&#21205;&#12391; XFree86 &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#26178;&#12395;&#20351;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#26377;&#21177;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12384;&#12369;&#12391;&#12289;&#24460;&#12399;&#20381;&#23384;&#24615;&#12398;&#12383;&#12417;&#12395;&#23384;&#22312;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
</p>
</li>
<li>
<p>
system-xtools:
Tenon Xtools &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
system-xfree86 &#12392;&#21516;&#27096;&#12289;&#26377;&#21177;&#24615;&#12434;&#30906;&#35469;&#12377;&#12427;&#12384;&#12369;&#12391;&#12501;&#12449;&#12452;&#12523;&#12399;&#12381;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;
</p>
</li>
</ul>
<p>
X11 &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12392;&#20351;&#29992;&#12398;&#35443;&#32048;&#12399;&#12289;
<a href="http://fink.sourceforge.net/doc/x11/">X11 on Darwin and Mac OS X &#12489;&#12461;&#12517;&#12513;&#12531;&#12488;</a>
&#12434;&#21442;&#29031;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>

<h2><a name="upgrade">4 Fink &#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></h2>



<p>
&#12371;&#12398;&#31456;&#12399;&#12289; Fink &#12434;&#26368;&#26032;&#12363;&#12388;&#26368;&#39640;&#12395;&#26356;&#26032;&#12377;&#12427;&#26041;&#27861;&#12434;&#35299;&#35500;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="upgrade.bin">4.1 &#12496;&#12452;&#12490;&#12522;&#12497;&#12483;&#12465;&#12540;&#12472;&#12391;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></h3>

<p>
&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12384;&#12369;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#29305;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#26368;&#26032;&#12398;&#19968;&#35239;&#12395;&#26356;&#26032;&#12375;&#12289;&#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26356;&#26032;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
</p>
<p>
dselect &#12398;&#22580;&#21512;&#12289;"[U]pdate" &#12434;&#25276;&#12375;&#12390; "[I]nstall" &#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
&#12418;&#12385;&#12429;&#12435;&#12289;&#12371;&#12398;&#38291;&#12395; "[S]elect" &#12434;&#23455;&#34892;&#12375;&#12390;&#36984;&#25246;&#12373;&#12428;&#12383;&#12418;&#12398;&#12392;&#26032;&#12375;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#30906;&#35469;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
apt &#12391;&#12399;&#12289; <tt style="white-space: nowrap;">apt-get update</tt> &#12434;&#23455;&#34892;&#12375;&#12390;&#26368;&#26032;&#12398;&#19968;&#35239;&#12434;&#21462;&#24471;&#12375;&#12289; <tt style="white-space: nowrap;">apt-get upgrade</tt> &#12434;&#23455;&#34892;&#12375;&#12390;&#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26368;&#26032;&#12395;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
Fink Commander &#12391;&#12399;&#12289;
Binary-&gt;Update descriptions 
&#12434;&#36984;&#25246;&#12375;&#12390;&#12497;&#12483;&#12465;&#12540;&#12472;&#12522;&#12473;&#12488;&#12434;&#26356;&#26032;&#12375;&#12289;
Binary-&gt;Dist-Upgrade 
&#12391;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
&#35443;&#32048;&#12289;&#29305;&#12395; 0.3.0 &#12424;&#12426;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Fink &#12363;&#12425;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
<a href="http://fink.sourceforge.net/download/upgrade.php">&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#34920;</a>
&#12434;&#24481;&#35239;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="upgrade.src">4.2 &#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a></h3>

<p>
&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12399;&#22810;&#23569;&#35079;&#38609;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12399;&#65298;&#12473;&#12486;&#12483;&#12503;&#12354;&#12426;&#12414;&#12377;&#12290;
1. &#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
2. &#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#20351;&#12387;&#12390;&#26032;&#12375;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12414;&#12377;&#12290;
&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12418;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
Fink 0.2.5 &#20197;&#38477;&#12391;&#12354;&#12428;&#12400;&#12289;&#26368;&#21021;&#12398;&#12473;&#12486;&#12483;&#12503;&#12399; <tt style="white-space: nowrap;">fink selfupdate</tt> &#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399; Fink &#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12434;&#26032;&#12375;&#12356;&#12522;&#12522;&#12540;&#12473;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#30906;&#35469;&#12375;&#12289;&#33258;&#21205;&#30340;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#26368;&#36817;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; <tt style="white-space: nowrap;">fink</tt> &#12467;&#12510;&#12531;&#12489;&#12391;&#12399;&#12289; CVS &#12414;&#12383;&#12399; rsync &#12363;&#12425;&#30452;&#25509;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#21462;&#24471;&#12377;&#12427;&#36984;&#25246;&#32930;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
CVS &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#31649;&#29702;&#12524;&#12509;&#12472;&#12488;&#12522;&#12391;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12364;&#20445;&#23384;&#12539;&#31649;&#29702;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
CVS &#12395;&#12399;&#36899;&#32154;&#12375;&#12390;&#26356;&#26032;&#12391;&#12365;&#12427;&#21033;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;CVS &#12469;&#12540;&#12496;&#12540;&#12364;&#19968;&#12388;&#12375;&#12363;&#12394;&#12367;&#12289;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#37327;&#12395;&#20381;&#12387;&#12390;&#19981;&#23433;&#23450;&#12395;&#12394;&#12426;&#12420;&#12377;&#12356;&#27424;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12289;&#19968;&#33324;&#12518;&#12540;&#12470;&#12540;&#12399; rsync &#12434;&#20351;&#12358;&#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
rsync &#12395;&#12399;&#12511;&#12521;&#12540;&#12364;&#35079;&#25968;&#12354;&#12426;&#12289;&#27424;&#28857;&#12399; CVS &#12363;&#12425;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12398;&#26356;&#26032;&#12395;&#65297;&#26178;&#38291;&#12363;&#12363;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
</p>
<p>(&#12477;&#12540;&#12473;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#21839;&#38988;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;<a href="http://fink.sourceforge.net/download/fix-upgrade.php">&#29305;&#27530;&#12394;&#26041;&#27861;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#19979;&#12373;&#12356;)</p>
<p>
0.2.5 &#12424;&#12426;&#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Fink &#12398;&#22580;&#21512;&#12289;&#25163;&#21205;&#12391;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
<a href="http://sourceforge.net/project/showfiles.php?group_id=17203">&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12456;&#12522;&#12450;</a>&#12391;&#26368;&#26032;&#12398; packages-0.x.x.tar.gz tarball &#12434; "distribution" &#12514;&#12472;&#12517;&#12540;&#12523;&#20869;&#12391;&#25506;&#12375;&#12414;&#12377;&#12290;
&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#24460;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;:
</p>
<pre>tar -xzf packages-0.x.x.tar.gz
cd packages-0.x.x
./inject.pl</pre>
<p>
&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#24460; (&#12393;&#12398;&#12424;&#12358;&#12394;&#26041;&#27861;&#12391;&#12354;&#12428;)&#12289;&#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434; <tt style="white-space: nowrap;">fink
update-all</tt> &#12391;&#19968;&#25324;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
Fink Commander &#12434;&#20351;&#12387;&#12390;&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12434;&#26356;&#26032;&#12377;&#12427;&#22580;&#21512;&#12289;
Source-&gt;Selfupdate 
&#12434;&#36984;&#25246;&#12375;&#12390;&#26032;&#12375;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#24773;&#22577;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12289;
Source-&gt;Updata-all
&#12434;&#36984;&#25246;&#12375;&#12390;&#21476;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
</p> 

<h3><a name="upgrade.mix">4.3 &#12496;&#12452;&#12490;&#12522;&#12392;&#12477;&#12540;&#12473;&#12398;&#28151;&#22312;</a></h3>

<p>
&#12418;&#12375;&#12289;&#12467;&#12531;&#12497;&#12452;&#12523;&#28168;&#12415;&#12497;&#12483;&#12465;&#12540;&#12472;&#12392;&#12477;&#12540;&#12473;&#12363;&#12425;&#12499;&#12523;&#12489;&#12375;&#12383;&#12418;&#12398;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#20001;&#26041;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#26041;&#27861;&#12395;&#24467;&#12431;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12388;&#12414;&#12426;&#12289;&#26368;&#21021;&#12395; <tt style="white-space: nowrap;">dselect</tt> &#12363; <tt style="white-space: nowrap;">apt-get</tt> &#12434;&#20351;&#12387;&#12390;&#12496;&#12452;&#12490;&#12522;&#12391;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#21462;&#24471;&#12375;&#12289;&#27425;&#12395; <tt style="white-space: nowrap;">fink selfupdate</tt> &#12392; <tt style="white-space: nowrap;">fink update-all</tt> &#12391;&#29694;&#22312;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#21462;&#24471;&#12375;&#12289;&#27531;&#12426;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
Fink Commander &#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12414;&#12378; <a href="#upgrade.bin">&#12496;&#12452;&#12490;&#12522;&#12398;&#26356;&#26032;</a> &#12434;&#23455;&#34892;&#12375;&#12390;&#12363;&#12425; <a href="#upgrade.src">&#12477;&#12540;&#12473;&#12398;&#26356;&#26032;</a> &#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290; 
</p>

<h2><a name="conf">5 Fink &#35373;&#23450;&#12501;&#12449;&#12452;&#12523;</a></h2>



<p>
&#12371;&#12398;&#31456;&#12391;&#12399;&#12289; Fink &#35373;&#23450;&#12501;&#12449;&#12452;&#12523; (fink.conf) &#12391;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12427;&#35373;&#23450;&#12392;&#12289; Fink &#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#24433;&#38911;&#12377;&#12427;&#12363;&#12289;&#29305;&#12395; <tt style="white-space: nowrap;">fink</tt> &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12484;&#12540;&#12523; (&#12392;&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;) &#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="conf.about">5.1 fink.conf &#12395;&#12388;&#12356;&#12390;</a></h3>

<p>
&#26368;&#21021;&#12395; Fink &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#26178;&#12289;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12398;&#35373;&#23450;&#12391;&#12356;&#12367;&#12388;&#12363;&#36074;&#21839;&#12434;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#12289;&#12393;&#12398; <a href="#conf.mirrors">&#12511;&#12521;&#12540;</a> &#12434;&#20351;&#12387;&#12390;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12434;&#12377;&#12427;&#12363;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395; super-user &#27177;&#38480;&#12434;&#20351;&#12358;&#12363;&#12394;&#12393;&#12391;&#12377;&#12290;
&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12399; <tt style="white-space: nowrap;">fink configure</tt> &#12467;&#12510;&#12531;&#12489;&#12391;&#12356;&#12388;&#12391;&#12418;&#20877;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399; <b>fink.conf</b> &#12501;&#12449;&#12452;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
&#19968;&#33324;&#30340;&#12395;&#12289;&#12371;&#12358;&#12356;&#12387;&#12383;&#35373;&#23450;&#12399;&#19978;&#32026;&#32773;&#23554;&#29992;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;
</p>
<p>
<b>fink.conf</b> &#12501;&#12449;&#12452;&#12523;&#12399; <tt style="white-space: nowrap;">/sw/etc/fink.conf</tt> &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
&#33258;&#20998;&#12398;&#22909;&#12365;&#12394;&#12486;&#12461;&#12473;&#12488;&#12456;&#12487;&#12451;&#12479;&#12391;&#32232;&#38598;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12540;&#27177;&#38480;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p>

<h3><a name="conf.syntax">5.2 fink.conf &#25991;&#27861;</a></h3>

<p>
fink.conf &#12395;&#12399;&#12383;&#12367;&#12373;&#12435;&#12398;&#34892;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#24418;&#24335;&#12399;:</p>
<pre>OptionName: Value</pre>
<p>&#12392;&#12289;&#34892;&#12372;&#12392;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12458;&#12503;&#12471;&#12519;&#12531;&#21517;&#12392;&#20516;&#12399; : &#12392;&#31354;&#30333;&#12402;&#12392;&#12388;&#12391;&#21306;&#20999;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#20516;&#12398;&#20013;&#36523;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12414;&#12377;&#12364;&#12289;&#36890;&#24120;&#12399;&#12502;&#12540;&#12523;&#20516; ("True" &#12414;&#12383;&#12399; "False")&#12289;&#25991;&#23383;&#21015;&#12289;&#31354;&#30333;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25991;&#23383;&#21015;&#12394;&#12393;&#12391;&#12377;&#12290;
&#20363;&#12360;&#12400;:
</p>
<pre>
BooleanOption: True
StringOption: Something
ListOption: Option1 Option2 Option3
</pre>

<h3><a name="conf.required">5.3 &#24517;&#38920;&#35373;&#23450;</a></h3>

<p>
<b>fink.conf</b> &#12398;&#35373;&#23450;&#12395;&#12399;&#12289;&#24517;&#38920;&#38917;&#30446;&#12391;&#12289;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392; Fink &#12364;&#21205;&#20316;&#12375;&#12394;&#12356;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#20197;&#19979;&#12398;&#35373;&#23450;&#12399;&#12371;&#12398;&#12459;&#12486;&#12468;&#12522;&#12540;&#12395;&#20837;&#12426;&#12414;&#12377;&#12290;
</p>
<ul>
<li>
<p>
<b>Basepath:</b> path</p>
<p>
Fink &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12434;&#30693;&#12425;&#12379;&#12414;&#12377;&#12290;
Fink &#12398;&#26368;&#21021;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#22793;&#26356;&#12375;&#12390;&#12356;&#12394;&#12356;&#38480;&#12426;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399; <b>/sw</b> &#12391;&#12377;&#12290;
&#12371;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12390;&#12399;<b>&#12356;&#12369;&#12414;&#12379;&#12435;</b>&#12290;
Fink &#12364;&#28151;&#20081;&#12375;&#12414;&#12377;&#12290;
</p>
</li>
</ul>

<h3><a name="conf.optional">5.4 &#12518;&#12540;&#12470;&#12540;&#35373;&#23450;</a></h3>

<p>
&#12518;&#12540;&#12470;&#12540;&#12364; Fink &#12398;&#21205;&#20316;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12383;&#12417;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#35373;&#23450;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<ul>
<li>
<p>
Fink &#12399;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12540;&#27177;&#38480;&#12364;&#24517;&#35201;&#12394;&#26178;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#26377;&#21177;&#12394;&#20516;&#12399; <b>sudo</b> &#12363; <b>su</b> &#12391;&#12377;&#12290;
<b>none</b> &#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#22580;&#21512; Fink &#12434; root &#12391;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <b>sudo</b> &#12391;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12381;&#12398;&#12414;&#12414;&#20351;&#29992;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
<b>Trees:</b> list of trees</p>
<p>&#20351;&#29992;&#12391;&#12365;&#12427;&#12484;&#12522;&#12540;&#12399;:</p>
<pre>
local/main      - &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12356;&#12525;&#12540;&#12459;&#12523;&#12497;&#12483;&#12465;&#12540;&#12472;
local/bootstrap - Fink &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#24517;&#35201;&#12394;&#12497;&#12483;&#12465;&#12540;&#12472;
stable/crypto   - &#23433;&#23450;&#29256;&#12398;&#26263;&#21495;&#12497;&#12483;&#12465;&#12540;&#12472;
stable/main     - &#20182;&#12398;&#23433;&#23450;&#29256;&#12497;&#12483;&#12465;&#12540;&#12472;
unstable/crypto - &#38750;&#23433;&#23450;&#29256;&#12398;&#26263;&#21495;&#12497;&#12483;&#12465;&#12540;&#12472;
unstable/main   - &#20182;&#12398;&#38750;&#23433;&#23450;&#29256;&#12497;&#12483;&#12465;&#12540;&#12472;
</pre>
<p>
&#29420;&#33258;&#12398;&#12484;&#12522;&#12540;&#12434; <tt style="white-space: nowrap;">/sw/fink/dists</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#36890;&#24120;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12484;&#12522;&#12540;&#12399; "local/main local/bootstrap
stable/main" &#12391;&#12377;&#12290;
&#12371;&#12398;&#19968;&#35239;&#12399; <tt style="white-space: nowrap;">/sw/etc/apt/sources.list</tt> &#12501;&#12449;&#12452;&#12523;&#12392;&#21516;&#26399;&#12434;&#20445;&#12388;&#12424;&#12358;&#12395;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
<b>Distribution:</b> 10.1 &#12414;&#12383;&#12399; 10.2</p>
<p>Fink &#12399;&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398; Mac OS X &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12363;&#30693;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
10.1 &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399; Mac OS X 10.1 &#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
10.2 &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12399; Mac OS X 10.2 "Jaguar" &#12434;&#25351;&#12375;&#12414;&#12377;&#12290;
Mac OS X 10.0 &#20197;&#21069;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#20516;&#12399;&#22793;&#12360;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>
</li>
<li>
<p>
<b>FetchAltDir:</b> path</p>
<p>Fink &#12399;&#36890;&#24120;&#12289;&#12477;&#12540;&#12473;&#12434; <tt style="white-space: nowrap;">/sw/src</tt> &#12395;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20516;&#12434;&#22793;&#12360;&#12427;&#12371;&#12392;&#12391;&#12289;&#20182;&#12398;&#22580;&#25152;&#12395;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#25506;&#12373;&#12379;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;:
</p>
<pre>FetchAltDir: /usr/src</pre>
</li>
<li>
<p>
<b>Verbose:</b> a number from 0 to 3</p>
<p>
&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#29694;&#22312;&#20309;&#12434;&#12375;&#12390;&#12356;&#12427;&#12363;&#12434;&#12393;&#12398;&#31243;&#24230;&#22577;&#21578;&#12377;&#12427;&#12363;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;:
<b>0</b>
Quiet (&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#29366;&#27841;&#12434;&#22577;&#21578;&#12375;&#12394;&#12356;)
<b>1</b>
Low (tarball &#12398;&#23637;&#38283;&#12434;&#22577;&#21578;&#12375;&#12394;&#12356;)
<b>2</b>
Medium (&#12411;&#12392;&#12435;&#12393;&#20840;&#12390;&#22577;&#21578;&#12377;&#12427;)
<b>3</b>
High (&#20840;&#12390;&#22577;&#21578;&#12377;&#12427;)
&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; 3 &#12391;&#12377;&#12290;
</p>
</li>
<li>
<p>
<b>NoAutoIndex:</b> &#12502;&#12540;&#12523;&#20516;</p>
<p>Fink &#12399;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12501;&#12449;&#12452;&#12523;&#12434; /sw/var/db/fink.db &#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12289;&#23455;&#34892;&#12377;&#12427;&#12383;&#12403;&#12395;&#35501;&#12415;&#36796;&#12435;&#12391;&#12497;&#12540;&#12473;&#12377;&#12427;&#26178;&#38291;&#12434;&#12475;&#12540;&#12502;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20516;&#12364; "True" &#12391;&#12394;&#12356;&#38480;&#12426;&#12289; Fink &#12399;&#12497;&#12483;&#12465;&#12540;&#12472;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#26356;&#26032;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; "False" &#12391;&#12289;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#21223;&#12417;&#12414;&#12379;&#12435;&#12290;
&#22793;&#26356;&#12375;&#12383;&#22580;&#21512;&#12289; <tt style="white-space: nowrap;">fink index</tt> &#12467;&#12510;&#12531;&#12489;&#12434;&#25163;&#21205;&#12391;&#23455;&#34892;&#12375;&#12390;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#26356;&#26032;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
<b>SelfUpdateNoCVS:</b> &#12502;&#12540;&#12523;&#20516;</p>
<p><tt style="white-space: nowrap;">fink selfupdate</tt> &#12467;&#12510;&#12531;&#12489;&#12399;&#12289; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12510;&#12493;&#12540;&#12472;&#12515;&#12540;&#12434;&#26368;&#26032;&#29256;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399; True &#12398;&#26178;&#12289; Concurrent Version System (CVS) &#12434;&#20351;&#12431;&#12394;&#12356;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399; <tt style="white-space: nowrap;">fink selfupdate-cvs</tt> &#12467;&#12510;&#12531;&#12489;&#12364;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12377;&#12427;&#12398;&#12391;&#12289;&#25163;&#21205;&#12391;&#12399;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
</ul>

<h3><a name="conf.downloding">5.5 &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#35373;&#23450;</a></h3>

<p>Fink &#12364;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#25163;&#27573;&#12434;&#22793;&#12360;&#12427;&#35373;&#23450;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>
<b>ProxyPassiveFTP:</b> &#12502;&#12540;&#12523;&#20516;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289; Fink &#12399; FTP &#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#26178;&#12395; "passive" &#12514;&#12540;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
FTP &#12469;&#12540;&#12496;&#12540;&#12420;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364; True &#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12450;&#12463;&#12486;&#12451;&#12502; FTP &#33258;&#20307;&#12364;&#24259;&#27490;&#20104;&#23450;&#12394;&#12398;&#12391;&#12289;&#24120;&#12395;&#35373;&#23450;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12434;&#21223;&#12417;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
<b>ProxyFTP:</b> url</p>
<p>FTP &#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12358;&#22580;&#21512;&#12289;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;:
</p>
<pre>ProxyFTP: ftp://yourhost.com:2121/</pre>
<p>FTP &#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12431;&#12394;&#12356;&#22580;&#21512;&#12399;&#31354;&#27396;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#19979;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>
<b>ProxyHTTP:</b> url</p>
<p>HTTP &#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12358;&#22580;&#21512;&#12289;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;:</p>
<pre>ProxyHTTP: http://yourhost.com:3128/</pre>
<p>HTTP &#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12431;&#12394;&#12356;&#22580;&#21512;&#12399;&#31354;&#27396;&#12395;&#12375;&#12390;&#12362;&#12356;&#12390;&#19979;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>
<b>Download Method:</b> wget &#12414;&#12383;&#12399; curl &#12414;&#12383;&#12399; axel &#12414;&#12383;&#12399; axelautomirror</p>
<p>Fink &#12399;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12363;&#12425;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12398;&#12395;&#65299;&#31278;&#39006;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377; - <b>wget</b>, <b>curl</b>, &#12414;&#12383;&#12399; <b>axel</b>&#12290;
<b>axelautomirror</b> &#12399;&#12289; <b>axel</b> &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#23455;&#39443;&#30340;&#12514;&#12540;&#12489;&#12391;&#12289;&#29305;&#23450;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12354;&#12427;&#26368;&#12418;&#36817;&#12356;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
<b>axelmirror</b> &#12398;&#20351;&#29992;&#12399;&#29694;&#26178;&#28857;&#12391;&#12399;&#21223;&#12417;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399; <b>curl</b> &#12391;&#12377;&#12290;
<b>DownloadMethod &#12395;&#36984;&#25246;&#12375;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;!</b>
</p>
</li>
</ul>

<h3><a name="conf.mirrors">5.6 &#12511;&#12521;&#12540;&#35373;&#23450;</a></h3>

<p>&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12363;&#12425;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#21462;&#24471;&#12377;&#12427;&#12398;&#12399;&#36864;&#23624;&#12394;&#12371;&#12392;&#12391;&#12289;&#12452;&#12521;&#12452;&#12521;&#12377;&#12427;&#12371;&#12392;&#12364;&#22810;&#12356;&#12391;&#12377;&#12290;
&#12511;&#12521;&#12540;&#12469;&#12540;&#12496;&#12540;&#12399;&#20182;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12364;&#12289;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#22238;&#32218;&#12364;&#36895;&#12363;&#12387;&#12383;&#12426;&#12289;&#22320;&#29702;&#30340;&#12395;&#36817;&#12356;&#12394;&#12393;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;&#36895;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12289; <b>ftp.gnu.org</b> &#12394;&#12393;&#12398;&#20027;&#12469;&#12540;&#12496;&#12540;&#12398;&#36000;&#33655;&#12434;&#28187;&#12425;&#12377;&#24441;&#21106;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12469;&#12540;&#12496;&#12540;&#12364;&#33853;&#12385;&#12390;&#12356;&#12427;&#26178;&#12395;&#20195;&#12431;&#12426;&#12395;&#12394;&#12427;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>Fink &#12364;&#26368;&#36969;&#12394;&#12511;&#12521;&#12540;&#12434;&#36984;&#12406;&#12383;&#12417;&#12395;&#12399;&#12289;&#12393;&#12398;&#22823;&#38520;&#12398;&#12393;&#12398;&#22269;&#12395;&#12356;&#12427;&#12398;&#12363;&#12434;&#30693;&#12425;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12289;&#21516;&#12376;&#12511;&#12521;&#12540;&#12434;&#20877;&#24230;&#35430;&#12377;&#12363;&#12289;&#21516;&#12376;&#22269;&#12363;&#22823;&#38520;&#12398;&#21029;&#12398;&#12511;&#12521;&#12540;&#12434;&#35430;&#12377;&#12363;&#12289;&#12354;&#12427;&#12356;&#12399;&#19990;&#30028;&#20013;&#12363;&#12425;&#20182;&#12398;&#12511;&#12521;&#12540;&#12434;&#35430;&#12377;&#12363;&#12434;&#32862;&#12356;&#12390;&#12365;&#12414;&#12377;&#12290;
</p>
<p><b>fink.conf</b> &#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12393;&#12398;&#12511;&#12521;&#12540;&#12434;&#20351;&#12356;&#12383;&#12356;&#12363;&#12398;&#35373;&#23450;&#12364;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>
<b>MirrorContinent:</b> 3 &#23383;&#12398;&#12467;&#12540;&#12489;</p>
<p>&#12371;&#12398;&#20516;&#12434;&#22793;&#12360;&#12427;&#12395;&#12399;&#12289; <tt style="white-space: nowrap;">fink configure</tt> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
3 &#23383;&#12398;&#12467;&#12540;&#12489;&#12399; <tt style="white-space: nowrap;">/sw/lib/fink/mirror/_keys</tt> &#12395;&#12354;&#12427;&#12418;&#12398;&#12363;&#12425;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#12289;&#12450;&#12472;&#12450;&#12398;&#22580;&#21512;:
</p>
<pre>MirrorContinent: asi</pre>
</li>
<li>
<p>
<b>MirrorCountry:</b> 6 &#23383;&#12398;&#12467;&#12540;&#12489;</p>
<p>&#12371;&#12398;&#20516;&#12434;&#22793;&#12360;&#12427;&#12395;&#12399;&#12289; <tt style="white-space: nowrap;">fink configure</tt> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
6 &#23383;&#12398;&#12467;&#12540;&#12489;&#12399; <tt style="white-space: nowrap;">/sw/lib/fink/mirror/_keys</tt> &#12395;&#12354;&#12427;&#12418;&#12398;&#12363;&#12425;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#12289;&#26085;&#26412;&#12398;&#22580;&#21512;:</p>
<pre>MirrorCountry: asi-JP</pre>
</li>
<li>
<p>
<b>MirrorOrder:</b> MasterFirst &#12414;&#12383;&#12399; MasterLast &#12414;&#12383;&#12399; MasterNever &#12414;&#12383;&#12399; ClosestFirst</p>
<p>
Fink &#12399; 'Master' &#12511;&#12521;&#12540;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12289;&#20840;&#12390;&#12398; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12477;&#12540;&#12473; tarball &#12398;&#12524;&#12509;&#12472;&#12488;&#12522;&#12511;&#12521;&#12540;&#12391;&#12377;&#12290;
Master &#12511;&#12521;&#12540;&#12434;&#20351;&#12358;&#12392;&#12289;&#12477;&#12540;&#12473;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489; URL &#12364;&#22730;&#12428;&#12394;&#12356;&#12371;&#12392;&#12364;&#21033;&#28857;&#12391;&#12377;&#12290;
&#12518;&#12540;&#12470;&#12540;&#12399;&#12289; Fink &#12481;&#12540;&#12512;&#12395;&#12424;&#12387;&#12390;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12373;&#12428;&#12390;&#12356;&#12427;&#12511;&#12521;&#12540;&#12434;&#20351;&#12358;&#12363;&#12289;&#12458;&#12522;&#12472;&#12490;&#12523;&#12477;&#12540;&#12473; URL &#12392; gnome, KDE, Debian &#12394;&#12393;&#12398;&#12511;&#12521;&#12540;&#12469;&#12452;&#12488;&#12384;&#12369;&#12434;&#20351;&#12358;&#12363;&#12289;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20182;&#12289;&#20001;&#32773;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#12289;&#19978;&#12391;&#36848;&#12409;&#12383;&#12424;&#12358;&#12395;&#36817;&#12356;&#38918;&#12395;&#25506;&#12375;&#12390;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
MasterFirst &#12363; MasterLast &#12434;&#20351;&#12358;&#22580;&#21512;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12395;&#22833;&#25943;&#12375;&#12383;&#12425; Master (&#12354;&#12427;&#12356;&#12399; Master &#20197;&#22806;) &#12395;'&#12473;&#12461;&#12483;&#12503;&#12377;&#12427;'&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;:
</p>
<pre>
MasterFirst - "Master" &#12477;&#12540;&#12473;&#12511;&#12521;&#12540;&#12434;&#26368;&#21021;&#12395;&#25506;&#12377;&#12290;
MasterLast - "Master" &#12477;&#12540;&#12473;&#12511;&#12521;&#12540;&#12399;&#26368;&#24460;&#12395;&#25506;&#12377;&#12290;
MasterNever - "Master"  &#12477;&#12540;&#12473;&#12511;&#12521;&#12540;&#12399;&#20351;&#29992;&#12375;&#12394;&#12356;&#12290;
ClosestFirst - &#26368;&#12418;&#36817;&#12356;&#12477;&#12540;&#12473;&#12511;&#12521;&#12540;&#12434;&#26368;&#21021;&#12395;&#25506;&#12377; (&#20840;&#12390;&#12398;&#12511;&#12521;&#12540;&#12434;&#19968;&#32210;&#12395;&#12377;&#12427;)&#12290;
</pre>
</li>
</ul>

<h3><a name="conf.developer">5.7 &#38283;&#30330;&#32773;&#29992;&#35373;&#23450;</a></h3>

<p><b>fink.conf</b> &#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12399;&#12289;&#38283;&#30330;&#32773;&#12395;&#12398;&#12415;&#26377;&#29992;&#12394;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#19968;&#33324;&#30340;&#12394; Fink &#12518;&#12540;&#12470;&#12540;&#12364;&#12371;&#12428;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#21223;&#12417;&#12414;&#12379;&#12435;&#12290;
&#20197;&#19979;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12371;&#12428;&#12395;&#35442;&#24403;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>
<b>KeepRootDir:</b> &#12502;&#12540;&#12523;&#20516;</p>
<p>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12499;&#12523;&#12489;&#24460;&#12395; /sw/src/root-name-version &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#21066;&#38500;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#12399; false &#12391;&#12377;&#12290;
<b>&#27880;&#24847;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12495;&#12540;&#12489;&#12487;&#12451;&#12473;&#12463;&#12434;&#12356;&#12387;&#12401;&#12356;&#12395;&#12375;&#12414;&#12377;!</b>
</p>
</li>
<li>
<p>
<b>KeepBuildDir:</b> &#12502;&#12540;&#12523;&#20516;</p>
<p>&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12499;&#12523;&#12489;&#24460;&#12395; /sw/src/name-version &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#21066;&#38500;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#12399; false &#12391;&#12377;&#12290;
<b>&#27880;&#24847;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12495;&#12540;&#12489;&#12487;&#12451;&#12473;&#12463;&#12434;&#12356;&#12387;&#12401;&#12356;&#12395;&#12375;&#12414;&#12377;!</b>
</p>
</li>
</ul>

<h2><a name="usage">6 &#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531; fink &#12484;&#12540;&#12523;&#12398;&#20351;&#29992;&#26041;&#27861;</a></h2>


<h3><a name="usage.using">6.1 fink &#12484;&#12540;&#12523;&#12398;&#20351;&#29992;</a></h3>

<p>
<tt style="white-space: nowrap;">fink</tt> &#12484;&#12540;&#12523;&#12399;&#12477;&#12540;&#12473;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12434;&#25805;&#20316;&#12377;&#12427;&#19968;&#36899;&#12398;&#12467;&#12510;&#12531;&#12489;&#12363;&#12425;&#25104;&#12426;&#31435;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12356;&#12378;&#12428;&#12418;&#12289;&#26368;&#20302;&#38480;&#19968;&#12388;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12289;&#12354;&#12427;&#12356;&#12399;&#35079;&#25968;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12434;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12384;&#12369;&#12434;&#25351;&#23450; (&#20363; gimp) &#12375;&#12390;&#12418;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#20184;&#12398;&#23436;&#20840;&#12394;&#21517;&#21069; (&#20363; gimp-1.2.1 &#12414;&#12383;&#12399; gimp-1.2.1-3) &#12391;&#12418;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#26178;&#12399;&#12289; Fink &#12399;&#33258;&#21205;&#30340;&#12395;&#26368;&#26032;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#12522;&#12499;&#12472;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
</p>
<p>&#20197;&#19979;&#12399;&#12289; <tt style="white-space: nowrap;">fink</tt> &#12484;&#12540;&#12523;&#12398;&#12467;&#12510;&#12531;&#12489;&#19968;&#35239;&#12391;&#12377;:</p>

<h3><a name="usage.install">6.2 install</a></h3>

<p>install &#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12398;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
&#25351;&#23450;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12289; configure &#12289;&#12499;&#12523;&#12489;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#34892;&#12394;&#12356;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12289;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#30906;&#35469;&#12434;&#12392;&#12387;&#12383;&#24460;&#12391;&#33258;&#21205;&#30340;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#20363;:</p>
<pre>fink install nedit

Reading package info...
Information about 131 packages read.
The following additional package will be installed:
 lesstif
Do you want to continue? [Y/n]</pre>
<p>install &#12467;&#12510;&#12531;&#12489;&#12398;&#12456;&#12452;&#12522;&#12450;&#12473;: update, enable, activate, use (&#12411;&#12392;&#12435;&#12393;&#12399;&#27508;&#21490;&#30340;&#12394;&#29702;&#30001;&#12395;&#12424;&#12427;).
</p>

<h3><a name="usage.remove">6.3 remove</a></h3>

<p>
remove &#12467;&#12510;&#12531;&#12489;&#12399;&#12289; 'dpkg --remove' &#12434;&#21628;&#12403;&#20986;&#12375;&#12390;&#12471;&#12473;&#12486;&#12512;&#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
&#29694;&#22312;&#12399;&#12414;&#12384;&#21839;&#38988;&#12364;&#27531;&#12387;&#12390;&#12356;&#12390;&#12289; <tt style="white-space: nowrap;">fink</tt> &#12484;&#12540;&#12523;&#12364;&#35469;&#35672;&#12375;&#12390;&#12356;&#12427; (.info &#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;) &#12497;&#12483;&#12465;&#12540;&#12472;&#12384;&#12369;&#20966;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#20381;&#23384;&#24615;&#12399; dpkg &#12484;&#12540;&#12523;&#12395;&#23436;&#20840;&#12395;&#20219;&#12379;&#12390;&#12356;&#12414;&#12377; (&#12383;&#12356;&#12390;&#12356;&#12371;&#12428;&#12391;&#21839;&#38988;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;)&#12290;
</p>
<p>
remove &#12467;&#12510;&#12531;&#12489;&#12399;&#23455;&#38555;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12364;&#12289; .deb &#22311;&#32302;&#12497;&#12483;&#12465;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12399;&#12381;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12289;&#24460;&#12391;&#20877;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#38555;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12394;&#12367;&#12390;&#12418;&#33391;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12364;&#24517;&#35201;&#12391;&#12354;&#12428;&#12400;&#12289; <tt style="white-space: nowrap;">/sw/fink/dists</tt> &#12484;&#12522;&#12540;&#12363;&#12425; .deb &#12501;&#12449;&#12452;&#12523;&#12434;&#21462;&#12426;&#38500;&#12356;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;
</p>
<p>&#12456;&#12452;&#12522;&#12450;&#12473;: disable, deactivate, unuse, delete.</p>

<h3><a name="usage.update-all">6.4 update-all</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#20840;&#12390;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12399;&#24517;&#35201;&#12394;&#12356;&#12398;&#12391;&#12289;&#20837;&#21147;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;:
</p>
<pre>fink update-all</pre>

<h3><a name="usage.list">6.5 list</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#19968;&#35239;&#12434;&#20316;&#25104;&#12375;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#29366;&#27841;&#12289;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12289;&#30701;&#12356;&#35500;&#26126;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
&#24341;&#25968;&#12394;&#12375;&#12391;&#12371;&#12428;&#12434;&#21628;&#12435;&#12384;&#22580;&#21512;&#12289;&#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;&#12420;&#12471;&#12455;&#12523;&#12497;&#12479;&#12540;&#12531;&#12434;&#29992;&#12356;&#12390;&#12289;&#12510;&#12483;&#12481;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12384;&#12369;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
&#26368;&#21021;&#12398;&#21015;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#29366;&#27841;&#12434;&#34920;&#12375;&#12289;&#12381;&#12398;&#24847;&#21619;&#12399;&#20197;&#19979;&#12398;&#36890;&#12426;:
</p>
<pre>
     &#26410;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;
 i   &#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;
(i)  &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12384;&#12364;&#26368;&#26032;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12394;&#12356;
</pre>
<p>
<tt style="white-space: nowrap;">fink list</tt> &#12467;&#12510;&#12531;&#12489;&#12395;&#12399;&#12501;&#12521;&#12464;&#12364;&#12354;&#12426;&#12414;&#12377;:
</p>
<pre>
-h,--help
	  &#21033;&#29992;&#21487;&#33021;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12290;
-t,--tab
	  &#19968;&#35239;&#12434;&#12479;&#12502;&#21306;&#20999;&#12426;&#24418;&#24335;&#12391;&#20986;&#21147;&#12290;
	  &#20986;&#21147;&#12434;&#12473;&#12463;&#12522;&#12503;&#12488;&#12391;&#20966;&#29702;&#12377;&#12427;&#26178;&#12395;&#26377;&#21177;&#12290;
-i,--installed
	  &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
-o,--outdated
	  &#21476;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
-u,--uptodate
	  &#26368;&#26032;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
-n,--notinstalled
	  &#26410;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
-s=expr,--section=expr
	  &#27491;&#35215;&#34920;&#29694; expr &#12395;&#12510;&#12483;&#12481;&#12377;&#12427;&#12475;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
-w=xyz,--width=xyz.
	  &#20986;&#21147;&#24418;&#24335;&#12398;&#24133;&#12434;&#35373;&#23450;&#12377;&#12427;&#12290;
	  xyz &#12399;&#25968;&#20516;&#12363; auto &#12290;
	  auto &#12399;&#12479;&#12540;&#12511;&#12490;&#12523;&#24133;&#12395;&#24540;&#12376;&#12390;&#35373;&#23450;&#12373;&#12428;&#12427;&#12290;
	  &#12487;&#12501;&#12457;&#12523;&#12488;&#12399; auto &#12290;
</pre>
<p>
&#20363;:
</p>
<pre>
fink list                 - &#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#34920;&#31034;&#12290;
fink list bash            - bash &#12364;&#12354;&#12427;&#12363;&#12289;&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12363;&#34920;&#31034;&#12290;
fink list --outdated      - &#21476;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
fink list --section=kde   - kde &#12475;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
fink list "gnome*"         - 'gnome' &#12363;&#12425;&#22987;&#12414;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#34920;&#31034;&#12290;
</pre>
<p>
&#26368;&#24460;&#12398;&#20363;&#12398;&#12463;&#12457;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12471;&#12455;&#12523;&#12364;&#35299;&#37320;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#24517;&#35201;&#12391;&#12377;&#12290;
</p>

<h3><a name="usage.apropos">6.6 apropos</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12411;&#12392;&#12435;&#12393; <tt style="white-space: nowrap;">fink list</tt> &#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
&#19968;&#30058;&#38997;&#33879;&#12394;&#36949;&#12356;&#12399;&#12289; <tt style="white-space: nowrap;">fink apropos</tt> &#12364;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#26908;&#32034;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
&#27425;&#12395;&#38997;&#33879;&#12394;&#12398;&#12399;&#12289;&#26908;&#32034;&#25991;&#23383;&#21015;&#12364;&#24517;&#38920;&#12391;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12290;
</p>
<pre>
fink apropos irc          - &#21517;&#31216;&#12363;&#35443;&#32048;&#12395; 'irc' &#12364;&#21547;&#12414;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#34920;&#31034;&#12290;
fink apropos -s=kde irc   - &#19978;&#12392;&#21516;&#27096;&#12290;&#12383;&#12384;&#12375;&#12289; kde &#12475;&#12463;&#12471;&#12519;&#12531;&#12395;&#38480;&#23450;&#12290;
</pre>

<h3><a name="usage.describe">6.7 describe</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#25351;&#23450;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35443;&#32048;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;
&#29694;&#26178;&#28857;&#12391;&#12399;&#35443;&#32048;&#12364;&#12354;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12414;&#12384;&#23569;&#12394;&#12356;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#12456;&#12452;&#12522;&#12450;&#12473;: desc, description, info
</p>

<h3><a name="usage.fetch">6.8 fetch</a></h3>

<p>&#25351;&#23450;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12364;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#20197;&#21069;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378; tarball &#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</p>

<h3><a name="usage.fetch-all">6.9 fetch-all</a></h3>

<p>
<b>&#20840;&#12390;&#12398;</b>&#12497;&#12483;&#12465;&#12540;&#12472;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
fetch &#12392;&#21516;&#27096;&#12289;&#20197;&#21069;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378; tarball &#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.fetch-missing">6.10 fetch-missing</a></h3>

<p>
<b>&#20840;&#12390;&#12398;</b>&#12497;&#12483;&#12465;&#12540;&#12472;&#12477;&#12540;&#12473;&#12501;&#12449;&#12452;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#19978;&#12395;&#28961;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12415;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</p>

<h3><a name="usage.build">6.11 build</a></h3>

<p>
&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12375;&#12414;&#12377;&#12364;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12399;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12477;&#12540;&#12473; tarball &#12399;&#12289;&#12394;&#12369;&#12428;&#12400;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12398;&#32080;&#26524;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#12365;&#12427; .deb &#12497;&#12483;&#12465;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
&#12377;&#12391;&#12395; .deb &#12501;&#12449;&#12452;&#12523;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#20309;&#12418;&#12375;&#12414;&#12379;&#12435;&#12290;
&#20381;&#23384;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;&#12499;&#12523;&#12489;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;<b>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;</b>&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="usage.rebuild">6.12 rebuild</a></h3>

<p>&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12375;&#12414;&#12377; (build &#12467;&#12510;&#12531;&#12489;&#12392;&#21516;&#27096;&#12395;) &#12364;&#12289;&#12377;&#12391;&#12395;&#12354;&#12427; .deb &#12501;&#12449;&#12452;&#12523;&#12399;&#28961;&#35222;&#12375;&#12289;&#19978;&#26360;&#12365;&#12375;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12425;&#12289;&#26032;&#12375;&#12356; .deb &#12501;&#12449;&#12452;&#12523;&#12399; <tt style="white-space: nowrap;">dpkg</tt> &#12434;&#29992;&#12356;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#38283;&#30330;&#20013;&#12395;&#12399;&#12392;&#12390;&#12418;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.reinstall">6.13 reinstall</a></h3>

<p>
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12392;&#21516;&#27096;&#12391;&#12377;&#12364;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418; <tt style="white-space: nowrap;">dpkg </tt>&#12434;&#36890;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12289;&#35492;&#12387;&#12390;&#12497;&#12483;&#12465;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523;&#12434;&#28040;&#12375;&#12383;&#12426;&#12289;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12434;&#22793;&#12360;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12395;&#25147;&#12375;&#12383;&#12356;&#22580;&#21512;&#12394;&#12393;&#12395;&#12418;&#20351;&#12360;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.configure">6.14 configure</a></h3>

<p>
Fink &#12434;&#20877;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
&#12511;&#12521;&#12540;&#12469;&#12452;&#12488;&#12398;&#35373;&#23450;&#12420;&#12503;&#12525;&#12461;&#12471;&#12398;&#35373;&#23450;&#12418;&#34892;&#12394;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.selfupdate">6.15 selfupdate</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289;&#33258;&#21205;&#30340;&#12395; Fink &#12398;&#26032;&#12522;&#12522;&#12540;&#12473;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
Fink &#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12408;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12354;&#12427;&#12363;&#30906;&#35469;&#12375;&#12289; <tt style="white-space: nowrap;">fink</tt> &#33258;&#36523;&#12434;&#21547;&#12417;&#12383;&#12467;&#12450;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
&#36890;&#24120;&#12522;&#12522;&#12540;&#12473;&#12398;&#20182;&#12289; <tt style="white-space: nowrap;">/sw/fink/dists</tt> &#12434;&#35373;&#23450;&#12375;&#12390;&#30452;&#25509; CVS &#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12434;&#34892;&#12394;&#12358;&#12392;&#12289;&#20840;&#12390;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#26368;&#26032;&#29256;&#12408;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.index">6.16 index</a></h3>

<p>
&#12497;&#12483;&#12465;&#12540;&#12472;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20877;&#27083;&#31689;&#12375;&#12414;&#12377;&#12290;
&#36890;&#24120;&#12399; <tt style="white-space: nowrap;">fink</tt> &#12364;&#26356;&#26032;&#12398;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#33258;&#21205;&#26908;&#20986;&#12377;&#12427;&#12398;&#12391;&#12289;&#25163;&#21205;&#12391;&#34892;&#12394;&#12358;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>

<h3><a name="usage.validate">6.17 validate</a></h3>

<p>
&#12371;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12289; .info &#12392; .deb &#12501;&#12449;&#12452;&#12523;&#12395;&#12388;&#12356;&#12390;&#12356;&#12367;&#12388;&#12363;&#12481;&#12455;&#12483;&#12463;&#12434;&#34892;&#12394;&#12356;&#12414;&#12377;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12513;&#12531;&#12486;&#12490;&#12540;&#12399;&#12289; submit &#12377;&#12427;&#21069;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12392;&#23550;&#24540;&#12377;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#23550;&#12375;&#12390;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#12456;&#12452;&#12522;&#12450;&#12473;: check
</p>

<h3><a name="usage.scanpackages">6.18 scanpackages</a></h3>

<p>
&#25351;&#23450;&#12375;&#12383;&#12484;&#12522;&#12540;&#12395;&#23550;&#12375;&#12289; dpkg-scanpackages(8) &#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.checksums">6.19 checksums</a></h3>

<p>
&#21487;&#33021;&#12394;&#38480;&#12426;&#12289; <tt style="white-space: nowrap;">/sw/src</tt> &#20869;&#12395;&#12354;&#12427;&#20840;&#12390;&#12398; tarball &#12398; MD5 &#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290;
</p>

<h3><a name="usage.cleanup">6.20 cleanup</a></h3>

<p>
&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#21476;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12501;&#12449;&#12452;&#12523; (.info, .patch, .deb) &#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
&#12363;&#12394;&#12426;&#12398;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12364;&#21033;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
</p>

<hr><h2>Copyright Notice</h2><p>Copyright (c) 2001 Christoph Pfisterer,
Copyright (c) 2001-2004 The Fink Project.
You may distribute this document in print for private purposes,
provided the document and this copyright notice remain complete and
unmodified. Any commercial reproduction and any online publication
requires the explicit consent of the author.</p><hr><p>Generated from <i>$Fink: uguide.ja.xml,v 1.3 2004/02/24 03:03:42 babayoshihiko Exp $</i></p></body></html>
