<?
$title = "Руководство пользователя - Обновление";
$cvs_author = 'Author: dmacks';
$cvs_date = 'Date: 2004/12/09 18:17:04';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Руководство пользователя Contents"><link rel="next" href="conf.php?phpLang=ru" title="Конфигурационный файл Fink"><link rel="prev" href="packages.php?phpLang=ru" title="Инсталляция пакетов">';


include_once "header.ru.inc";
?>
<h1>Руководство пользователя - 4. Обновление Fink</h1>
        
        
        
            <p> Данная глава отражает процедуры обновления вашей инсталляции Fink
                до последних улучшенных версий.</p>
        
        <h2><a name="bin">4.1 Обновление при использовании бинарных пакетов</a></h2>
            
            <p> Если вы используете только бинарную дистрибуцию, нет
                отдельной процедуры обновления. Надо просто сделать запрос инструменту, который вы выберите,
                о получении списка последних пакетов через сервер и обновлении
                всех пакетов.</p>
            <p> В случае использования dselect достаточно использовать "[U]pdate", затем
                "[I]nstall". Конечно, вы можете выполнить между ними "[S]elect"
                для проверки выбранного и получения информации о новых
                пакетах.</p>
            <p> В случае использования apt, примените <code>apt-get update</code> для получения списка
                последних пакетов, затем <code>apt-get upgrade</code> для обновления всех пакетов,
                чтобы получить все имеющиеся версии.</p>
            <p>В случае использования Fink Commander, выберите описание Binary-&gt;Update для обновления
                списка пакетов, затем пакеты Binary-&gt;Dist-Upgrade
                для обновления до новых версий.</p>
            <p> Для получения более подробной информации, особенно об обновлениях более ранних версий Fink,
                  чем 0.3.0, см. матрицу обновления - <a href="http://fink.sourceforge.net/download/upgrade.php">Upgrade Matrix</a>.</p>
        
        <h2><a name="src">4.2 Обновление при дистрибуции на основе исходного кода</a></h2>
            
            <p> Если вы используете дистрибуцию на основе исходного кода, процедура
                включает два действия. Первое: вы скачиваете описание последнего
                пакета на свой компьютер. Второе: используете описание
                пакетов для компиляции новых пакетов; реальный исходный код скачивается
                в случае необходимости.</p>
            <p> Если у вас Fink 0.2.5 или более поздня версия, первое действие может быть
                выполнено при помощи <code>fink selfupdate</code>. Эта
                команда запустит проверку веб-сайта Fink, чтобы выяснить наличие нового
                выпуска, и в этом случае автоматически скачает и инсталлирует
                описание пакетов. В последних версиях команды
                 <code>fink</code> есть опция получения описания
                пакетов непосредственно от CVS или через rsync. CVS является хранилищем,
                управляемым версией, в котором осуществляется хранение описания пакетов
                и управление ими. Преимущество использования CVS в постоянном
                обновлении, но недостаток в том, что имеется один сервер
                CVS для Fink, который может быть ненадежен в случае
                большого трафика. По этой причине обычным пользователям рекомендуется
                использовать rsync. Для rsync имеется много зеркал
                и единственным недостатком является то, что такое описание пакетов
                занимает час или около того для миграции к зеркалам rsync после
                того, как они добавлены к CVS.</p>
            <p>(Если у вас возникли проблемы при обновлении инсталляции на основе
                    исходного кода, см. <a href="http://fink.sourceforge.net/download/fix-upgrade.php">Особые инструкции
                    </a>.)</p>
            <p> Если у вас более ранняя версия Fink, чем 0.2.5, надо скачать
                описание пакетов вручную. Посетите <a href="http://sourceforge.net/project/showfiles.php?group_id=17203">зону скачивания
                </a> и найдите тарбол последних пакетов - 0.x.x.tar.gz
                в модуле "distribution". Скачайте его, затем инсталлируйте следующим образом:
                </p>
            <pre>tar -xzf packages-0.x.x.tar.gz cd packages-0.x.x ./inject.pl</pre>
            <p> После обновления описания пакетов (любым образом)
                надо обновить все пакеты одновременно при помощи
                    <code>fink update-all</code>.</p>
            <p>Для обновления при дистрибуции на основе исходного кода при помощи Fink Commander, выберите
                Source-&gt;Selfupdate для скачивания информационных файлов
                о новых пакетах, затем примените Source-&gt;Update-all для обновления всех
                устаревших пакетов.</p>
        
        <h2><a name="mix">4.3 Комбинирование бинарных файлов и файлов исходного кода</a></h2>
            
            <p> Если для некоторых пакетов вы используете предварительно скомпилированные бинарные пакеты, а
                другие строите на основе исходного кода, для обновления инсталляции Fink надо следовать обоим видам инструкций,
                изложенных выше. Т.е. сначала надо использовать
                <code>dselect</code> или <code>apt-get</code> для получения
                последних версий пакетов, имеющихся в бинарном виде, затем
                <code>fink selfupdate</code> и <code>fink
                update-all</code> для получения описания текущих пакетов и обновления
                остальных пакетов. </p>
            <p> Начиная с fink 0.23.0 использование опции UseBinaryDist
                (настраиваемой через <a href="usage.php?phpLang=ru#options">--use-binary-dist (or -b) option</a> или
                в <a href="conf.php?phpLang=ru">Fink configuration file</a>) оба вида описания как
                для исходного кода, так и для и бинарных  файлов будут обновлены, если вы примените
                    <code>fink selfupdate</code>. В данном случае вам уже не нужно 
                использовать отдельно <code>apt-get</code>. </p>
            <p> Если вы используете Fink Commander, выберите описание Binary-&gt;Update
                descriptions для обновления списка пакетов, затем
                Binary-&gt;Dist-Upgrade packages для обновления до новых версий.
                После этого примените Source-&gt;Selfupdate для скачивания информационных файлов
                о новых пакетах, а затем Source-&gt;Update-all (см.
                предыдущий раздел, содержащий более подробную информацию). </p>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="conf.php?phpLang=ru">5. Конфигурационный файл Fink</a></p>
<? include_once "../../footer.inc"; ?>


