<?php
$title = "About";
$cvs_author = '$Author: gecko2 $';
$cvs_date = '$Date: 2012/11/11 14:54:25 $';

require "header.inc";
?>

<h1>Более подробная информация о Fink</h1>

<h2>Что такое Fink?</h2>

<p>
Проект Fink нацелен на перенос всего мира ПО Unix
<a href="http://www.opensource.org/">с открытым исходным кодом</a> в
<a href="http://www.opensource.apple.com/">Darwin</a> и
<a href="http://www.apple.com/macosx/">Mac OS X</a>.
Таким образом, мы преследуем две основные цели. Первая цель: модификация существующего программного обеспечения с открытым исходным кодом для компилирования и работы в Mac OS X.
(Этот процесс называется  переносом или портингом.)
Вторая цель: обеспечение доступа обычным пользователям в виде связной удобной дистрибуции результатов, соответствующей тому, к чему привыкли пользователи Linux.
(Этот процесс называется пакетированием.)
Проект предлагает предварительные бинарные пакеты, а также полностью автоматизированную систему, построенную на основе исходного кода. 
</p>
<p>
В достижении данных целей Fink основывается на отличных средствах управления пакетом, созданных проектом
<a href="http://www.debian.org/">Debian</a>  - <code>dpkg</code>,
<code>dselect</code> и <code>apt-get</code>.
Но самое главное, Fink добавляет свою собственную программу управления пакетом, названную (сюрприз!)
<code>fink</code>.
Вы можете увидеть <code>fink</code> в качестве встроенного сервера - он берет описание пакетов и делает из них бинарные пакеты .deb.
В ходе этого процесса он скачивает первоначальный исходный код из
Internet, внося по мере необходимости патчи, затем выполняет весь процесс конфигурации и построения пакета.
Наконец, он помещает результаты в архив пакета, который после этого готов к инсталляции. <code>dpkg</code>.
</p>
<p>
Поскольку Fink находится поверх Mac OS X, ему строго предписывается избегать интерференции с базовой системой.
В результате Fink может управлять отдельным деревом каталогов и обеспечивать инфраструктуру, что облегчает использование.
</p>


<h2>Почему необходимо использовать Fink?</h2>

<p>
Пять причин, по которым надо использовать Fink для инсталляции ПО Unix на вашем Mac:
</p>

<p>
<b>Расширенные возможности.</b>
Mac OS X включет только базовый набор инструментов строк команд.
Fink позволяет расширить возможности этих инструментов и выбор графических приложений, разработанных для Linux и других вариантов Unix.
</p>

<p>
<b>Удобство.</b>
При применении Fink процесс компилирования полностью автоматизирован; вам никогда не придется беспокоиться снова о создании файлов Makefiles, конфигурации скриптов и их параметров.
Система взаимозависимостей автоматически берет на себя заботу о наличии всех необходимых библоиотек. 
Наши пакеты обычно приспособлены для максимального набора параметров.
</p>

<p>
<b>Безопасность.</b>
Строгая политика Fink, нацеленная на устранение интерференции, обеспечивает неприкосновенность чувствительных частей вашей системы Mac OS X.
Вы можете обновлять Mac OS X без опасения, что "наступите на ногу" Fink, и наоборот.
Кроме того, система пакетирования позволяет безопасным образом удалять ПО, которое вам больше не нужно.
</p>

<p>
<b>Согласованность.</b>
Fink не просто случайная подборка пакетов, это связная дистрибуция.
Инсталлированные файлы помещаются в предсказуемые места.
Листинги документации обновляются.
Есть объединенный интерфейс для управления серверными процессами.
И большинство указанного работает на вас, находясь "под капотом".
</p>

<p>
<b>Гибкость.</b>
Вам надо просто скачать и инсталлировать необходимые вам программы.
Fink предоставляет вам свободу инсталлировать XFree86 или другие решения X11 любым образом, который вам нравится.
Если вы не хотите иметь X11 вообще, это тоже возможно.
</p>


<p>
<a href="index.php">Back Home</a> -
<a href="download/index.php">Download</a>
</p>


<?php
require "footer.inc";
