<?php
$title = "Organization of Fink";
$cvs_author = '$Author: thesin $';
$cvs_date = '$Date: 2014/10/23 22:09:50 $';

include "header.inc";
?>

<h1>Организация Fink</h1>

<p>Проект
 Fink основывается на работе волонтеров и достаточно свободной организационной структуре. В
 настоящее время основная рабочая группа Fink и переводчики Fink являются наиболее организованными
 группами в рамках проекта Fink.</p>

<a name="core"><h2>Основная рабочая группа Fink</h2></a>

<p>Основная
 рабочая группа Fink отвечает за несколько аспектов центрального управления проектом Fink. Члены
 группы работают над самой программой fink и координируют усилия других участников, вносящих
 вклад в развитие программы; они выступают в качестве специалистов по поддержке &quot;основных&quot; пакетов
 коллекции Fink и выполнения самообеспечения на базе основных пакетов; они управляют выпуском
 версий программы fink и связанных с ней программ; они руководят созданием и выпуском основных
 видов дистрибуции fink, включая дистрибуцию на основе исходного кода и бинарную дистрибуцию. Они также помогают
 координировать другие группы волонтеров, работающих над проектом Fink.</p>

<p>В
 данное время членами основной рабочей группы являются Макс Хорн, Дэниел Мэкс, Дейв Моррисон,
 Питер O'Горман и Бен Рид. С ними можно связаться через &lt;fink-core@lists.sourceforge.net&gt;.</p>

<h2>Переводчики
 Fink</h2>

<p>Информация
 появится в ближайшем будущем ...</p>

<?php
include "footer.inc";
?>
