<?php
$title = "Сетевой этикет - Первоначальное объявление";
$cvs_author = 'Author: gecko2';
$cvs_date = 'Date: 2012/11/11 15:20:16';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Сетевой этикет Contents"><link rel="next" href="reply.php?phpLang=ru" title="Ответы на объявления"><link rel="prev" href="before-post.php?phpLang=ru" title="Что надо сделать до размещения объявления">';


include_once "header.ru.inc";
?>
<h1>Сетевой этикет - 2. Первоначальное размещение объявления</h1>
        
        
        <h2><a name="system">2.1 Что у вас инсталлировано?</a></h2>
            
            <p>Если у вас проблема с инсталляцией пакета, надо
                дать следующую информацию о своей системе:</p>
            <ul>
                <li>Версия OS.</li>
                <li>Используемая версия Fink. Для этого полезно использовать
                    выходные данные, полученные после выполнения
                        <pre>fink --version</pre>в терминальном
                    окне.</li>
                <li>Надо указать, используете ли вы при инсталляции бинарные файлы,
                    н-р <code>apt-get</code>, или исходный код, н-р
                        <code>fink install</code>.<p>Если последнее, надо
                        указать, какую версию Developer Tools вы
                        используете.</p>
                </li>
                <li>
                    <p>Если вы инсталлируете пакет, требующий X11, надо
                        указать, что вы используете: Apple X11 или
                        XFree86. Если последнее, укажите версию. </p>
                    <p>В случае сомнений дайте следующую информацию.</p>
                </li>
            </ul>
        
        <h2><a name="problem-description">2.2 Что не получается?</a></h2>
            
            <ul>
                <li>
                    <b>Укажите имя и версию пакета, с которым
                        у вас проблемы.</b>
                    <p>Это должно быть указано в строке темы (subject) вашего сообщения.</p>
                    <p>Это значит, что если у вас проблемы с
                        <code>foo-3.141-6</code>, не следует просто сообщать о проблеме
                        с <code>foo</code>.</p>
                    <p>В частности, если вы инсталлируете пакет (н-р
                        <code>baz-2.18-1</code>), зависящий от других пакетов
                        (<code>foo-3.141-6</code>, <code>bar-16.0-9</code>, ...)
                        и у вас проблемы с <code>foo</code>, надо
                        сообщить о проблеме с <code>foo-3.141-6</code>,
                        а не с <code>baz-2.18-1</code>.</p>
                </li>
                <li>
                    <b>Опишите проблему.</b>
                    <p>Надо дать образец сообщения об ошибке.</p>
                    <ol>
                        <li>При проблемах с бинарной инсталляцией надо начать
                            с описания распаковки проблемного пакета:
                                <pre>... Selecting previously
                                deselected package foo error unpacking foo
                            ...</pre>и так до конца.<p></p>
                        </li>
                        <li>Несколько возможных вопросов в связи с
                            инсталляцией на основе исходного кода:<ol>
                                <li>Если проблема возникла при первоначальном конфигурировании,
                                    обычно это текущая проблема.
                                    Дайте сведения начиная с последних двух тестов, выполненных
                                    перед появлением сообщения об ошибке, и до конца:
                                        <pre>.... Checking for
                                        bar-config...no Error: bar-config not
                                        found ....</pre>
                                    <p>Если вы считаете, что это поможет, можно
                                        включить соответствующий раздел
                                        регистрационного файла конфигурации, н-р
                                        <code>/sw/src/foo-3.141-6/foo-3.141/config.log</code>.
                                        <b>Не надо включать весь файл,
                                        т.к. он может быть большим.</b>
                                    </p>
                                </li>
                                <li>Или же сообщение об ошибке может появиться сразу,
                                    как только вы начинаете построение пакета.
                                    В это случае надо включить в объявление последнюю строку,
                                    которую компилятор попытался выполнить, и т.д. до конца:
                                        <pre>... gcc &lt;flags,
                                        files etc.&gt; &lt;error
                                        messages&gt; ...</pre>
                                </li>
                                <li>Если у вас ошибка <code>execution of mv
                                    failed</code>, вам порекомендуют
                                    просмотреть выходные сведения о построении,
                                    чтобы найти информацию о предыдущей ошибке, так что можно попытаться
                                    найти это до размещения объявления.</li>
                            </ol>
                        </li>
                    </ol>
                </li>
            </ul>
        
        <h2><a name="remedies">2.3 Что вы пробовали сделать?</a></h2>
            
            <p>Хорошо бы указать, что вы уже попробовали сделать, н-р</p>
            <ul>
                <li>Просмотр Ч.З.В. и другой документации</li>
                <li>Удаление пакетов, появление которых спровоцировало конфликт</li>
                <li>Восстановление/реинсталляция</li>
                <li>Обновление описания пакета</li>
                <li>и т.д.</li>
            </ul>
            <p>Таким образом, вам не будут предлагать сделать то, что вы уже сделали.
                </p>
        
        <h2><a name="future-plans">2.4 Что еще надо попытаться сделать?</a></h2>
            
            <p>Есть еще пара вещей, которые можно сделать:</p>
            <ul>
                <li>Написать, что вы планируете сделать, если не получите ответ сразу. </li>
                <li>Спросить о соответствии образа действия.</li>
            </ul>
        
    <p align="right"><?php echo FINK_NEXT ; ?>:
<a href="reply.php?phpLang=ru">3. Ответы на объявления</a></p>
<?php include_once "../../footer.inc"; ?>


