<?
$title = "Сетевой этикет - Ответы";
$cvs_author = 'Author: horsager';
$cvs_date = 'Date: 2005/02/01 02:04:51';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Сетевой этикет Contents"><link rel="next" href="unsubscribe.php?phpLang=ru" title="Отказ от подписки на списки рассылки"><link rel="prev" href="first-post.php?phpLang=ru" title="Первоначальное размещение объявления">';


include_once "header.ru.inc";
?>
<h1>Сетевой этикет - 3. Ответы на объявления</h1>
        
        
        
            <p>Данный раздел рассказывает о том, как надо отвечать на объявления.</p>
        
        <h2><a name="reply-to-list">3.1 Надо убедиться, что вы отвечаете всему списку</a></h2>
            
            <p>В отличие от некоторых других списков рассылки, на которые вы можете быть подписаны,
                списки Fink устроены так, что если вы просто отвечаете на сообщение,
                вы отвечаете тому, кто разместил объявление, но
                <b>не</b> списку. Пожалуйста, убедитесь, что отвечаете
                списку: </p>
            <ul>
                <li>Большее количество людей увидят проблему.</li>
                <li>Вы не монополизируете чье-то время. Помните: отвечающие
                    являются волонтерами.</li>
                <li>Наконец, это может быть полезно другим. Доступность корреспонденции
                    электронной почты для всех значит, что они могут видеть
                    архивы списков рассылки и разобраться с документацией.</li>
            </ul>
            <p>Часто для выполнения используют <q>Reply to All</q>:
               </p>
            <ul>
                <li>Обычно это также просто, как "Reply".</li>
                <li>Если таким образом отправляется ответ всему списку и автору
                    вопроса, это может быть желательным, т.к.
                    иногда почта списка задерживается, н-р из-за фильтрации вирусов при
                    существенных сбоях, и ответ на объявление приходит
                    быстрее.</li>
            </ul>
            <p>Однако если вы делаете это, возможно вам захочется отсечь
                лишних получателей (перекрестные объявления, а также тех, кто высказался на
                эту тему).</p>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="unsubscribe.php?phpLang=ru">4. Отказ от подписки на списки рассылки</a></p>
<? include_once "../../footer.inc"; ?>


