<?
$title = "パッケージ作成 - 始めに";
$cvs_author = 'Author: babayoshihiko';
$cvs_date = 'Date: 2004/03/30 03:03:07';
$metatags = '<link rel="contents" href="index.php?phpLang=ja" title="パッケージ作成 Contents"><link rel="next" href="format.php?phpLang=ja" title="パッケージ記述情報"><link rel="prev" href="index.php?phpLang=ja" title="パッケージ作成 Contents">';

include_once "header.inc";
?>

<h1>パッケージ作成 - 1 始めに</h1>
		
		

		<h2><a name="def1">1.1 パッケージとは何か?</a></h2>
			
			<p>
				パッケージとは，基本的単位を構成するソフトウェアのまとまりを指します．
				典型的なパッケージには，例えば実行可能プログラム，それが必要とするデータファイル，
				国際化のためのメッセージカタログ，そしてドキュメントが含まれます．
				Fink のパッケージには2種類の形式があります．
				すなわちパッケージ記述情報と，そのままインストール可能なバイナリパッケージファイルです．
			</p>
			<p>
				パッケージ記述情報は人でも読めるテキストファイルで，
				パッケージをビルドするために必要な (つまりバイナリパッケージファイルを作るのに必要な) 全ての情報を含みます．
				それにはメタデータ (パッケージ名や目的など) やソースコードの URL の他，
				configure やコンパイル，インストールに必要な命令が書かれています．
			</p>
			<p>
				バイナリパッケージファイルとは，パッケージを実際に構成する各ファイルのアーカイブを指します．
				これには実行可能プログラム，データファイル，メッセージカタログ，ライブラリ，インクルードファイルなどが入っています．
				また，そのパッケージに関するメタデータも含まれます．
				バイナリパッケージは既に使用できる形式ですので，インストールとは主に中身のファイルを展開することです．
				Finkはパッケージ管理システム dpkg の上に構築されたシステムなので，
				バイナリパッケージには dpkg の形式を使い，拡張子は .deb です．
			</p>
		

		<h2><a name="ident">1.2 パッケージの区別</a></h2>
			
			<p>
				パッケージは3つの文字列で区別されます．
				すなわち「パッケージ名」，「バージョン」と「版」です．
				これらのいずれにも英小文字 (a から z)，数字 (0 から 9)， ダッシュ (-)，プラス (+)，ドット (.) のみが使えます．
				この他の字は使えません．
				特に，大文字とアンダースコアが使えないことに注意して下さい．
			</p>
			<p>
				「パッケージ名」には単にソフトウェアの名前 (openssh など) を使います．
				「バージョン」は「upstreamバージョン」とも呼ばれますが，これには元となるソフトウェアパッケージのバージョンを使います．
				「バージョン」には (2.9p1 のように) 数字以外を使っても構いません．
				Fink も dpkg もそれらを認識してソートできます．
				「版」は整数で， 1 で始まり，パッケージ記述情報に変更回数に応じて 1 ずつ増加します．
				「upstreamバージョン」が変化すると再び 1 に戻ります．
				「版」にダッシュを使ってはいけません．
				パッケージの正式名称は「パッケージ名」，「バージョン」と「版」をダッシュでつないだもので，
				openssh-2.9p1-2 などという形式になります．
			</p>
		

	<p align="right">
Next: <a href="format.php?phpLang=ja">2 パッケージ記述情報</a></p>

<? include_once "footer.inc"; ?>
