<?
$title = "Доступ к Fink через CVS";
$cvs_author = 'Author: gecko2';
$cvs_date = 'Date: 2012/11/11 15:20:13';
$metatags = '';


include_once "header.inc";
?>
<h1>Настройка доступа к Fink через CVS</h1>
<!--Generated from $Fink: cvs.ru.xml,v 1.5 2012/11/11 15:20:13 gecko2 Exp $-->
        <p> Fink разработан через посредство CVS. Это значит, что вы можете быть в курсе 
         последних разработок между выпусками версий и всегда получать новейший материал. Данная страница рассказывает о том, 
           как можно произвести настройку имеющейся инсталляции Fink для обновления через 
            CVS. Информация на данной странице относится к Fink 0.3.x и более поздним версиям.</p>
    <h2><a name="">Структура CVS Fink </a></h2>
        
        <p>Fink имеет несколько модулей CVS. Модуль <code>dists</code> (<a href="http://fink.cvs.sourceforge.net/fink/">ViewCVS</a>)
            содержит описание пакетов и патчи для OS X 10.2 и более поздних версий. Есть другие модули, используемые разработчиками Fink,  
            обзор которых доступен всем, но они не представляют интереса для большинства пользователей.</p>
    <h2><a name="">Обновление описания пакетов</a></h2>
        
        <p>Раньше это была довольно нудная процедура, но в текущих версиях Fink
            это очень просто. Просто дайте следующую команду:</p>
        <pre>fink selfupdate-cvs</pre>
        <p>Fink автоматически выполнит все необходимые вам действия, в том числе  
            найдет последний комплект описания пакетов и обновит несколько основных базовых пакетов 
            (среди них менеджер пакетов Fink).</p>
        <p>Если вы находитесь за брандмауэром, см. <a href="/faq/usage-fink.php#proxy">Ч.З.В. 3.2</a>.</p>
        <p>После обновления своего описания пакетов указанным образом у вас 
            может появиться желание обновить свои пакеты до последних возможных версий. 
            Это можно сделать при помощи следующй команды:</p>
        <pre>fink update-all</pre>
    <h2><a name="">Обновление менеджера пакетов</a></h2>
        
        <p>
            <b>Примечание:</b>С 20 сентября 2001 н. больше нет необходимости 
            обновлять менеджер пакетов отдельно; с ним обращаются, как с любым другим 
            пакетом. Все еще возможно обновлять его непосредственно из CVS, хотя
            это обычно интересует тех, кто создает пакеты, а не средних
            пользователей.</p>
        <p>Менеджер пакетов должен обновляться через отдельный каталог и
            скрипт <code>inject.pl</code>. Данный скрипт помещает описание 
            пакетов и тарболы для пакетов fink и базовых файлов 
            на вашем дереве Fink и осуществляет их построение.</p>
        <p>При выполнении первоначальной процедуры вам нужен временный каталог (в примере называемый 
            <code>tempdir</code>), который должен быть пустым (или по крайней мере не должен содержать
            подкаталог под именем 'fink'). Порядок действий 
            следующий:</p>
        <pre>cd tempdir cvs
            -d:pserver:anonymous@fink.cvs.sourceforge.net:/cvsroot/fink login cvs -z3
            -d:pserver:anonymous@fink.cvs.sourceforge.net:/cvsroot/fink co fink cd
            fink ./inject.pl</pre>
        <p>Команда login запросит пароль - просто нажмите return. Вы
            можете удалить временный каталог после данной процедуры, но если
            его оставить, будет легче произвести обновление в следующий раз. Тогда порядок действий таков:</p>
        <pre>cd tempdir/fink cvs -z3 update -d ./inject.pl</pre>
    
<? include_once "../../footer.inc"; ?>


