<?
$title = "Использование X11 - Запуск XFree86";
$cvs_author = 'Author: rangerrick';
$cvs_date = 'Date: 2007/02/23 22:04:57';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Использование X11 Contents"><link rel="next" href="xtools.php?phpLang=ru" title="Xtools"><link rel="prev" href="inst-xfree86.php?phpLang=ru" title="Получение и инсталляция XFree86">';


include_once "header.ru.inc";
?>
<h1>Использование X11 - 4. Запуск XFree86</h1>
        
        
        <h2><a name="darwin">4.1 Darwin</a></h2>
            
            <p> В чистой Darwin XFree86 ведет себя также, как в других продуктах Unix.
                Обычный способ запуска - через <code>startx</code> с консоли;
                запускается сервер и некоторые исходные клиенты, такие,
                как менеджер окон и терминальный эмулятор с оболочкой.  В чистой
                Darwin не требуется уточнять параметры, достаточно
                просто напечатать:</p>
            <pre>startx</pre>
            <p> Можно сделать настройки запуска в нескольких файлах
                в своем базовом каталоге. <code>.xinitrc</code> управляет очередностью
                запуска клиентов. <code>.xserverrc</code> управляет
                опциями сервера и даже может запускать другой сервер. В случае возникновения проблем
                (н-р, появится пустой экран или XFree86
                переместит вас обратно к консоли) их можно исправить
                путем удаления этих файлов. Если не удается найти эти файлы при помощи
                <code>startx</code>, в действие вступают безотказные настройки по
                умолчанию.</p>
            <p> В качестве альтернативы можно запустить сервер напрямую при помощи
                одной из опций XDMCP, н-р:</p>
            <pre>X -query remotehost</pre>
            <p> Подробную информацию можно найти на странице руководства <code>Xserver</code>.
                </p>
            <p> Наконец, можно настроить <code>xdm</code>; см.
                страницу руководства.</p>
            <p> Прим.: Если вы используете Mac OS X, предшествующую Panther, можно напечатать
                <code>&gt;console</code> в окне регистрации и получить
                текстовую консоль, эквивалентную чистой Darwin. Если вы не видите
                области для ввода имени пользователя в окне регистрации,
                просто напечатайте начальную букву любого имени пользователя и затем нажмите
                alt-return. Можно использовать все методы запуска,
                описанные выше, кроме <code>xdm</code>.</p>
            <p> Прим.: При использовании Mac OS X Panther вы не сможете запускать
                XFree86 из окна консоли.</p>
        
        <h2><a name="macosx-41">4.2 Mac OS X + XFree86 4.x.y</a></h2>
            
            <p> Есть два основных способа запустить XFree86 в Mac OS X.
                Первый: двойным щелчком на приложении XDarwin.app в каталоге
                приложений. Это позволит сделать выбор между полноэкранным и бескорневым режимом
                в диалоге при запуске. Можно дезактивировать диалог
                и настроить XDarwin на постоянное использование выбранного вами режима
                в диалоге параметров.</p>
            <p> До выпуска 4.2.0 это действие автоматически активировало полноэкранный режим
                и не было способа активации бескорневого режима двойным щелчком.</p>
            <p> Другой способ запуска XFree86 в Mac OS X:
                при помощи <code>startx</code> из Terminal.app. При запуске сервера таким образом
                надо указать, что он должен работать параллельно
                Quartz. Это можно сделать при помощи опции <code>-fullscreen</code>,
                н-р:</p>
            <pre>startx -- -fullscreen</pre>
            <p> Таким образом происходит запуск сервера в полноэкранном режиме, а также
                клиентов в <code>.xinitrc</code>.</p>
            <p> ПРИМЕЧАНИЕ: до выпуска 4.2 для активации полноэкранного режима применяли <code>-quartz</code>.</p>
            <p> Если ваш сервер поддерживает бескорневые операции, можно
                запустить его в бескорневом режиме при помощи опции <code>-rootless</code>:</p>
            <pre>startx -- -rootless</pre>
            <p> Опция <code>-quartz</code> больше не активирует полноэкранный режим, а
                использует режим по умолчанию, определенный в параметрах.</p>
            <p>Что касается 4.3, если вы используете <code>startx</code> без настройки параметров, появляется
                окно диалога запуска.</p>
        
        <h2><a name="xinitrc">4.3 Файл .xinitrc</a></h2>
            
            <p> Если в вашем базовом каталоге имеется файл с именем <code>.xinitrc</code>,
                он будет использоваться для запуска некоторых исходных клиентов X,
                н-р, менеджера окон, некоторых xterms или среды рабочего стола типа
                GNOME. Файл <code>.xinitrc</code> является скриптом оболочки,
                содержащим команды для выполнения указанного. <b>Не</b>
                надо указывать <code>#!/bin/sh</code> в первой строке
                и настраивать выполняемый бит в имени файла; xinit знает, как
                запустить его через оболочку.</p>
            <p> Если в вашем базовом каталоге нет файла <code>.xinitrc</code>,
                XFree86 использует по умолчанию свой файл
                <code>/private/etc/X11/xinit/xinitrc</code>. Можно использовать
                файл по умолчанию в качестве отправной точки для собственного .xinitrc:</p>
            <pre>cp /private/etc/X11/xinit/xinitrc ~/.xinitrc</pre>
            <p> Если вы используете Fink, надо поместить
                <code>init.sh</code> в самом начале для
                обеспечения правильности настроек среды.</p>
            <p> Вы можете внести произвольные команды в
                <code>.xinitrc</code>, но здесь надо кое-что пояснить.
                Во-первых, интерпретирующая файл оболочка по умолчанию будет ждать
                завершения работы каждой отдельной программы, прежде чем запустить следующую. Если
                вы хотите, чтобы несколько программ работали параллельно, надо приказать оболочке
                поместить их "на задний план", добавив
                <code>&amp;</code> в конце строки.</p>
            <p> Во-вторых, <code>xinit</code> ждет, пока скрипт
                <code>.xinitrc</code> закончит работу и интерпретирует окончание работы
                таким образом: "сеанс завершен, теперь я также должен уничтожить сервер X
                ". Это значит, что последняя команда вашего файла
                 <code>.xinitrc</code> не должна выполняться на
                заднем плане, а должна быть программой длительного действия. Обычно
                для этой цели используется менеджер окон. Вообще,
                менеджеры окон предполагают, что <code>xinit</code> ждет окончания их
                работы и используют это для ввода записи о "завершении
                сеанса" в работу их меню. (Прим.: Для сохранения
                циклов ОЗУ и центрального процессора можно указать <code>exec</code> перед
                последней строкой, как в примере ниже.)</p>
            <p> Простой пример запуска GNOME:</p>
            <pre>. /sw/bin/init.sh exec gnome-session</pre>
            <p>Более сложный пример для пользователей bash, который отключает X11,
                делает запуск некоторых клиентов и в конце концов менеджера окон Enlightenment:
                </p>
            <pre>. /sw/bin/init.sh xset b off xclock -geometry -0+0
                &amp; xterm &amp; xterm &amp; exec enlightenment</pre>
            <p>Для запуска GNOME 2.2 в X11 Apple используйте следующую последовательность:</p>
            <pre>. /sw/bin/init.sh quartz-wm --only-proxy &amp;
                metacity &amp; exec gnome-session</pre>
            <p>При запуске GNOME 2.4 в X11 Apple metacity запускается автоматически,
                и таким образом последовательность следующая:</p>
            <pre>. /sw/bin/init.sh quartz-wm --only-proxy &amp; exec gnome-session</pre>
            <p>Для запуска KDE 3.2 (версия &lt; 3.2.2-21) в X11 Apple используйте</p>
            <pre>. /sw/bin/init.sh export KDEWM=kwin quartz-wm
                --only-proxy &amp; /sw/bin/startkde &gt;/tmp/kde.log 2&gt;&amp;1</pre>
            <p>Наконец, для запуска последней нестабильной версии KDE в
                X11 Apple:</p>
            <pre>. /sw/bin/init.sh /sw/bin/startkde &gt;/tmp/kde.log 2&gt;&amp;1</pre>
        
    <p align="right"><? echo FINK_NEXT ; ?>:
<a href="xtools.php?phpLang=ru">5. Xtools</a></p>
<? include_once "../../footer.inc"; ?>


