<?
$title = "Использование X11 - Подсказки";
$cvs_author = 'Author: dmacks';
$cvs_date = 'Date: 2007/08/15 21:57:05';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Использование X11 Contents"><link rel="prev" href="trouble.php?phpLang=ru" title="Устранение проблем, возникших в связи с XFree86">';


include_once "header.ru.inc";
?>
<h1>Использование X11 - 8. Подсказки по использованию</h1>
        
        
        <h2><a name="terminal-app">8.1 Запуск приложений X11 из окна Terminal.app</a></h2>
            
            <p> Для запуска приложений X11из окна Terminal.app необходимо
                настроить переменную величину среды "DISPLAY". Данная переменная
                сообщает приложению, где можно найти окно сервера X11.
                При настройке по умолчанию - когда  XDarwin запускается на одной машине
                - можно установить следующую настройку переменной:</p>
            <ul>
                <li>
                    <p>В случае использования tcsh:</p>
                    <pre>setenv DISPLAY :0.0</pre>
                </li>
                <li>
                    <p>В случае использования bash:</p>
                    <pre>export DISPLAY=":0.0"</pre>
                </li>
            </ul>
            <p> Хорошим решением является настройка, при которой XDarwin.app запускается при вашем входе в систему
                (настройку можно сделать на панели регистрации пользователей в параметрах системы в Mac OS
                10.2 и на панели счетов пользователей в пунктах запуска в Mac OS 10.3):</p>
            <ul>
                <li>
                    <p>При использовании tcsh надо добавить следующее к .cshrc:</p>
                    <pre>if (! $?DISPLAY) then setenv DISPLAY :0.0 endif</pre>
                </li>
                <li>
                    <p>При использовании bash надо добавить следующее к .bashrc:</p>
                    <pre>[[ -z $DISPLAY ]] &amp;&amp; export DISPLAY=":0.0"</pre>
                </li>
            </ul>
            <p> Таким образом DISPLAY настраивается в любой оболочке. При этом данная настройка не
                превалирует над текущим значением, если DISPLAY уже настроен.
                Таким образом  все еще можно запускать приложения X11 дистанционно или через
                ssh с туннелированием X11.</p>
        
        <h2><a name="open">8.2 Запуск приложения Aqua apps из xterm</a></h2>
            
            <p> Одним из способов запуска приложений Aqua из xterm (или любой другой
                оболочки) является команда <code>open</code>. Примеры:</p>
            <pre>open /Applications/TextEdit.app open SomeDocument.rtf
                open -a /Applications/TextEdit.app index.html</pre>
            <p> Во втором примере документ должен открываться в приложении, которое с ним связано;
                в третьем примере указано приложение, которое необходимо использовать.
                </p>
        
        <h2><a name="copy-n-paste">8.3 Копирование (Copy) и вставка (Paste)</a></h2>
            
            <p> Copy и Paste в основном работают между средами Aqua и X11.
                Все еще возникают некоторые ошибки. Есть жалобы о том, что Emacs
                слишком требователен в текущем выборе. Copy и Рaste не работают между Classic
                и X11.</p>
            <p> Так или иначе, решение заключается в использовании правильного способа
                в зависимости от имеющейся среды. Для переноса текста из Aqua в X11 используйте
                Cmd-C в Aqua, затем перенесите окно направления на передний план
                и для вставки примените "среднюю клавишу мышки" или
                Alt-щелчок, если у вас одноклавишная мышка (эту конфигурацию можно настроить
                в параметрах XDarwin). Для переноса текста из
                X11в Aqua просто выделите текст мышкой в X11, затем вставьте его
                при помощи Cmd-V в Aqua.</p>
            <p> В системе X11 есть несколько отдельных буферов обмена (называемых в X11
                "cut buffers") и некоторые приложения не знают, какой из
                них следует использовать. В частности, по этой причине иногда не работает
                вставка в GNU Emacs или XEmacs.
                Программа <code>autocutsel</code> может в этом помочь;
                она автоматически синхронизирует два основных буфера для
                вырезанных объектов. Для ее запуска надо инсталлировать пакет Fink autocutsel и
                добавить следующую строку к .xinitrc:</p>
            <pre>autocutsel &amp;</pre>
            <p> (Она обязательно должна находиться <b>перед</b>строкой выполнения менеджера
                окна и никогда не должна быть на заднем плане! Не надо добавлять ее в конце - она просто не
                будет выполняться.) Запомните, что это больше не требуется для
                X11 Apple (см. <a href="inst-xfree86.php?phpLang=ru#apple-binary">Замечания об использовании X11 Apple</a>).</p>
            <p>Если вы используете X11 Apple, можно применять Command-C или
                Edit-&gt;Copy, обычные для приложений Mac, для копирования текста в буфер,
                а среднюю клавишу мышки или Command-V для вставки
                из буфера в X11 Apple.</p>
            <p>В любом случае, если вы сталкиваетесь с проблемами копирования или вставки из
                Aqua в  X11 и наоборот, сначала надо попытаться сделать вставку дважды
                (иногда копия не получается при однократной попытке),
                затем использовать промежуточные приложения, н-р, TextEdit или
                Terminal.app для Aqua и nedit или xterm для X11.
                По моему опыту, всегда можно найти решение.</p>
        
    
<? include_once "../../footer.inc"; ?>


