<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head><meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"><title>Fink Documentation - Running X11 on Darwin and Mac OS X</title></head><body><h1 style="text-align: center;">Running X11 on Darwin and Mac OS X</h1>
<p>
&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12289; Apple &#12398; Mac OS X &#12362;&#12424;&#12403; Darwin &#12471;&#12473;&#12486;&#12512;&#19978;&#12391; X11 / XFree86 / Xtools &#12434;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
&#32057;&#20171;&#12392;&#38283;&#30330;&#12398;&#27508;&#21490;&#12363;&#12425;&#22987;&#12414;&#12426;&#12289; &#29694;&#29366;&#12392; X11 &#12434;&#20351;&#12358;&#19978;&#12391;&#12398;&#27096;&#12293;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399; Fink &#12434;&#20351;&#12358;&#12363;&#20351;&#12431;&#12394;&#12356;&#12363;&#12395;&#12399;&#30452;&#25509;&#12398;&#38306;&#20418;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>
<h2>Contents</h2><ul><li><a href="#intro"><b>1 &#12452;&#12531;&#12488;&#12525;&#12480;&#12463;&#12471;&#12519;&#12531;</b></a><ul><li><a href="#intro.def-x11">1.1 What is X11?</a></li><li><a href="#intro.def-macosx">1.2 Mac OS X &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.def-darwin">1.3 Darwin &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.def-xfree86">1.4 What is XFree86?</a></li><li><a href="#intro.def-xtools">1.5 Xtools &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.client-server">1.6 &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;</a></li><li><a href="#intro.rootless">1.7 rootless &#12392;&#12399;&#12393;&#12358;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.wm">1.8 &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li><li><a href="#intro.desktop">1.9 Quartz/Aqua &#12420; Gnome, KDE &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></li></ul></li><li><a href="#history"><b>2 &#27508;&#21490;</b></a><ul><li><a href="#history.early">2.1 &#21476;&#20195;</a></li><li><a href="#history.xonx-forms">2.2 XonX forms</a></li><li><a href="#history.root-or-not">2.3 root &#12363; root &#12395;&#12354;&#12425;&#12374;&#12427;&#12363;</a></li></ul></li><li><a href="#inst-xfree86"><b>3 XFree86 &#12398;&#20837;&#25163;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</b></a><ul><li><a href="#inst-xfree86.fink">3.1 Fink &#12434;&#20351;&#12387;&#12383;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#inst-xfree86.apple-binary">3.2 Apple &#12398;&#12496;&#12452;&#12490;&#12522;</a></li><li><a href="#inst-xfree86.official-binary">3.3 &#20844;&#24335;&#12496;&#12452;&#12490;&#12522;</a></li><li><a href="#inst-xfree86.official-source">3.4 &#20844;&#24335;&#12477;&#12540;&#12473;</a></li><li><a href="#inst-xfree86.latest-cvs">3.5 &#26368;&#26032;&#12398;&#38283;&#30330;&#29992;&#12477;&#12540;&#12473;</a></li><li><a href="#inst-xfree86.xonx-bin">3.6 XonX &#12496;&#12452;&#12490;&#12522;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473; (XAqua, XDarwin)</a></li><li><a href="#inst-xfree86.macgimp">3.7 MacGimp</a></li><li><a href="#inst-xfree86.rootless">3.8 &#12493;&#12483;&#12488;&#19978;&#12398;&#12523;&#12540;&#12488;&#12524;&#12473;&#12469;&#12540;&#12496;</a></li><li><a href="#inst-xfree86.switching-x11">3.9 X11 &#12398;&#21066;&#38500;</a></li><li><a href="#inst-xfree86.fink-summary">3.10 Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35201;&#28857;</a></li></ul></li><li><a href="#run-xfree86"><b>4 XFree86 &#12398;&#36215;&#21205;</b></a><ul><li><a href="#run-xfree86.darwin">4.1 Darwin</a></li><li><a href="#run-xfree86.macosx-41">4.2 Mac OS X + XFree86 4.x.y</a></li><li><a href="#run-xfree86.xinitrc">4.3 .xinitrc &#12501;&#12449;&#12452;&#12523;</a></li></ul></li><li><a href="#xtools"><b>5 Xtools</b></a><ul><li><a href="#xtools.install">5.1 Xtools &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></li><li><a href="#xtools.run">5.2 Xtools &#12398;&#36215;&#21205;</a></li><li><a href="#xtools.opengl">5.3 OpenGL &#12395;&#38306;&#12377;&#12427;&#27880;&#35352;</a></li></ul></li><li><a href="#other"><b>6 &#12381;&#12398;&#20182;&#12398; X11</b></a><ul><li><a href="#other.vnc">6.1 VNC</a></li><li><a href="#other.wiredx">6.2 WiredX</a></li><li><a href="#other.exodus">6.3 eXodus</a></li></ul></li><li><a href="#trouble"><b>7 XFree86 &#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</b></a><ul><li><a href="#trouble.immedate-quit">7.1 XDarwin &#12434;&#36215;&#21205;&#12375;&#12383;&#30452;&#24460;&#12395;&#32066;&#20102;&#12363;&#12463;&#12521;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;</a></li><li><a href="#trouble.black">7.2 GNOME &#12497;&#12493;&#12523;&#12420; GNOME &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12513;&#12491;&#12517;&#12398;&#12450;&#12452;&#12467;&#12531;&#12364;&#40658;&#12356;</a></li><li><a href="#trouble.keyboard">7.3 &#12461;&#12540;&#12508;&#12540;&#12489;&#12364; XFree86 &#12391;&#21453;&#24540;&#12375;&#12394;&#12356;</a></li><li><a href="#trouble.delete-key">7.4 Back Space &#12461;&#12540;&#12364;&#21205;&#12363;&#12394;&#12356;</a></li><li><a href="#trouble.locale">7.5 "Warning: locale not supported by C library"</a></li></ul></li><li><a href="#tips"><b>8 &#20351;&#29992;&#19978;&#12398; Tips</b></a><ul><li><a href="#tips.terminal-app">8.1 
&#12479;&#12540;&#12511;&#12490;&#12523;.app &#12363;&#12425;&#12398; X11 &#12450;&#12503;&#12522;&#12398;&#36215;&#21205;
</a></li><li><a href="#tips.open">8.2 xterm &#12363;&#12425;&#12398; Aqua &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36215;&#21205;</a></li><li><a href="#tips.copy-n-paste">8.3 &#12467;&#12500;&#12540;&#12392;&#12506;&#12540;&#12473;&#12488;</a></li></ul></li></ul><h2><a name="intro">1 &#12452;&#12531;&#12488;&#12525;&#12480;&#12463;&#12471;&#12519;&#12531;</a></h2>


<h3><a name="intro.def-x11">1.1 What is X11?</a></h3>

<p>
<a href="http://www.x.org/">X Window System</a> Version 11,
&#12354;&#12427;&#12356;&#12399;&#30701;&#12367; X11 &#12392;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#36879;&#36942;&#22411;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#65309;&#12469;&#12540;&#12496;&#24418;&#24335;&#12398;&#30011;&#20687;&#34920;&#31034;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12500;&#12463;&#12475;&#12523;&#12289;&#32218;&#12289;&#12486;&#12461;&#12473;&#12488;&#12289;&#30011;&#20687;&#12394;&#12393;&#30011;&#38754;&#19978;&#12395;&#12434;&#25551;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
X11 &#12399;&#12414;&#12383;&#12289;&#36861;&#21152;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12508;&#12479;&#12531;&#12420;&#12486;&#12461;&#12473;&#12488;&#12501;&#12451;&#12540;&#12523;&#12489;&#12394;&#12393;&#12398;&#12518;&#12540;&#12470;&#12540;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#25551;&#12367;&#12371;&#12392;&#12364;&#23481;&#26131;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
X11 &#12399;&#12289; Unix &#12398;&#19990;&#30028;&#12395;&#12362;&#12369;&#12427;&#12487;&#12501;&#12449;&#12463;&#12488;&#12473;&#12479;&#12531;&#12480;&#12540;&#12489;&#12398;&#12464;&#12521;&#12501;&#12451;&#12483;&#12463;&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;
Linux &#12289; BSD &#12289;&#21830;&#29992; Unix &#12394;&#12393;&#12391;&#20351;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12391;&#12354;&#12427; CDE &#12289; KDE &#12289; GNOME &#12394;&#12393;&#12399;&#12371;&#12398;&#19978;&#12391;&#21205;&#12367;&#12418;&#12398;&#12391;&#12377;&#12290;
</p>

<h3><a name="intro.def-macosx">1.2 Mac OS X &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
<a href="http://www.apple.co.jp/macosx/">Mac OS X</a> &#12399; 
<a href="http://www.apple.co.jp">Apple Computer</a> 
&#12395;&#12424;&#12387;&#12390;&#20316;&#12425;&#12428;&#12383;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
&#12371;&#12398;&#21069;&#36523;&#12391;&#12354;&#12427; NeXTStep &#12420; OpenStel &#12398;&#12424;&#12358;&#12395;&#12289;&#12371;&#12428;&#12399; BSD &#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#12356;&#12427; Unix OS &#12501;&#12449;&#12511;&#12522;&#12540;&#12398;&#19968;&#21729;&#12391;&#12377;&#12290;
&#12375;&#12363;&#12375;&#12289; Mac OS X &#12399;&#29420;&#33258;&#12398;&#30011;&#20687;&#34920;&#31034;&#12471;&#12473;&#12486;&#12512;&#12434;&#26377;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#30011;&#20687;&#12456;&#12531;&#12472;&#12531;&#12399; Quartz &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12390;&#12289;&#12381;&#12398;&#12523;&#12483;&#12463;&#12450;&#12531;&#12489;&#12501;&#12451;&#12540;&#12523;&#12399; Aqua &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20001;&#32773;&#12399;&#21516;&#12376;&#24847;&#21619;&#12391;&#20351;&#12431;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12290;
</p>

<h3><a name="intro.def-darwin">1.3 Darwin &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
<a href="http://OpenDarwin.org/">Darwin</a> &#12399;
Mac OS X &#12363;&#12425;&#20313;&#35336;&#12394;&#37096;&#20998;&#12434;&#33853;&#12392;&#12375;&#12383;&#28961;&#26009;&#29256;&#12391;&#12289;&#23436;&#20840;&#12394;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12364;&#20837;&#25163;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12399; Quartz &#12289; Aqua &#12394;&#12393;&#12420;&#38306;&#36899;&#12486;&#12463;&#12494;&#12525;&#12472;&#12540;&#12399;&#12388;&#12356;&#12390;&#12365;&#12414;&#12379;&#12435;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12486;&#12461;&#12473;&#12488;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#12415;&#12391;&#12377;&#12290;
</p>

<h3><a name="intro.def-xfree86">1.4 What is XFree86?</a></h3>

<p>
<a href="http://www.xfree86.org/">XFree86</a> &#12399;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12391;&#23455;&#35013;&#12375;&#12383; X11 &#12391;&#12377;&#12290;
&#12371;&#12428;&#12399;&#21517;&#21069;&#12364;&#31034;&#12377;&#12424;&#12358;&#12395;&#12289;&#24403;&#21021; Intel x86 PC &#19978;&#12391;&#21205;&#12367;&#12424;&#12358;&#12395;&#38283;&#30330;&#12373;&#12428;&#12414;&#12375;&#12383;&#12364;&#12289;&#29694;&#22312;&#12391;&#12399; OS/2 &#12289; Darwin &#12289; Mac OS X &#12289; Windows &#12394;&#12393;&#22810;&#12367;&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12540;&#12420;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12391;&#21205;&#12363;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>

<h3><a name="intro.def-xtools">1.5 Xtools &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
Xtools &#12399; <a href="http://www.tenon.com/">Tenon Intersystems</a> &#12398;&#35069;&#21697;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12399; XFree86 &#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12383; Mac OS X &#29992;&#12398; X11 &#12398;&#19968;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12377;&#12290;
</p>

<h3><a name="intro.client-server">1.6 &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#12469;&#12540;&#12496;&#12540;</a></h3>

<p>
X11 &#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#65309;&#12469;&#12540;&#12496;&#22411;&#12398;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12540;&#12391;&#27083;&#31689;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#20013;&#22830;&#12398;&#12471;&#12473;&#12486;&#12512;&#12364;&#23455;&#38555;&#12398;&#25551;&#30011;&#12420;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38291;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35519;&#25972;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
X11 &#12434;&#20351;&#12387;&#12390;&#25551;&#30011;&#12434;&#12375;&#12383;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#12469;&#12540;&#12496;&#12395;&#25509;&#32154;&#12375;&#12390;&#20309;&#12434;&#25551;&#30011;&#12377;&#12427;&#12363;&#12434;&#20253;&#12360;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12289; X11 &#12398;&#19990;&#30028;&#12391;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
X11 &#12391;&#12399;&#12469;&#12540;&#12496;&#12392;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#21516;&#12376;&#12510;&#12471;&#12531;&#12391;&#21205;&#12356;&#12390;&#12356;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12399;&#12424;&#12367;&#29992;&#35486;&#12398;&#28151;&#20081;&#12398;&#20803;&#12392;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12527;&#12540;&#12463;&#12473;&#12486;&#12540;&#12471;&#12519;&#12531;&#12392;&#12469;&#12540;&#12496;&#12434;&#20351;&#12387;&#12383;&#29872;&#22659;&#12398;&#22580;&#21512;&#12289; X11 &#12487;&#12451;&#12473;&#12503;&#12524;&#12452;&#12469;&#12540;&#12496;&#12399;&#12527;&#12540;&#12463;&#12473;&#12486;&#12540;&#12471;&#12519;&#12531;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; (X11 &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;) &#12399;&#12469;&#12540;&#12496;&#19978;&#12391;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12391;&#12377;&#12290;
&#12371;&#12371;&#12391;&#12399; "&#12469;&#12540;&#12496;" &#12392;&#12356;&#12358;&#35328;&#33865;&#12399; X11 &#12487;&#12451;&#12473;&#12503;&#12524;&#12452;&#12469;&#12540;&#12496;&#12434;&#25351;&#12375;&#12289;&#25276;&#12375;&#20837;&#12428;&#12398;&#20013;&#12395;&#38560;&#12375;&#12390;&#12354;&#12427;&#12510;&#12471;&#12531;&#12398;&#12371;&#12392;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>

<h3><a name="intro.rootless">1.7 rootless &#12392;&#12399;&#12393;&#12358;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12363;?</a></h3>

<p>
&#32972;&#26223;:
X11 &#12399;&#30011;&#38754;&#12434;&#12454;&#12451;&#12531;&#12489;&#12454;&#12398;&#12495;&#12452;&#12456;&#12521;&#12523;&#12461;&#12540;&#12392;&#35211;&#12394;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#26368;&#19978;&#20301;&#12395;&#12399;&#12473;&#12463;&#12522;&#12540;&#12531;&#12469;&#12452;&#12474;&#12398;&#29305;&#21029;&#12394;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#12354;&#12426;&#12289;&#20182;&#12398;&#20840;&#12390;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12399;&#12371;&#12428;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12399;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#32972;&#26223;&#12418;&#21547;&#12415;&#12289; "root window" &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
&#26412;&#38988;&#12395;&#25147;&#12426;&#12414;&#12375;&#12423;&#12358;:
&#20182;&#12398;&#12464;&#12521;&#12501;&#12451;&#12483;&#12463;&#29872;&#22659;&#12392;&#21516;&#27096;&#12289; X11 &#12399;&#12381;&#12428;&#12384;&#12369;&#12391;&#12473;&#12463;&#12522;&#12540;&#12531;&#12434;&#21344;&#26377;&#12377;&#12427;&#12424;&#12358;&#12395;&#25551;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
Mac OS X &#12391;&#12399;&#12289; Quartz &#12364;&#26082;&#12395;&#12473;&#12463;&#12522;&#12540;&#12531;&#12434;&#21344;&#26377;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;&#20001;&#32773;&#12364;&#21332;&#20685;&#12377;&#12427;&#12424;&#12358;&#12395;&#20462;&#27491;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12394;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p>
<p>
&#12420;&#12426;&#26041;&#12398;&#19968;&#12388;&#12392;&#12375;&#12390;&#12399;&#12289;&#20001;&#32773;&#12434;&#38918;&#12293;&#12395;&#21344;&#26377;&#12373;&#12379;&#12427;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12381;&#12428;&#12382;&#12428;&#12398;&#29872;&#22659;&#12399;&#12289;&#12354;&#12427;&#30636;&#38291;&#12395;&#12399;&#29255;&#26041;&#12384;&#12369;&#12364;&#12473;&#12463;&#12522;&#12540;&#12531;&#12434;&#23436;&#20840;&#12395;&#21344;&#26377;&#12377;&#12427;&#24418;&#12391;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#20999;&#12426;&#26367;&#12360;&#12414;&#12377;&#12290;
&#12371;&#12398;&#26041;&#24335;&#12399;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12420; rooted &#12514;&#12540;&#12489;&#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
rooted &#12392;&#12399;&#12289; X11&#19978;&#12391;&#12289;&#23436;&#20840;&#12395;&#20182;&#12398;&#12471;&#12473;&#12486;&#12512;&#12392;&#21516;&#12376;&#12523;&#12540;&#12488;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#23384;&#22312;&#12377;&#12427;&#12383;&#12417;&#12395;&#12371;&#12358;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
&#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12372;&#12392;&#12395;&#20001;&#32773;&#12398;&#29872;&#22659;&#12434;&#28151;&#22312;&#12373;&#12379;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#20108;&#12388;&#12398;&#12473;&#12463;&#12522;&#12540;&#12531;&#12434;&#20999;&#12426;&#26367;&#12360;&#12427;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12426;&#12289;&#12414;&#12383;&#26082;&#12395; Quartz &#12364;&#32972;&#26223;&#12434;&#31649;&#29702;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289; X11 &#12523;&#12540;&#12488;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#38500;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12358;&#12375;&#12390; (&#30446;&#12395;&#35211;&#12360;&#12427;) &#12523;&#12540;&#12488;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391; "rootless" &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12364; Mac OS X &#19978;&#12391; X11 &#12434;&#20351;&#12358;&#26368;&#36969;&#12394;&#26041;&#27861;&#12391;&#12377;&#12290;
</p>

<h3><a name="intro.wm">1.8 &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
&#12411;&#12392;&#12435;&#12393;&#12398;&#12464;&#12521;&#12501;&#12451;&#12483;&#12463;&#29872;&#22659;&#12395;&#12362;&#12356;&#12390;&#12399;&#12454;&#12451;&#12531;&#12489;&#12454;&#26528;&#12398;&#35211;&#12383;&#30446; (&#12479;&#12452;&#12488;&#12523;&#12496;&#12540;&#12289;&#38281;&#12376;&#12427;&#12508;&#12479;&#12531;) &#12399;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#27770;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
X11 &#12399;&#36949;&#12356;&#12414;&#12377;&#12290;
X11 &#12391;&#12399;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#26528; (&#12414;&#12383;&#12399; " &#35013;&#39166; ") &#12399;&#21029;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12371;&#12428;&#12434;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12392;&#21628;&#12403;&#12414;&#12377;&#12290;
&#22810;&#12367;&#12398;&#28857;&#12391;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#19968;&#12388;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
&#36215;&#21205;&#12377;&#12427;&#20181;&#26041;&#12418;&#12289; X &#12469;&#12540;&#12496;&#12395;&#36890;&#20449;&#12377;&#12427;&#12392;&#12365;&#12398;&#12481;&#12515;&#12531;&#12493;&#12523;&#12418;&#12414;&#12387;&#12383;&#12367;&#19968;&#32210;&#12391;&#12377;&#12290;
</p>
<p>
&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#19968;&#35239;&#12399; <a href="http://www.xwinman.org/">xwinman.org</a>  &#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
&#26377;&#21517;&#12393;&#12371;&#12429;&#12399; <a href="http://www.themes.org/">&#12486;&#12540;&#12510;</a> &#12392;&#21628;&#12400;&#12428;&#12427;&#22806;&#35251;&#12398;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12434;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12523;&#12540;&#12488;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#12398;&#12509;&#12483;&#12503;&#12450;&#12483;&#12503;&#12513;&#12491;&#12517;&#12540;&#12289;&#12489;&#12483;&#12463;&#12289;&#12521;&#12531;&#12481;&#12515;&#8722;&#12394;&#12393;&#12398;&#27231;&#33021;&#12418;&#20633;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
&#22810;&#12367;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12364; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
<a href="http://fink.sourceforge.net/pdb/section.php/x11-wm/">&#19968;&#35239;</a>&#12434;&#12372;&#35239;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="intro.desktop">1.9 Quartz/Aqua &#12420; Gnome, KDE &#12392;&#12399;&#20309;&#12391;&#12377;&#12363;?</a></h3>

<p>
&#12356;&#12378;&#12428;&#12418;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12391;&#12377;&#12290;
&#12371;&#12428;&#20197;&#22806;&#12395;&#12418;&#27810;&#23665;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12399;&#12289;&#32113;&#19968;&#12375;&#12383;&#22806;&#35251;&#12420;&#25805;&#20316;&#24615;&#12398;&#26528;&#32068;&#12415;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#65306;
</p>
<p> &#25551;&#30011;&#12456;&#12531;&#12472;&#12531;: X11
</p>
<p>&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;:
<a href="http://sawmill.sourceforge.net/">sawfish</a>
</p>
<p>&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;: <a href="http://www.gnome.org/">Gnome</a>
</p>
<p>
&#25551;&#30011;&#12487;&#12451;&#12473;&#12503;&#12524;&#12452;&#12456;&#12531;&#12472;&#12531;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12289;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12399;&#20284;&#12383;&#12424;&#12358;&#12394;&#27231;&#33021;&#12364;&#23455;&#35013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12289;&#22659;&#30028;&#32218;&#12399;&#38750;&#24120;&#12395;&#26326;&#26151;&#12391;&#12377;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12392;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12395;&#12424;&#12387;&#12390;&#12399;&#19968;&#32210;&#12395;&#20351;&#12360;&#12394;&#12356;&#32068;&#12415;&#21512;&#12431;&#12379;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
&#22810;&#12367;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#29305;&#23450;&#12398;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#12395;&#32113;&#21512;&#12373;&#12428;&#12383;&#24418;&#12391;&#38283;&#30330;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12383;&#12356;&#12390;&#12356;&#12289;&#12371;&#12428;&#12399;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#29992;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522; (&#12392;&#20302;&#12524;&#12505;&#12523;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;) &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12381;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#27231;&#33021;&#12434;&#25613;&#12394;&#12358;&#12371;&#12392;&#12394;&#12367;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12383;&#12392;&#12360;&#12400;&#12289;&#12356;&#12414;&#12391;&#12418;&#22679;&#21152;&#20013;&#12398; <a href="http://fink.sourceforge.net/pdb/section.php/gnome">GNOME &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; </a> &#12399;&#12289;GNOME&#12364;&#12394;&#12367;&#12392;&#12418;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
&#27531;&#24565;&#12394;&#12371;&#12392;&#12395;&#12289; <a href="http://www.kde.org/">KDE &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</a> &#12391;&#12399;&#12414;&#12384;<a href="http://fink.sourceforge.net/faq/usage-fink.php#kde">&#12381;&#12371;&#12414;&#12391;&#36948;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;</a>&#12290;
</p>

<h2><a name="history">2 &#27508;&#21490;</a></h2>



<p>[&#22823;&#12370;&#12373;&#12394;&#35328;&#33865;&#12434;&#20351;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12375;&#12383;&#12290;
&#12393;&#12358;&#12375;&#12390;&#12418;&#20351;&#12356;&#12383;&#12363;&#12387;&#12383;&#12435;&#12391;&#12377;...]</p>

<h3><a name="history.early">2.1 &#21476;&#20195;</a></h3>

<p>
&#22987;&#12414;&#12426;&#12399;&#28961;&#12384;&#12387;&#12383;&#12290;
 Darwin &#12399;&#36196;&#23376;&#12398;&#27096;&#12391;&#12289; Mac OS X &#12399;&#12414;&#12384;&#38283;&#30330;&#27573;&#38542;&#12384;&#12387;&#12383;&#12290;
&#12393;&#12385;&#12425;&#12395;&#12375;&#12390;&#12418;&#12289; X11 &#12418;&#12394;&#12363;&#12387;&#12383;&#12290;
</p>
<p>
&#12420;&#12364;&#12390; John Carmack &#12364;&#12420;&#12387;&#12390;&#12365;&#12390;&#12289; XFree86 &#12434; Mac OS X &#12469;&#12540;&#12496;&#12395;&#31227;&#26893;&#12375;&#12383;&#12290;
&#21807;&#19968;&#12398; Darwin &#12501;&#12449;&#12511;&#12522;&#12540;&#12398; OS &#12391;&#12354;&#12387;&#12383;&#12290;
&#24460;&#12395;&#12289;&#12371;&#12428;&#12399; Dave Zarzycki &#12395;&#12424;&#12387;&#12390; XFree86 4.0 &#12392; Darwin 1.0 &#12395;&#26356;&#26032;&#12373;&#12428;&#12383;&#12290;
&#12497;&#12483;&#12481;&#12399;  Darwin &#12398; CVS &#12524;&#12509;&#12472;&#12488;&#12522;&#12408;&#12398;&#36947;&#12434;&#35211;&#12356;&#12384;&#12375;&#12289;&#12381;&#12371;&#12391;&#30496;&#12426;&#12395;&#12388;&#12356;&#12383;&#12290;
&#26178;&#12364;&#12367;&#12427;&#12398;&#12434;&#24453;&#12387;&#12390;&#12356;&#12383;&#12398;&#12384;&#12290;
</p>

<h3><a name="history.xonx-forms">2.2 XonX forms</a></h3>

<p>
&#12354;&#12427;&#26228;&#12428;&#12383;&#26085;&#12289; Torrey T. Lyons &#12364;&#12420;&#12387;&#12390;&#12365;&#12390; Darwin &#12497;&#12483;&#12481;&#12395;&#24453;&#12385;&#26395;&#12414;&#12428;&#12390;&#12356;&#12383;&#38525;&#12398;&#30446;&#12434;&#35211;&#12427;&#12371;&#12392;&#12395;&#12394;&#12427;&#12290;
&#24444;&#12399;&#20844;&#24335;&#12398; XFree86 CVS &#12524;&#12509;&#12472;&#12488;&#12522;&#12392;&#12356;&#12358;&#26032;&#12375;&#12356;&#23478;&#12434;&#29992;&#24847;&#12375;&#12383;&#12290;
&#12371;&#12398;&#26178;&#12289; Mac OS X Public Beta &#12392; Darwin 1.2 &#12398;&#38915;&#12391;&#12354;&#12427;&#12290;
XFree86 4.0.2 &#12399; Darwin &#19978;&#12391;&#21205;&#12356;&#12383;&#12364;&#12289; Mac OS X &#19978;&#12391;&#12399;&#12518;&#12540;&#12470;&#12364; Aqua &#12434;&#12525;&#12464;&#12450;&#12454;&#12488;&#12375;&#19968;&#26086;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#31227;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12387;&#12383;&#12290;
&#12381;&#12371;&#12391; Terry &#12399; <a href="http://mrcla.com/XonX/">XonX &#12481;&#12540;&#12512;</a> &#12434;&#32068;&#32340;&#12375;&#12289; XFree86 &#12434; Mac OS X &#12395;&#12418;&#12383;&#12425;&#12377;&#26053;&#12395;&#20986;&#12383;&#12398;&#12384;&#12387;&#12383;&#12290; 
</p>
<p>
&#12371;&#12428;&#12392;&#21516;&#12376;&#38915;&#12289; XFree86 &#12434;&#20803;&#12395; Tenon &#12364; Xtools &#12434;&#12499;&#12523;&#12489;&#12375;&#22987;&#12417;&#12383;&#12398;&#12384;&#12387;&#12383;&#12290;
</p>

<h3><a name="history.root-or-not">2.3 root &#12363; root &#12395;&#12354;&#12425;&#12374;&#12427;&#12363;</a></h3>

<p>
&#30452;&#12368;&#12395;&#12289; XonX &#12481;&#12540;&#12512;&#12399; XFree86 &#12434; Quartz &#12392;&#24179;&#34892;&#12375;&#12390;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12391;&#36208;&#12425;&#12379;&#12427;&#12371;&#12392;&#12395;&#25104;&#21151;&#12375;&#12383;&#12290;
&#12371;&#12428;&#12399;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473;&#12392;&#12375;&#12390;&#20882;&#38522;&#22909;&#12365;&#12394;&#12518;&#12540;&#12470;&#12395;&#25552;&#20379;&#12373;&#12428;&#12383;&#12290;
&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12383;&#21517;&#31216;&#12399; XFree86-Aqua &#12354;&#12427;&#12356;&#12399;&#30701;&#12367; XAqua &#12391;&#12354;&#12387;&#12383;&#12290;
Torrey &#12364;&#12522;&#12540;&#12480;&#12540;&#12391;&#12354;&#12387;&#12383;&#12383;&#12417;&#12289;&#22793;&#26356;&#12399;&#30452;&#25509; XFree86 &#12398; CVS &#12524;&#12509;&#12472;&#12488;&#12522;&#12395;&#21453;&#26144;&#12373;&#12428;&#12289; 4.1.0 &#12395;&#21521;&#12363;&#12387;&#12383;&#12398;&#12391;&#12354;&#12387;&#12383;&#12290;
</p>
<p>
&#24403;&#21021;&#12289; Quartz &#12392;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399; Xmaster.app &#12392;&#21628;&#12400;&#12428;&#12427; (&#24403;&#21021;&#12399; Carbon &#12391;&#26360;&#12363;&#12428;&#12289;&#24460;&#12395; Cocoa &#21270;&#12373;&#12428;&#12383;) &#23567;&#12373;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#34892;&#12387;&#12390;&#12356;&#12383;&#12290;
&#24460;&#12395;&#12467;&#12540;&#12489;&#12399; X &#12469;&#12540;&#12496;&#12395;&#32113;&#21512;&#12373;&#12428;&#12289; XDarwin.app &#12364;&#35477;&#29983;&#12375;&#12383;&#12290;
&#12371;&#12398;&#38915;&#12289;&#20849;&#26377;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12469;&#12509;&#12540;&#12488;&#12364;&#36861;&#21152;&#12373;&#12428;&#12383; (Tenon &#12399;&#12496;&#12452;&#12490;&#12522;&#20114;&#25563;&#24615;&#12398;&#12383;&#12417;&#12371;&#12398;&#26041;&#24335;&#12395;&#12377;&#12427;&#12424;&#12358;&#12395;&#35500;&#24471;&#12373;&#12428;&#12383;) &#12290; 
&#12414;&#12383;&#12289; (Carbon API &#12434;&#20351;&#12387;&#12383;) &#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12418;&#36914;&#12435;&#12391;&#12356;&#12383;&#12398;&#12384;&#12364;&#12289; XFree86 4.1.0 &#12395;&#12399;&#23569;&#12375;&#36933;&#12363;&#12387;&#12383;&#12290;
&#12371;&#12358;&#12375;&#12390;&#12523;&#12540;&#12488;&#12524;&#12473;&#12497;&#12483;&#12481;&#12399;&#33258;&#30001;&#12395;&#12493;&#12483;&#12488;&#19978;&#12434;&#35299;&#12365;&#25918;&#12383;&#12428;&#12383;&#12398;&#12384;&#12387;&#12383;&#12290;
XFree86 4.1.0 &#12364;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12391;&#30331;&#22580;&#12375;&#12383;&#24460;&#12289;&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12398;&#20316;&#26989;&#12399;&#32154;&#12365;&#12289; Cocoa API &#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12290;
&#23455;&#39443;&#30340;&#12394;&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12364; XFree86 &#12398; CVS &#12524;&#12509;&#12472;&#12488;&#12522;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12383;&#12290;
</p>
<p>
&#12371;&#12398;&#38915;&#12289; Apple &#12399; Mac OS X 10.0 &#12392; Darwin 1.3 &#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12289; Tenon &#12399; Xtools 1.0 &#12434;&#25968;&#36913;&#38291;&#24460;&#12395;&#12522;&#12522;&#12540;&#12473;&#12375;&#12383;&#12290;
</p>
<p>
&#38283;&#30330;&#12399;&#24341;&#12365;&#32154;&#12365; &#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12395; XFree86 &#12434;&#32113;&#21512;&#12377;&#12427;&#12424;&#12358;&#20685;&#12365;&#12363;&#12369;&#12289; 2002 &#24180; 1 &#26376; &#12398; XFree86 4.2.0 &#12395;&#12399; Darwin/Mac OS X &#12399;&#23436;&#20840;&#12395; XFree86 &#12487;&#12451;&#12473;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#32113;&#21512;&#12373;&#12428;&#12383;&#12290;
</p>

<h2><a name="inst-xfree86">3 XFree86 &#12398;&#20837;&#25163;&#12392;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h2>


<h3><a name="inst-xfree86.fink">3.1 Fink &#12434;&#20351;&#12387;&#12383;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
Fink &#12399;&#12393;&#12398;&#12424;&#12358;&#12394; X11 &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#21839;&#38988;&#12394;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12364;&#12289;&#12414;&#12383;&#29420;&#33258;&#12398; XFree86
&#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">fink install ...</tt> &#12392;&#20837;&#21147;&#12377;&#12428;&#12400;&#12289;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#12467;&#12531;&#12497;&#12452;&#12523;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;
&#12418;&#12375; <tt style="white-space: nowrap;">apt-get install ...</tt> &#12363; <tt style="white-space: nowrap;">dselect</tt> &#12501;&#12525;&#12531;&#12488;&#12456;&#12531;&#12489;&#12434;&#20351;&#12387;&#12383;&#12425;&#12289;
XFree86 &#12398;&#20844;&#24335;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#20284;&#12383;&#12467;&#12531;&#12497;&#12452;&#12523;&#28168;&#12415;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
<tt style="white-space: nowrap;">xfree86-base</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289; XDarwin &#12469;&#12540;&#12496;&#12434;&#38500;&#12367;&#20840;&#12390;&#12398; XFree86 4.2.1.1 (10.1 &#12518;&#12540;&#12470;&#12540;&#12399; 4.2.0) &#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">xfree86-rootless</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;&#27161;&#28310; XFree 4.2.1.1 &#23433;&#23450;&#26495;&#12398;&#12469;&#12540;&#12496;&#12391;&#12289;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12392;&#12523;&#12540;&#12488;&#12524;&#12473;&#12395;&#23550;&#24540;&#12289; OpenGL &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
(&#20197;&#21069;&#12399; Fink &#12395;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12398;&#12415;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12427; <tt style="white-space: nowrap;">xfree86-server</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;&#20170;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;)
&#21029;&#12398;&#36984;&#25246;&#32930;&#12392;&#12375;&#12390;&#12289;&#33258;&#20998;&#12391;&#12469;&#12540;&#12496;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#19979;&#35352;&#12395;&#35443;&#12375;&#12367;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12371;&#12398;&#22580;&#21512;&#12399;
<tt style="white-space: nowrap;">xfree86-base</tt> &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12364;&#12289;&#25163;&#21205;&#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12469;&#12540;&#12496;&#12399; Fink &#12364;&#19978;&#26360;&#12365;&#12377;&#12427;&#12362;&#12381;&#12428;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#29694;&#22312;&#12398;&#26368;&#26032;&#23433;&#23450;&#26495;&#12391;&#12354;&#12427;<tt style="white-space: nowrap;"> xfree86-base</tt> (4.2.1.1-3) &#12399;&#12499;&#12523;&#12489;&#12503;&#12525;&#12475;&#12473;&#20013;&#12395; <tt style="white-space: nowrap;">xfree86-rootless</tt>, 
<tt style="white-space: nowrap;">xfree86-base-shlibs</tt>,  <tt style="white-space: nowrap;">xfree86-rootless-shlibs</tt> &#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
&#12371;&#12398;&#65300;&#12388;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399; XFree86 &#12434;&#21205;&#20316;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12391;&#12377;&#12290;
</p>
<p>
<tt style="white-space: nowrap;"> xfree86-base-threaded</tt> &#12392; <tt style="white-space: nowrap;">xfree86-rootless-threaded</tt> 
&#12398;&#20108;&#12388;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12289;&#26412;&#36074;&#30340;&#12395;&#12399;&#21516;&#12376;&#12418;&#12398;&#12391;&#12377;&#12364;&#12289;&#24460;&#32773;&#12399;&#12473;&#12524;&#12483;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#20462;&#27491;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
&#29694;&#22312;&#12473;&#12524;&#12483;&#12489;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;<tt style="white-space: nowrap;">xine</tt> &#12394;&#12393;&#23569;&#25968;&#12391;&#12377;&#12290;
</p>
<p>
XFree86 4.2.1.1 (unthreaded) &#12399;&#12289;10.2 &#12392; Fink &#12395;&#12362;&#12369;&#12427;&#23433;&#23450;&#29256;&#12392;&#12356;&#12358;&#20301;&#32622;&#12389;&#12369;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
XFree86 4.3.0 &#12418;&#20837;&#25163;&#21487;&#33021;&#12391;&#12377;&#12364;&#12289;&#23455;&#39443;&#30340;&#12391;&#12289;&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#22519;&#31558;&#26178;&#28857;&#12391;&#12399; unstable &#12484;&#12522;&#12540;&#12395;&#12375;&#12363;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12473;&#12524;&#12483;&#12489;&#12434;&#32068;&#12415;&#36796;&#12435;&#12391;&#12356;&#12390;&#12289; 4.2.1.1 &#12424;&#12426;&#36895;&#12367;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399; <tt style="white-space: nowrap;">xfree86</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12363;&#12425;&#12289; -base &#12392; -rootless &#12398;&#21306;&#20998;&#12399;&#12394;&#12367;&#12394;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;&#12521;&#12452;&#12502;&#12521;&#12522;&#12364; <tt style="white-space: nowrap;">xfree86-shlibs</tt> &#12392;&#20998;&#12363;&#12428;&#12414;&#12375;&#12383;&#12290;
4.3 &#29992;&#12395;&#12496;&#12452;&#12490;&#12522;&#12434;&#12499;&#12523;&#12489;&#12375;&#12383;&#22580;&#21512;&#12289; 4.2.1.1 &#12420; Apple X11 &#12391;&#12399;&#21205;&#20316;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
<b>10.3 &#12398;&#20351;&#29992;:</b>  
&#12496;&#12540;&#12472;&#12519;&#12531; 4.3.99.16-2 &#20197;&#38477;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12399; XFree86-4.4 &#12398;&#12503;&#12524;&#12522;&#12522;&#12540;&#12473;&#12391;&#12377;&#12290;
&#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12497;&#12483;&#12465;&#12540;&#12472;&#35443;&#32048;&#12434;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356; (&#20363; <tt style="white-space: nowrap;">sudo apt-get update</tt>) &#12290;
</p>

<h3><a name="inst-xfree86.apple-binary">3.2 Apple &#12398;&#12496;&#12452;&#12490;&#12522;</a></h3>

<p>
2003&#24180;1&#26376;7&#26085;&#12289; Apple &#12399;<a href="http://apple.co.jp/macosx/features/x11/index.html">XFree86-4.2 &#12505;&#12540;&#12473;&#12398; X11</a> &#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12414;&#12375;&#12383;&#12290;
&#12371;&#12428;&#12399; Quart &#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12456;&#12531;&#12472;&#12531;&#12420;&#39640;&#36895;&#21270; OpenGL &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;2003&#24180;2&#26376;10&#26085;&#12395;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12289;&#27231;&#33021;&#36861;&#21152;&#12392;&#12496;&#12464;&#20462;&#27491;&#12364;&#12394;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
&#65299;&#22238;&#30446;&#12398;&#12522;&#12522;&#12540;&#12473; (Beta 3) &#12399; 2003&#24180;3&#26376;17&#26085;&#12395;&#34892;&#12431;&#12428;&#12289;&#12373;&#12425;&#12395;&#27231;&#33021;&#36861;&#21152;&#12392;&#12496;&#12464;&#20462;&#27491;&#12364;&#12394;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399; Jaguar &#12391;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<p>
2003&#24180;10&#26376;24&#26085;&#12289; Apple &#12399; Panther (10.3) &#12434;&#12522;&#12522;&#12540;&#12473;&#12375;&#12414;&#12375;&#12383;&#12290;
&#12371;&#12428;&#12395;&#12399; X11 &#12364;&#21516;&#26801;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399; XFree86-4.3 &#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;
</p>
<p>
&#12450;&#12483;&#12503;&#12523;&#12398;&#12496;&#12452;&#12490;&#12522;&#12434;&#20351;&#12358;&#12395;&#12399;&#12289; <b>X11 User</b> &#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12289;Fink &#12398; <a href="http://fink.sourceforge.net/doc/users-guide/upgrade.php">update</a> &#12418;&#34892;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
<tt style="white-space: nowrap;">fink-0.16.2</tt> &#12391;&#12399; <b>X11 SDK</b> &#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#24517;&#35201;&#12391;&#12377;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#24460;&#12289; Fink &#12399; <tt style="white-space: nowrap;">system-xfree86</tt> &#12496;&#12540;&#12481;&#12515;&#12523;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
<tt style="white-space: nowrap;">fink-0.17.0</tt> &#20197;&#38477;&#12399;&#12289; X11 SDK &#12399;&#12477;&#12540;&#12473;&#12363;&#12425;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#22580;&#21512;&#12289; SDK &#12364;&#12394;&#12367;&#12390;&#12418; <tt style="white-space: nowrap;">system-xfree86</tt> &#12496;&#12540;&#12481;&#12515;&#12523;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
SDK &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289; <tt style="white-space: nowrap;">system-xfree86-shlibs</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12392; <tt style="white-space: nowrap;">system-xfree86-dev</tt> &#12364;&#36861;&#21152;&#12373;&#12428;&#12289;&#12381;&#12428;&#12382;&#12428;&#12521;&#12452;&#12502;&#12521;&#12522;&#12392;&#12504;&#12483;&#12480;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
XFree86 &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;&#26082;&#12395;&#12354;&#12427;&#22580;&#21512;&#12289; Fink &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12363;&#12393;&#12358;&#12363;&#12395;&#38306;&#12431;&#12425;&#12378;
<a href="#inst-xfree86.switching-x11">X11 &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12409;&#12388;&#12398;&#12418;&#12398;&#12395;&#20999;&#12426;&#26367;&#12360;&#12427;&#26041;&#27861;</a>
&#12434;&#21442;&#29031;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12371;&#12398;&#22580;&#21512;&#12289;&#12414;&#12378;&#26368;&#21021;&#12395;&#26082;&#23384;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#21066;&#38500;&#12375;&#12390;&#12363;&#12425; Apple X11 (&#12362;&#12424;&#12403;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390; X11 SDK) &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
Apple X11 &#20351;&#29992;&#19978;&#12398;&#27880;&#24847;:
</p>
<ul>
<li>
<p>
<tt style="white-space: nowrap;">autocutsel</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#19981;&#35201;&#12391;&#12377;&#12290;
&#12418;&#12375; X11 &#12391;&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#28961;&#21177;&#12395;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
Apple X11 &#12399; <tt style="white-space: nowrap;">~/.xinitrc</tt> &#12501;&#12449;&#12452;&#12523;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
Quartz &#12434;&#23436;&#20840;&#12395;&#29983;&#12363;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12395; <tt style="white-space: nowrap;">/usr/X11R6/bin/quartz-wm</tt> &#12434;&#20351;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">~/.xinitrc</tt> &#12434;&#32232;&#38598;&#12377;&#12427;&#12363;&#12289;&#23436;&#20840;&#12395;&#21066;&#38500;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>  
<p>
&#20182;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#20351;&#12356;&#12383;&#12356;&#12369;&#12428;&#12393;&#12459;&#12483;&#12488;&#12450;&#12531;&#12489;&#12506;&#12540;&#12473;&#12488;&#12418;&#20351;&#12356;&#12383;&#12356;&#22580;&#21512;&#12289;&#20197;&#19979;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#19979;&#12373;&#12356;:
</p>
<pre>/usr/X11R6/bin/quartz-wm --only-proxy &amp;
exec /sw/bin/fvwm2</pre>
<p>
&#12418;&#12385;&#12429;&#12435;&#12289; <tt style="white-space: nowrap;">startkde</tt> &#12398;&#12424;&#12358;&#12394;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#36215;&#21205;&#12418;&#26360;&#12367;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
<tt style="white-space: nowrap;">quartz-wm</tt> &#12399; Gnome/KDE &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12498;&#12531;&#12488;&#27231;&#33021;&#12434;&#23436;&#20840;&#12395;&#12399;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#28961;&#39364;&#12394;&#12487;&#12467;&#12524;&#12540;&#12471;&#12519;&#12531;&#12434;&#12373;&#12428;&#12383;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#35211;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>
Apple X11 &#12399; Fink &#12398;&#29872;&#22659;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#35469;&#35672;&#12375;&#12414;&#12379;&#12435;&#12290;
Fink &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#36215;&#21205;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531; (&#20363; &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;, gnome-session, &#12381;&#12398;&#20182;&#12398;<tt style="white-space: nowrap;">/sw/bin</tt> &#20869;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;) 
&#12434;&#21628;&#12403;&#20986;&#12377;&#12395;&#12399;&#12289; <tt style="white-space: nowrap;">~/.xinitrc</tt> &#12398;&#19978;&#12398;&#26041; ("<tt style="white-space: nowrap;">#!/bin/sh</tt>" &#12424;&#12426;&#19979;&#12289;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12424;&#12426;&#19978;) &#12395;&#20197;&#19979;&#12398;&#34892;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;;
</p>
<pre> . /sw/bin/init.sh
</pre>
<p>
&#12371;&#12428;&#12395;&#12424;&#12426; Fink &#29872;&#22659;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;
&#27880;&#35352;: <tt style="white-space: nowrap;">init.sh</tt> &#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12399; <tt style="white-space: nowrap;">tcsh</tt> &#12391;&#12399;&#12394;&#12367; <tt style="white-space: nowrap;">sh</tt> &#12395;&#12424;&#12387;&#12390;&#23455;&#34892;&#12373;&#12428;&#12427;&#12398;&#12391; <tt style="white-space: nowrap;">init.csh</tt> &#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;
</p>
</li>
<li>
<p>
Fink &#12484;&#12522;&#12540;&#19979;&#12395;&#12354;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#21628;&#12403;&#20986;&#12377;&#12392;&#12365;&#12395;&#12289;&#12381;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#21628;&#12406;&#12424;&#12358;&#12394;&#12418;&#12398;&#12398;&#22580;&#21512;&#12289;&#29305;&#21029;&#12394;&#20966;&#32622;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
&#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289;&#12501;&#12523;&#12497;&#12473;&#12434;&#36861;&#21152;&#12377;&#12427;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;&#20363;&#12360;&#12400;
</p>
<pre>/sw/bin/emacs</pre>
<p>&#12391;&#12399;&#12394;&#12367;&#12289; bash &#12391;&#12354;&#12428;&#12400;:</p>
<pre>. /sw/bin/init.sh ; emacs</pre>
<p>tcsh &#12391;&#12354;&#12428;&#12400;:</p>
<pre>source /sw/bin/init.sh ; emacs</pre>
<p>
&#12371;&#12428;&#12395;&#12424;&#12426; PATH &#24773;&#22577;&#12364;&#27491;&#12375;&#12367;&#20253;&#12431;&#12426;&#12414;&#12377;&#12290;
Fink &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12394;&#12425;&#12289;&#12393;&#12428;&#12391;&#12418;&#12371;&#12398;&#26041;&#27861;&#12364;&#20351;&#12360;&#12414;&#12377;&#12290;
</p>
</li>
<li>
<p>&#12418;&#12375; Apple X11 &#29992;&#12395;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12456;&#12521;&#12540;&#12364;&#20986;&#12383;&#22580;&#21512;:</p>
<pre>ld: err.o illegal reference to symbol: _XSetIOErrorHandler 
defined in indirectly referenced dynamic library 
/usr/X11R6/lib/libX11.6.dylib</pre>
<p>
&#12522;&#12531;&#12463;&#26178;&#12395; <tt style="white-space: nowrap;">-lX11</tt> &#12364;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#30906;&#35469;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35373;&#23450;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#30906;&#35469;&#12375;&#12289;&#12371;&#12398;&#24341;&#25968;&#12398;&#36861;&#21152;&#26041;&#27861;&#12434;&#35519;&#12409;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
<li>
<p>
&#12418;&#12375;&#20197;&#21069;&#12395; <tt style="white-space: nowrap;">xfree86</tt> &#12434;&#20351;&#12387;&#12390;&#12356;&#12390;&#12289; Apple X11 (10.2.x &#12414;&#12383;&#12399; 10.3.x) &#12395;&#20999;&#12426;&#26367;&#12360;&#12383;&#22580;&#21512;&#12289;
&#12496;&#12452;&#12490;&#12522;&#20114;&#25563;&#12391;&#12399;&#12394;&#12356;&#12398;&#12391; <tt style="white-space: nowrap;">xfree86</tt> &#29992;&#12395;&#12499;&#12523;&#12489;&#12375;&#12383;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12499;&#12523;&#12489;&#12375;&#30452;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
</li>
</ul>

<h3><a name="inst-xfree86.official-binary">3.3 &#20844;&#24335;&#12496;&#12452;&#12490;&#12522;</a></h3>

<p>
XFree86 &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12395;&#12399;&#20844;&#24335;&#12398; Xfree86 4.2.0 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12289;&#12497;&#12483;&#12481;&#12395;&#12424;&#12426; 4.2.1.1 &#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399; <a href="http://www.xfree86.org/MIRRORS.shtml">XFree86 &#12511;&#12521;&#12540;</a> &#20869;&#12398;
<tt style="white-space: nowrap;">4.2.0/binaries/Darwin-ppc-5.x</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">Xprog.tgz</tt> &#12392; <tt style="white-space: nowrap;">Xquartz.tgz</tt> &#12399;&#12289;&#12383;&#12392;&#12360;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12392;&#26360;&#12363;&#12428;&#12390;&#12354;&#12387;&#12390;&#12418;&#24536;&#12428;&#12378;&#12395;&#20837;&#25163;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12418;&#12375;&#20309;&#12364;&#24517;&#35201;&#12394;&#12501;&#12449;&#12452;&#12523;&#12363;&#12431;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12372;&#12392;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
<tt style="white-space: nowrap;">Xinstall.sh</tt> &#12473;&#12463;&#12522;&#12503;&#12488;&#12434; root &#12391;&#23455;&#34892;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
(&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#21069;&#12395; <a href="http://www.xfree86.org/4.2.0/Install.html">official instructions</a> &#12434;&#35501;&#12416;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;)
&#12414;&#12383;&#12289; XonX &#12395;&#12424;&#12427;<a href="http://prdownloads.sourceforge.net/xonx/XInstall_10.1.sit?download">&#12496;&#12452;&#12490;&#12522;</a>&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#21516;&#12376;&#12477;&#12540;&#12473;&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12418;&#12387;&#12392;&#31777;&#21336;&#12391;&#12377;&#12290;
&#12393;&#12385;&#12425;&#12398;&#22580;&#21512;&#12391;&#12418;&#12289;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12289;&#35299;&#20941;&#24460;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12390;&#19979;&#12373;&#12356;:
</p>
<ol>
<li>10.1 &#12398;&#22580;&#21512;: <a href="http://prdownloads.sourceforge.net/xonx/XFree86_4.2.0.1-10.1.zip?download">4.2.0 -&gt; 4.2.0.1 &#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a>.  
10.2 &#12398;&#22580;&#21512;:  <a href="http://prdownloads.sourceforge.net/xonx/XFree86_4.2.0.1-10.2.zip?download">4.2.0 -&gt; 4.2.0.1 &#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a>
</li>
<li>10.1 &#12392; 10.2:  <a href="http://prdownloads.sourceforge.net/xonx/XFree86_4.2.1.1.zip?download">4.2.0.1 -&gt; 4.2.1.1 &#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;</a>
</li>
</ol>
<p>
&#20844;&#24335;&#12398; XFree86 4.3.0 &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12418; <a href="http://www.xfree86.org/MIRRORS.shtml">XFree86 &#12511;&#12521;&#12540;</a>
&#12398; <tt style="white-space: nowrap;">4.3.0/binaries/Darwin-ppc-6.x</tt> &#20869;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">Xprog.tgz</tt> &#12392; <tt style="white-space: nowrap;">Xquartz.tgz</tt> &#12399;&#12289;&#12383;&#12392;&#12360;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12392;&#26360;&#12363;&#12428;&#12390;&#12354;&#12387;&#12390;&#12418;&#24536;&#12428;&#12378;&#12395;&#20837;&#25163;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12418;&#12375;&#20309;&#12364;&#24517;&#35201;&#12394;&#12501;&#12449;&#12452;&#12523;&#12363;&#12431;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12372;&#12392;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
<tt style="white-space: nowrap;">Xinstall.sh</tt> &#12473;&#12463;&#12522;&#12503;&#12488;&#12434; root &#12391;&#23455;&#34892;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">Xinstall.sh</tt> &#12473;&#12463;&#12522;&#12503;&#12488;&#12434; root &#12391;&#23455;&#34892;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
(&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#21069;&#12395; <a href="http://www.xfree86.org/4.2.0/Install.html">official instructions</a> &#12434;&#35501;&#12416;&#12392;&#12356;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;)
</p>
<p>
&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#12418;&#12289;&#12371;&#12428;&#12391; Mac OS X &#19978;&#12391;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12392;&#12523;&#12540;&#12488;&#12524;&#12473;&#12398; XFree86 &#12364;&#20837;&#12426;&#12414;&#12375;&#12383;&#12290;
</p>

<h3><a name="inst-xfree86.official-source">3.4 &#20844;&#24335;&#12477;&#12540;&#12473;</a></h3>

<p>
&#12418;&#12375;&#26178;&#38291;&#12364;&#35377;&#12379;&#12400;&#12289; XFree86 4.2.0 &#12399;&#12477;&#12540;&#12473;&#12363;&#12425;&#12499;&#12523;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12477;&#12540;&#12473;&#12399; <a href="http://www.xfree86.org/MIRRORS.shtml">XFree86 &#12511;&#12521;&#12540;</a> &#12398; <tt style="white-space: nowrap;">4.2.0/source</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12395;&#12354;&#12426;&#12414;&#12377;&#12398;&#12391;
<tt style="white-space: nowrap;">X420src-#.tgz</tt> &#12398;&#65299;&#12388;&#12398; tarball &#12434;&#21516;&#12376;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12391;&#21462;&#24471;&#12539;&#35299;&#20941;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
XFree86 &#12477;&#12540;&#12473;&#12484;&#12522;&#12540;&#12395;&#12354;&#12427; <tt style="white-space: nowrap;">config/cf/host.def</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#12510;&#12463;&#12525;&#23450;&#32681;&#12434;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12499;&#12523;&#12489;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12391;&#12365;&#12414;&#12377;&#12290;
(&#27880;&#35352;: #ifndef &#12481;&#12455;&#12483;&#12463;&#12364;&#12373;&#12428;&#12390;&#12356;&#12427;&#12510;&#12463;&#12525;&#12384;&#12369;&#12364;&#12289; host.def &#12391;&#19978;&#26360;&#12365;&#12391;&#12365;&#12427;&#12510;&#12463;&#12525;&#12391;&#12377;&#12290;)
</p>
<p>
&#35373;&#23450;&#12434;&#32066;&#20102;&#12375;&#12383;&#12425;&#12289;&#20197;&#19979;&#12398;&#12467;&#12510;&#12531;&#12489;&#12391; XFree86 &#12434;&#12467;&#12531;&#12497;&#12452;&#12523;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
</p>
<pre>make World
sudo make install install.man</pre>
<p>4.2.1.1 &#12395;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289; <a href="#inst-xfree86.official-binary">&#20844;&#24335;&#12496;&#12452;&#12490;&#12522;</a> &#31680;&#12398;&#35299;&#35500;&#12434;&#21442;&#29031;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;</p>
<p>
4.3.0 &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#19978;&#36848;&#12398; "2" &#12398;&#12392;&#12371;&#12429;&#12434; "3" &#12395;&#22793;&#12360;&#12390;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12383;&#12384;&#12375;&#12289;4.2.1.1 &#12408;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12399;&#28961;&#35222;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#20844;&#24335;&#12496;&#12452;&#12490;&#12522;&#12392;&#21516;&#27096;&#12289;&#12371;&#12428;&#12391; Mac OS X &#12391;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12392;&#12523;&#12540;&#12488;&#12524;&#12473;&#12398; XFree86 &#12392;&#12469;&#12540;&#12496;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
</p>

<h3><a name="inst-xfree86.latest-cvs">3.5 &#26368;&#26032;&#12398;&#38283;&#30330;&#29992;&#12477;&#12540;&#12473;</a></h3>

<p>
&#12418;&#12375;&#26178;&#38291;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;&#22259;&#22826;&#12356;&#31070;&#32076;&#12418;&#12354;&#12427;&#12424;&#12358;&#12391;&#12375;&#12383;&#12425;&#12289;&#26368;&#26032;&#12398;&#38283;&#30330;&#29256;&#12398; XFree86 &#12434;&#20844;&#38283; CVS &#12524;&#12509;&#12472;&#12488;&#12522;&#12363;&#12425;&#25163;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12467;&#12540;&#12489;&#12399;&#24120;&#12395;&#38283;&#30330;&#20013;&#12391;&#12377;&#12398;&#12391;&#12289;&#20170;&#26085;&#25163;&#12395;&#20837;&#12427;&#12418;&#12398;&#12392;&#26152;&#26085;&#25163;&#12395;&#20837;&#12428;&#12383;&#12418;&#12398;&#12399;&#36949;&#12358;&#12418;&#12398;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289; <a href="http://www.xfree86.org/cvs/">XFree86 CVS</a> &#12398;&#35299;&#35500;&#12395;&#24467;&#12356;&#12289; <tt style="white-space: nowrap;">xc</tt> &#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
&#12354;&#12392;&#12399;&#19978;&#36848;&#12398;&#12477;&#12540;&#12473;&#12363;&#12425;&#12398;&#12499;&#12523;&#12489;&#12395;&#24467;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="inst-xfree86.xonx-bin">3.6 XonX &#12496;&#12452;&#12490;&#12522;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473; (XAqua, XDarwin)</a></h3>

<p>
4.1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#20197;&#21069;&#12395;&#12289; XonX &#12481;&#12540;&#12512;&#12399; XAqua &#12392;&#12356;&#12358;&#12496;&#12452;&#12490;&#12522;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473;&#12434;&#20986;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12356;&#12378;&#12428;&#12418;&#21476;&#12356;&#12398;&#12391;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
XFree86 &#12398;&#20027;&#27969; CVS &#12395;&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12364;&#23566;&#20837;&#12373;&#12428;&#12390;&#20197;&#26469; (4.1.0 &#12398;&#12522;&#12522;&#12540;&#12473;&#24460;) &#12289;
XonX &#12481;&#12540;&#12512;&#12399;&#20877;&#12403;&#12496;&#12452;&#12490;&#12522;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473;&#12434;&#20986;&#12375;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399; XDarwin &#12392;&#12356;&#12358;&#21517;&#31216;&#12391;&#12377;&#12290;
&#29694;&#22312;&#12391;&#12399; XDarwin &#12399; 4.2.0 &#12392;&#19968;&#32210;&#12395;&#12522;&#12522;&#12540;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
<a href="http://www.mrcla.com/XonX/">XonX &#12454;&#12455;&#12502;&#12506;&#12540;&#12472;</a> &#12395;&#12399; 4.2.0 &#20197;&#38477;&#12398; XDarwin 
&#12398;&#12486;&#12473;&#12488;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12356;&#12378;&#12428;&#20986;&#12377;&#12392;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20170;&#12398;&#12392;&#12371;&#12429;&#20986;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12399;&#12362;&#12381;&#12425;&#12367; 4.2.0 (&#20197;&#38477;) &#12398;&#19978;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;
</p>

<h3><a name="inst-xfree86.macgimp">3.7 MacGimp</a></h3>

<p>
MacGimp &#12398;&#20154;&#12293;&#12395;&#12424;&#12387;&#12390; 2001&#24180;&#12395;&#20316;&#12425;&#12428;&#12383;&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12395;&#12399; XFree86 &#12399;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
(XFree86 &#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12399;&#26360;&#12365;&#25563;&#12360;&#12425;&#12428;&#12390;&#12375;&#12414;&#12358;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;)
</p>
<p>
<a href="http://www.macgimp.com/">MacGimp, Inc.</a> &#12398; CD &#12395;&#12399; XFree86 &#12364;&#20837;&#12387;&#12390;&#12356;&#12427;&#12392;&#35328;&#12431;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12393;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#20837;&#12387;&#12390;&#12356;&#12427;&#12363;&#12399;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12362;&#12381;&#12425;&#12367;&#12399; 4.0.3 &#12392; 4.1.0, &#38283;&#30330;&#20013;&#12394;&#12393;&#12398;&#12511;&#12483;&#12463;&#12473;&#12384;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;
&#12469;&#12540;&#12496;&#12399; 4.1.0 &#20197;&#21069;&#12398;&#12497;&#12483;&#12481;&#12395;&#12424;&#12427;&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>

<h3><a name="inst-xfree86.rootless">3.8 &#12493;&#12483;&#12488;&#19978;&#12398;&#12523;&#12540;&#12488;&#12524;&#12473;&#12469;&#12540;&#12496;</a></h3>

<p>
&#12493;&#12483;&#12488;&#19978;&#12395;&#12399;&#12523;&#12540;&#12488;&#12524;&#12473;&#12469;&#12540;&#12496;&#12398;&#12496;&#12452;&#12490;&#12522;&#12364;&#12424;&#12367;&#36578;&#12364;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20844;&#24335;&#12398; 4.2.0 &#12496;&#12452;&#12490;&#12522;&#12364;&#20986;&#12383;&#29694;&#22312;&#12289;&#12371;&#12428;&#12399;&#22909;&#12414;&#12375;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
</p>

<h3><a name="inst-xfree86.switching-x11">3.9 X11 &#12398;&#21066;&#38500;</a></h3>

<p>
&#20197;&#21069;&#12395; Fink &#12391; XFree86 &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#21066;&#38500;&#12420;&#20182;&#12398;&#12418;&#12398;&#12395;&#22793;&#12360;&#12383;&#12356;&#22580;&#21512;&#12398;&#26041;&#27861;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;
dpkg &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#12381;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12383;&#12417;&#12289;&#24375;&#21046;&#30340;&#12395;&#21476;&#12356;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#21066;&#38500;&#12375;&#12289;&#26032;&#12375;&#12356;&#12418;&#12398;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
&#12371;&#12428;&#12395;&#12399;&#20108;&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;:
</p>
<ol>
<li>
<p>FinkCommander &#12434;&#20351;&#12358;</p>
<p>
<a href="http://finkcommander.sourceforge.net/">FinkCommander</a> &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; force removal &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;&#12289; <tt style="white-space: nowrap;">xfree86-rootless</tt> &#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12390;&#12473;&#12524;&#12483;&#12489;&#29256;&#12395;&#22793;&#12360;&#12383;&#12356;&#22580;&#21512;&#12289;
<tt style="white-space: nowrap;">xfree86-rootless</tt>, <tt style="white-space: nowrap;">xfree86-rootless-shlibs</tt>, 
<tt style="white-space: nowrap;">xfree86-base</tt>, <tt style="white-space: nowrap;">xfree86-base-shlibs</tt> &#12434;&#36984;&#25246;&#12375;&#12390;:
</p>
<pre>Source -&gt; Force Remove</pre>
</li>
<li>
<p>&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425;&#25163;&#21205;&#12391;&#34892;&#12358;</p>
<p>
&#25163;&#21205;&#12391;&#34892;&#12358;&#22580;&#21512;&#12289; <tt style="white-space: nowrap;">dpkg</tt> &#12434; --force-depends &#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12388;&#12369;&#12390;&#23455;&#34892;&#12375;&#12414;&#12377;:
</p>
<pre>sudo dpkg -r --force-depends xfree86-rootless\ 
xfree86-rootless-shlibs xfree86-base xfree86-base-shlibs</pre>
<p>
&#12418;&#12375;&#12473;&#12524;&#12483;&#12489;&#29256;&#12398; XFree86 &#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;force remove 
&#12434;&#34892;&#12387;&#12390;&#20182;&#12398;XFree86 &#12420;&#20195;&#26367;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12392;&#12289; dpkg 
&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#21839;&#38988;&#12364;&#29983;&#12376;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
</li>
</ol>
<p>&#36870;&#12395; Fink &#20197;&#22806;&#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383; X11 &#12364;&#26082;&#12395;&#12354;&#12427;&#22580;&#21512;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;:</p>
<pre>sudo rm -rf /usr/X11R6 /etc/X11</pre> 
<p>
&#12371;&#12428;&#12399; Fink &#20197;&#22806;&#12398; X11 &#12434;&#21066;&#38500;&#12377;&#12427;&#27491;&#12375;&#12356;&#26041;&#27861;&#12391;&#12377;&#12290;
&#12414;&#12383;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12418;&#12398;&#12395;&#12424;&#12387;&#12390; <tt style="white-space: nowrap;">XDarwin.app</tt> | <tt style="white-space: nowrap;">X11.app</tt> &#12418;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
Apple X11 &#12434;&#21066;&#38500;&#12377;&#12427;&#22580;&#21512;&#12399; <tt style="white-space: nowrap;">.xinitrc</tt> &#12434;&#38283;&#12356;&#12390; <tt style="white-space: nowrap;">quartz-wm</tt> &#12434;&#23455;&#34892;&#12375;&#12394;&#12356;&#12363;&#30906;&#35469;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12371;&#12428;&#12391;&#26032;&#12375;&#12356; X11 &#12434;&#25163;&#21205;&#12391;&#12418; Fink &#12391;&#12418;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>  

<h3><a name="inst-xfree86.fink-summary">3.10 Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35201;&#28857;</a></h3>

<p>
&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#24517;&#35201;&#12394; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#35201;&#28857;:
</p>
<table border="0" cellpadding="0" cellspacing="10"><tr valign="bottom"><th align="left">Install Type</th><th align="left">Fink packages</th></tr><tr valign="top"><td>Fink &#12391;&#12499;&#12523;&#12489;&#12375;&#12383; 4.2.x</td><td>
<p>
<tt style="white-space: nowrap;">xfree86-base</tt> &#12392; <tt style="white-space: nowrap;">xfree86-rootless</tt> (&#12392;&#12381;&#12398; <tt style="white-space: nowrap;">-shlibs</tt>)</p>
<p>&#12414;&#12383;&#12399; <tt style="white-space: nowrap;">xfree86-base-threaded</tt> &#12392; <tt style="white-space: nowrap;">xfree86-rootless-threaded</tt> (&#12392; <tt style="white-space: nowrap;">-shlibs</tt>)</p>
</td></tr><tr valign="top"><td>Fink &#12391;&#12499;&#12523;&#12489;&#12375;&#12383; 4.3.x</td><td>
<p>
<tt style="white-space: nowrap;">xfree86</tt> &#12392; <tt style="white-space: nowrap;">xfree86-shlibs</tt>
</p>
</td></tr><tr valign="top"><td>4.x &#20844;&#24335;&#12496;&#12452;&#12490;&#12522;</td><td>
<p>
<tt style="white-space: nowrap;">system-xfree86</tt> &#12398;&#12415; (+&#12362;&#12414;&#12369;)</p>
</td></tr><tr valign="top"><td>&#12477;&#12540;&#12473;&#12354;&#12427;&#12356;&#12399; CVS &#12363;&#12425;&#12499;&#12523;&#12489;&#12375;&#12383; 4.x</td><td>
<p>
<tt style="white-space: nowrap;">system-xfree86</tt> &#12398;&#12415; (+&#12362;&#12414;&#12369;)</p>
</td></tr><tr valign="top"><td>Apple &#12398; 4.2.x</td><td>
<p>
<tt style="white-space: nowrap;">system-xfree86</tt> &#12398;&#12415; (+&#12362;&#12414;&#12369;)
</p>
</td></tr><tr valign="top"><td>Apple &#12398; 4.3.x</td><td><p>
<tt style="white-space: nowrap;">system-xfree86</tt> &#12398;&#12415; (+&#12362;&#12414;&#12369;)
</p>
</td></tr></table>

<h2><a name="run-xfree86">4 XFree86 &#12398;&#36215;&#21205;</a></h2>


<h3><a name="run-xfree86.darwin">4.1 Darwin</a></h3>

<p>
&#32020;&#31883;&#12394; Darwin &#19978;&#12391;&#12399; XFree86 &#12399;&#20182;&#12398; Unix &#12392;&#21516;&#27096;&#12395;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
&#36890;&#24120;&#12289;&#12467;&#12531;&#12477;&#12540;&#12523;&#12363;&#12425; <tt style="white-space: nowrap;">startx</tt> &#12391;&#36215;&#21205;&#12373;&#12379;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12392;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12420;&#12479;&#12540;&#12511;&#12490;&#12523;&#12456;&#12511;&#12517;&#12524;&#12540;&#12479;&#12394;&#12393;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
&#32020;&#31883; Darwin &#19978;&#12391;&#12399;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#21336;&#32020;&#12395;:
</p>
<pre>startx</pre>
<p>
&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;
&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#20309;&#12434;&#36215;&#21205;&#12373;&#12379;&#12427;&#12363;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12399;&#12393;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12363;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">.xserverrc</tt> &#12399;&#12469;&#12540;&#12496;&#12458;&#12503;&#12471;&#12519;&#12531;&#12420;&#20182;&#12398;&#12469;&#12540;&#12496;&#12434;&#36215;&#21205;&#12373;&#12379;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12418;&#12375;&#21839;&#38988;&#12364;&#12354;&#12428;&#12400; (&#30495;&#12387;&#26263;&#12394;&#30011;&#38754;&#12420;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#25147;&#12387;&#12390;&#12375;&#12414;&#12387;&#12383;&#12425;) &#12289;&#19978;&#36848;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12375;&#12390;&#12415;&#12390;&#19979;&#12373;&#12356;&#12290;
<tt style="white-space: nowrap;">startx</tt> &#12399;&#12371;&#12428;&#12425;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#23433;&#20840;&#12394;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12391;&#36215;&#21205;&#12377;&#12427;&#12399;&#12378;&#12391;&#12377;&#12290;
</p>
<p>
&#12354;&#12427;&#12356;&#12399;&#12289;&#12469;&#12540;&#12496;&#12395; XDMCP &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12388;&#12369;&#12390;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#36215;&#21205;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;:
</p>
<pre>X -query remotehost</pre>
<p>
&#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399; <tt style="white-space: nowrap;">Xserver</tt> &#12398;&#12510;&#12491;&#12517;&#12450;&#12523;&#12506;&#12540;&#12472;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
&#26368;&#24460;&#12395;&#12289; <tt style="white-space: nowrap;">xdm</tt> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#35373;&#23450;&#12375;&#12390;&#36215;&#21205;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;:
&#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12398;&#35443;&#32048;&#12399;&#12510;&#12491;&#12517;&#12450;&#12523;&#12506;&#12540;&#12472;&#12434;&#12372;&#35239;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#27880;&#35352;: Mac OS X &#12391;&#12399;&#12289;&#12525;&#12464;&#12452;&#12531;&#30011;&#38754;&#12391; <tt style="white-space: nowrap;">&gt;console</tt> &#12392;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12391;&#12486;&#12461;&#12473;&#12488;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#20837;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;
</p>

<h3><a name="run-xfree86.macosx-41">4.2 Mac OS X + XFree86 4.x.y</a></h3>

<p>
Mac OS X &#12391; XFree86 &#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#22522;&#26412;&#30340;&#12395;&#20108;&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12402;&#12392;&#12388;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12501;&#12457;&#12523;&#12480;&#20869;&#12398; XDarwin.app &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#24460;&#12289;&#36215;&#21205;&#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12363;&#12523;&#12540;&#12488;&#12524;&#12473;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12480;&#12452;&#12450;&#12525;&#12464;&#12399;&#27598;&#22238;&#12391;&#12390;&#12365;&#12414;&#12377;&#12364;&#12289; Preferences &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#35373;&#23450;&#12434;&#34892;&#12358;&#12392;&#20986;&#12390;&#12371;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
4.2.0 &#12424;&#12426;&#21069;&#12399;&#33258;&#21205;&#30340;&#12395;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12391;&#12289;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12395;&#12424;&#12427;&#36215;&#21205;&#12391;&#12399;&#12523;&#12540;&#12488;&#12524;&#12473;&#12395;&#22793;&#12360;&#12427;&#26041;&#27861;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12391;&#12375;&#12383;&#12290;
</p>
<p>
&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289; Mac OS X &#19978;&#12391;&#12479;&#12540;&#12511;&#12490;&#12523;.app&#12363;&#12425; <tt style="white-space: nowrap;">startx</tt> &#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#26041;&#27861;&#12391;&#12469;&#12540;&#12496;&#12434;&#36215;&#21205;&#12377;&#12427;&#22580;&#21512;&#12289;Quartz &#12392;&#20849;&#23384;&#12377;&#12427;&#12371;&#12392;&#12434;&#20253;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12289; <tt style="white-space: nowrap;">-fullscreen</tt> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12388;&#12369;&#12390;:
</p>
<pre>startx -- -fullscreen</pre>
<p>
&#12392;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12391;&#12469;&#12540;&#12496;&#12364;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;
&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399; <tt style="white-space: nowrap;">.xinitrc</tt> &#12395;&#26360;&#12365;&#36796;&#12435;&#12391;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#27880;&#35352;: 4.2 &#12424;&#12426;&#21069;&#12391;&#12399; <tt style="white-space: nowrap;">-quartz</tt> &#12391;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
</p>
<p>
&#12469;&#12540;&#12496;&#12364;&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289; <tt style="white-space: nowrap;">-rootless</tt> &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;:
</p>
<pre>startx -- -rootless</pre>
<p>
<tt style="white-space: nowrap;">-quartz</tt> &#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12418;&#12358;&#12501;&#12523;&#12473;&#12463;&#12522;&#12540;&#12531;&#12514;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12379;&#12435;&#12290;
&#20195;&#12431;&#12426;&#12395;&#12289; Preferences &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12514;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
</p>
<p>4.3 &#26178;&#28857;&#12391;&#12399;&#12289;&#24341;&#25968;&#12394;&#12375;&#12391; <tt style="white-space: nowrap;">startx</tt> &#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#36215;&#21205;&#12480;&#12452;&#12450;&#12525;&#12464;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<h3><a name="run-xfree86.xinitrc">4.3 .xinitrc &#12501;&#12449;&#12452;&#12523;</a></h3>

<p>
&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395; <tt style="white-space: nowrap;">.xinitrc</tt> &#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#33258;&#21205;&#30340;&#12395;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12420; 
xterm, GNOME &#12394;&#12393;&#12398;&#12487;&#12473;&#12463;&#12488;&#12483;&#12503;&#29872;&#22659;&#12392;&#12356;&#12387;&#12383;X &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12399;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12471;&#12455;&#12523;&#12473;&#12463;&#12522;&#12503;&#12488;&#12391;&#12377;&#12290;
&#36890;&#24120;&#12398; <tt style="white-space: nowrap;">#!/bin/sh</tt> &#12434;&#20808;&#38957;&#12395;&#26360;&#12356;&#12383;&#12426;&#12289;&#23455;&#34892;&#21487;&#33021;&#12501;&#12521;&#12464;&#12434;&#12383;&#12390;&#12427;&#24517;&#35201;&#12399;<b>&#12354;&#12426;&#12414;&#12379;&#12435;</b>&#12290;
xinit &#12399;&#12471;&#12455;&#12523;&#12434;&#36890;&#12375;&#12390;&#36215;&#21205;&#12377;&#12427;&#26041;&#27861;&#12434;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>
<p>
<tt style="white-space: nowrap;">.xinitrc</tt> &#12501;&#12449;&#12452;&#12523;&#12364;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12395;&#12394;&#12356;&#22580;&#21512;&#12289; XFree86 &#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12501;&#12449;&#12452;&#12523;
<tt style="white-space: nowrap;">/private/etc/X11/xinit/xinitrc</tt>.
&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20803;&#12395;&#32232;&#38598;&#12377;&#12427;&#12392;&#12424;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
</p>
<pre>cp /private/etc/X11/xinit/xinitrc ~/.xinitrc</pre>
<p>
Fink &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289; source <tt style="white-space: nowrap;">init.sh</tt> &#12434;&#19968;&#30058;&#26368;&#21021;&#12395;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12387;&#12390;&#29872;&#22659;&#12364;&#27491;&#12375;&#12367;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;
</p>
<p>
<tt style="white-space: nowrap;">.xinitrc</tt> &#12395;&#12399;&#20219;&#24847;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#36861;&#21152;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12356;&#12367;&#12388;&#12363;&#12398;&#27880;&#24847;&#28857;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12414;&#12378;&#12289;&#12471;&#12455;&#12523;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#19968;&#12388;&#12389;&#12388;&#23455;&#34892;&#12375;&#12390;&#12356;&#12365;&#12414;&#12377;&#12290;
&#27425;&#12395;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#21069;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#23436;&#20840;&#12395;&#32066;&#20102;&#12377;&#12427;&#12414;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
&#21516;&#26178;&#12395;&#35079;&#25968;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#23455;&#34892;&#12375;&#12383;&#12356;&#22580;&#21512;&#12289;&#12471;&#12455;&#12523;&#12395;  "&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489; " 
&#12391;&#23455;&#34892;&#12377;&#12427;&#12424;&#12358;&#20253;&#12360;&#12427;&#12383;&#12417; <tt style="white-space: nowrap;">&amp;</tt> &#12434;&#21508;&#34892;&#12398;&#26368;&#24460;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
&#27425;&#12395;&#12289; <tt style="white-space: nowrap;">xinit</tt> &#12399; <tt style="white-space: nowrap;">.xinitrc</tt> &#12473;&#12463;&#12522;&#12503;&#12488;&#12364;&#12364;&#32066;&#20102;&#12375;&#12377;&#12427;&#12414;&#12391;&#24453;&#12385;&#12289;
"&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#32066;&#20102;&#12375;&#12414;&#12375;&#12383;&#12290; X &#12469;&#12540;&#12496;&#12434;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;" 
&#12392;&#35299;&#37320;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#24847;&#21619;&#12399;&#12289;<tt style="white-space: nowrap;">.xinitrc</tt> &#12398;&#26368;&#24460;&#12398;&#12467;&#12510;&#12531;&#12489;&#12399;&#12496;&#12483;&#12463;&#12464;&#12521;&#12531;&#12489;&#12391;&#23455;&#34892;&#12375;&#12390;&#12399;&#12394;&#12425;&#12378;&#12289;&#12378;&#12387;&#12392;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
&#24931;&#32722;&#30340;&#12395;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399;&#12371;&#12398;&#30446;&#30340;&#12398;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12390;&#12365;&#12414;&#12375;&#12383;&#12290;
&#23455;&#38555;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12399; <tt style="white-space: nowrap;">xinit</tt> &#12364;&#24453;&#12387;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24819;&#23450;&#12375;&#12289;&#12513;&#12491;&#12517;&#12540;&#12398; "&#12525;&#12464;&#12450;&#12454;&#12488;" &#12391;&#12399;&#12371;&#12428;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
(&#27880;&#35352;: &#12513;&#12514;&#12522;&#12392; CPU &#12469;&#12452;&#12463;&#12523;&#12434;&#31680;&#32004;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#19979;&#35352;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395; <tt style="white-space: nowrap;">exec</tt> &#12434;&#36861;&#21152;&#12377;&#12427;&#12392;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;)
</p>
<p>
&#20197;&#19979;&#12398;&#12469;&#12531;&#12503;&#12523;&#12391;&#12399; GNOME &#12434;&#36215;&#21205;&#12375;&#12390;&#12356;&#12414;&#12377;:
</p>
<pre>source /sw/bin/init.sh
exec gnome-session</pre>
<p>
&#12424;&#12426;&#35079;&#38609;&#12395;&#12289; bell &#12434;&#12458;&#12501;&#12395;&#12375;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12356;&#12367;&#12388;&#12363;&#36215;&#21205;&#12375;&#12390;&#12363;&#12425; Enlightenment &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;:
</p>
<pre>source /sw/bin/init.sh

xset b off

xclock -geometry -0+0 &amp;
xterm &amp;
xterm &amp;

exec enlightenment</pre>

<h2><a name="xtools">5 Xtools</a></h2>


<h3><a name="xtools.install">5.1 Xtools &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</a></h3>

<p>
&#27005;&#21213;&#12289;&#27005;&#21213;&#12290;
&#12452;&#12531;&#12473;&#12488;&#12540;&#12521;&#12434;&#35211;&#12388;&#12369;&#12390;&#12289;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12460;&#12452;&#12489;&#12395;&#24467;&#12358;&#12384;&#12369;&#12391;&#12377;&#12290;
&#36215;&#21205;&#12487;&#12451;&#12473;&#12463;&#12434;&#36984;&#25246;&#12377;&#12427;&#12398;&#12434;&#24536;&#12428;&#12378;&#12395;&#12290;
</p>
<p>
Fink &#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;Xtools &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#24460;&#12395; <tt style="white-space: nowrap;">system-xtools</tt> &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12399;&#12501;&#12449;&#12452;&#12523;&#12399;&#20309;&#12418;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12379;&#12435;&#12290;
&#20195;&#12431;&#12426;&#12395;&#12521;&#12452;&#12502;&#12521;&#12522;&#12394;&#12393;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390; Fink &#12398;&#20381;&#23384;&#24615;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#20195;&#26367;&#29289;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
</p>

<h3><a name="xtools.run">5.2 Xtools &#12398;&#36215;&#21205;</a></h3>

<p>
Xtools &#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12501;&#12457;&#12523;&#12480;&#20869;&#12398; Xtools.app &#12450;&#12452;&#12467;&#12531;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
XFree86 &#12392;&#21516;&#27096;&#12289; Xtools &#12399; <tt style="white-space: nowrap;">.xinitrc</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;
Xtools &#12391;&#12399;&#12373;&#12425;&#12395;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12418;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>

<h3><a name="xtools.opengl">5.3 OpenGL &#12395;&#38306;&#12377;&#12427;&#27880;&#35352;</a></h3>

<p>
Xtools &#12399;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#21152;&#36895;&#12398; OpenGL &#12434;&#12523;&#12540;&#12488;&#12524;&#12473;&#12391;&#34892;&#12356;&#12289;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12521;&#12452;&#12502;&#12521;&#12522;&#12418;&#12388;&#12356;&#12390;&#12365;&#12414;&#12377;&#12290;
&#20027;&#35201;&#12394; libGL &#12521;&#12452;&#12502;&#12521;&#12522;&#12399;&#21839;&#38988;&#12394;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289; libGLU &#12392; libglut &#12399;&#38745;&#30340;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;&#12392;&#12375;&#12390;&#12398;&#12415;&#23384;&#22312;&#12375;&#12289; XFree86 &#12392;&#12398;&#12496;&#12452;&#12490;&#12522;&#20114;&#25563;&#12398;&#21839;&#38988;&#12434;&#24341;&#12365;&#36215;&#12371;&#12375;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12289;&#12504;&#12483;&#12480;&#12395;&#36275;&#12426;&#12394;&#12356;&#12418;&#12398;&#12364;&#12354;&#12426;&#12289; Fink &#12391;&#12399;&#12414;&#12384;&#35299;&#27770;&#12391;&#12365;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
Xtools 1.1 &#12414;&#12391;&#12395;&#12399;&#20462;&#27491;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#26399;&#24453;&#12375;&#12414;&#12377;&#12290;
</p>

<h2><a name="other">6 &#12381;&#12398;&#20182;&#12398; X11</a></h2>


<h3><a name="other.vnc">6.1 VNC</a></h3>

<p>
VNC &#12399; X11 &#12392;&#35373;&#35336;&#19978;&#12424;&#12367;&#20284;&#12390;&#12356;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#21487;&#33021;&#12394;&#30011;&#20687;&#34920;&#31034;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;
&#12424;&#12367;&#20284;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#20302;&#12524;&#12505;&#12523;&#12391;&#21205;&#20316;&#12375;&#12390;&#12356;&#12390;&#23455;&#35013;&#12364;&#23481;&#26131;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
Xvnc &#12469;&#12540;&#12496;&#12392; Mac OS X &#12487;&#12451;&#12473;&#12503;&#12524;&#12452;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390; Mac OS X &#19978;&#12391; X11 &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;
Jeff Whitaker &#27663;&#12398; <a href="http://www.cdc.noaa.gov/~jsw/macosx_xvnc/">Xvnc page</a> &#12395;&#12371;&#12428;&#12395;&#12388;&#12356;&#12390;&#12398;&#24773;&#22577;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>

<h3><a name="other.wiredx">6.2 WiredX</a></h3>

<p>
<a href="http://www.jcraft.com/wiredx/">WiredX</a> &#12399; Java &#12391;&#26360;&#12363;&#12428;&#12383; X11 &#12391;&#12377;&#12290;
&#12523;&#12540;&#12488;&#12524;&#12473;&#12514;&#12540;&#12489;&#12418;&#23550;&#24540;&#12375;&#12390;&#12356;&#12390;&#12289;&#12454;&#12455;&#12502;&#19978;&#12395; Installer.app &#12497;&#12483;&#12465;&#12540;&#12472;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>

<h3><a name="other.exodus">6.3 eXodus</a></h3>

<p>
&#21516;&#31038;&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;&#12424;&#12427;&#12392;&#12289; Powerlan USA &#12398; <a href="http://www.powerlan-usa.com/exodus/">eXodus 8</a> &#12399; Mac OS X &#19978;&#12391;&#12493;&#12452;&#12486;&#12451;&#12502;&#12395;&#21205;&#20316;&#12377;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12395;&#29992;&#12356;&#12425;&#12428;&#12390;&#12356;&#12427;&#12467;&#12540;&#12489;&#12420;&#12525;&#12540;&#12459;&#12523;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12363;&#12399;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12289; Fink &#12391;&#12399; eXodus &#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12399;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12418;&#12375;&#20309;&#12425;&#12363;&#12398;&#24773;&#22577;&#12364;&#12354;&#12428;&#12400;&#12289;&#25105;&#12293;&#12395;&#19979;&#12373;&#12356;&#12290;
</p>

<h2><a name="trouble">7 XFree86 &#12488;&#12521;&#12502;&#12523;&#12471;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;</a></h2>


<h3><a name="trouble.immedate-quit">7.1 XDarwin &#12434;&#36215;&#21205;&#12375;&#12383;&#30452;&#24460;&#12395;&#32066;&#20102;&#12363;&#12463;&#12521;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;</a></h3>

<p>
&#24908;&#12390;&#12394;&#12356;&#12289;&#24908;&#12390;&#12394;&#12356;&#12290;
XFree86 &#12434;&#12362;&#12363;&#12375;&#12367;&#12377;&#12427;&#21407;&#22240;&#12399;&#27810;&#23665;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12394;&#12363;&#12391;&#12289;&#36215;&#21205;&#12395;&#38306;&#36899;&#12377;&#12427;&#12418;&#12398;&#12399;&#29305;&#12395;&#22810;&#12356;&#12391;&#12377;&#12290;
&#36215;&#21205;&#26178;&#12395;&#21839;&#38988;&#12364;&#12354;&#12387;&#12383;&#22580;&#21512;&#12289;&#24403;&#28982; XDarwin &#12364;&#12463;&#12521;&#12483;&#12471;&#12517;&#12377;&#12427;&#12371;&#12392;&#12418;&#12424;&#12367;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#31680;&#12391;&#12399;&#36215;&#12371;&#12426;&#12358;&#12427;&#21839;&#38988;&#12395;&#12388;&#12356;&#12390;&#12398;&#23550;&#20966;&#12398;&#23436;&#20840;&#12394;&#19968;&#35239;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12365;&#12383;&#12356;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;
&#12414;&#12378;&#26368;&#21021;&#12399;&#12289;&#20108;&#31278;&#39006;&#12398;&#24773;&#22577;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
</p>
<p>
<b>XDarwin &#12496;&#12540;&#12472;&#12519;&#12531;</b>
XDarwin &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289; Finder &#12398; XDarwin &#12450;&#12452;&#12467;&#12531;&#12434; <b>&#19968;&#22238;&#12384;&#12369;</b> &#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425; " &#24773;&#22577;&#12434;&#35211;&#12427;" &#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;
&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;&#26032;&#12375;&#12356;&#12496;&#12452;&#12490;&#12522;&#12486;&#12473;&#12488;&#12522;&#12522;&#12540;&#12473;&#12364; XonX &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#20986;&#12383;&#12392;&#12365;&#12384;&#12369;&#12354;&#12364;&#12426;&#12414;&#12377;&#12290;
&#12388;&#12414;&#12426;&#12289; "1.0a1" &#12399;&#23455;&#38555;&#12399; 1.0a1 &#12392; 1.0a2 &#12398;&#38291;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
<b>&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;</b>
&#12371;&#12428;&#12399;&#21839;&#38988;&#12434;&#29305;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#38920;&#12398;&#24773;&#22577;&#12391;&#12377;&#12290;
&#12456;&#12521;&#12540;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35211;&#12427;&#12398;&#12399;&#12289;&#12393;&#12358;&#12420;&#12387;&#12390; XDarwin &#12434;&#36215;&#21205;&#12375;&#12383;&#12363;&#12395;&#12424;&#12387;&#12390;&#22793;&#12431;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">startx</tt> &#12434;&#12479;&#12540;&#12511;&#12490;&#12523;&#12363;&#12425;&#36215;&#21205;&#12375;&#12383;&#22580;&#21512;&#12289;&#12381;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#20869;&#12395;&#20986;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12473;&#12463;&#12525;&#12540;&#12523;&#12450;&#12483;&#12503;&#12375;&#12390;&#35211;&#12388;&#12369;&#12390;&#19979;&#12373;&#12356;&#12290;
XDarwin &#12450;&#12452;&#12467;&#12531;&#12434;&#12480;&#12502;&#12523;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#36215;&#21205;&#12375;&#12383;&#22580;&#21512;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12471;&#12473;&#12486;&#12512;&#12525;&#12464;&#12395;&#26360;&#12363;&#12428;&#12414;&#12377;&#12290;
&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12501;&#12457;&#12523;&#12480;&#20869;&#12398;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12540;&#12363;&#12425; Console &#12434;&#36215;&#21205;&#12375;&#12289;&#35442;&#24403;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#25506;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<p>
&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#12388;&#12356;&#12390;&#12398;&#35500;&#26126;&#12434;&#12375;&#12414;&#12377;:
</p>
<pre>_XSERVTransmkdir: Owner of /tmp/.X11-unix should be set to root</pre>
<pre>_IceTransmkdir: Owner of /tmp/.ICE-unix should be set to root</pre>
<p>
Class: Harmless.
X11 &#12399;&#38560;&#12375;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434; /tmp &#12395;&#20316;&#12426;&#12289;&#12477;&#12465;&#12483;&#12488; "&#12501;&#12449;&#12452;&#12523;" &#12434;&#12525;&#12540;&#12459;&#12523;&#25509;&#32154;&#29992;&#12395;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12540;&#19978;&#12398;&#21839;&#38988;&#12363;&#12425;&#12289; X11 &#12399; root &#12434;&#25152;&#26377;&#32773;&#12395;&#12375;&#12414;&#12377;&#12364;&#12289;&#35504;&#12391;&#12418;&#26360;&#12365;&#36796;&#12417;&#12427;&#12383;&#12417;&#23455;&#34892;&#26178;&#12395;&#12399;&#21839;&#38988;&#12395;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
(&#27880;&#35352;: &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434; root &#12395;&#25345;&#12383;&#12379;&#12427;&#12371;&#12392;&#12399;&#22256;&#38627;&#12391;&#12377;&#12290;
Mac OS X &#12391;&#12399; /tmp &#12434; &#20877;&#36215;&#21516;&#26178;&#12395;&#21066;&#38500;&#12375;&#12289; XDarwin &#33258;&#20307;&#12399; root &#27177;&#38480;&#12391;&#12399;&#23455;&#34892;&#12373;&#12428;&#12394;&#12356;&#12383;&#12417;&#12391;&#12377;)
</p>
<pre>QuartzAudioInit: AddIOProc returned 1852797029</pre>
<pre>-[NSCFArray objectAtIndex:]: index (2) beyond bounds (2)</pre>
<pre>kCGErrorIllegalArgument : CGSGetDisplayBounds (display 35434400)</pre>
<pre>No core keyboard</pre>
<p>
Class: Bogus (&#22040;&#20843;&#30334;).
&#12371;&#12428;&#12399;&#21069;&#12398;&#12456;&#12521;&#12540;&#12434;&#12522;&#12475;&#12483;&#12488;&#12377;&#12427;&#38555;&#12395;&#30330;&#29983;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
&#12371;&#12398;&#38291;&#12289;&#36215;&#21205;&#12496;&#12490;&#12540;&#12364;&#12418;&#12358;&#19968;&#12388;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399; XDarwin &#12391;&#12399;&#21205;&#20316;&#12375;&#12394;&#12356;&#12383;&#12417;&#12289;&#12371;&#12398;&#12456;&#12521;&#12540;&#12434;&#20986;&#21147;&#12375;&#12414;&#12377;&#12290;
&#12418;&#12375;&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#20986;&#12390;&#12365;&#12383;&#12425;&#12289;&#12479;&#12540;&#12511;&#12490;&#12523;&#12414;&#12383;&#12399; Console &#12434;&#12373;&#12425;&#12395;&#12473;&#12463;&#12525;&#12540;&#12523;&#12450;&#12483;&#12503;&#12375;&#12390;&#20182;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#25506;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12399; 1.0a3 &#12354;&#12391;&#23384;&#22312;&#12375;&#12414;&#12375;&#12383;&#12364;&#12289;&#12371;&#12428;&#20197;&#38477;&#12391;&#12399;&#20462;&#27491;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
</p>
<pre>cat: /Users/chrisp/.Xauthority: No such file or directory</pre>
<p>
Class: Mostly harmless.
&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12393;&#12371;&#12363;&#12425;&#12365;&#12383;&#12398;&#12363;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#21205;&#20316;&#12395;&#12399;&#29305;&#12395;&#24433;&#38911;&#12375;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12391; <tt style="white-space: nowrap;">touch .Xauthority</tt> &#12434;&#36215;&#21205;&#12377;&#12427;&#12392;&#21462;&#12426;&#38500;&#12367;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>
<pre>Gdk-WARNING **: locale not supported by C library</pre>
<p>
Class: Harmless.
&#12371;&#12428;&#12399;&#12289;&#25991;&#23383;&#36890;&#12426;&#12398;&#12371;&#12392;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#23455;&#34892;&#12395;&#12399;&#38306;&#20418;&#12375;&#12414;&#12379;&#12435;&#12290;
&#35443;&#32048;&#12399;&#12289;<a href="#trouble.locale">&#19979;&#35352;&#12434;&#21442;&#29031;</a>&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<pre>Gdk-WARNING **: locale not supported by Xlib, locale set to C
Gdk-WARNING **: can not set locale modifiers</pre>
<p>
Class: Bad, but not fatal.
&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#19978;&#35352;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12392;&#19968;&#32210;&#12395;&#20986;&#12390;&#12367;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#12289; XFree86 &#12398;&#12525;&#12465;&#12540;&#12523;&#12487;&#12540;&#12479;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12477;&#12540;&#12473;&#12363;&#12425;&#12499;&#12523;&#12489;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12456;&#12521;&#12540;&#12399;&#30330;&#29983;&#12375;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
&#12411;&#12392;&#12435;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#21205;&#20316;&#12375;&#12414;&#12377;&#12364;&#12289; GNU Emacs &#12399;&#20363;&#22806;&#12391;&#12377;&#12290;
</p>
<pre>Unable to open keymapping file USA.keymapping.
Reverting to kernel keymapping.</pre>
<p>
Class: Often fatal.
&#12371;&#12428;&#12399; XDarwin 1.0a1 &#12391; "Load from file" keymapping &#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12458;&#12531;&#12398;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399; Preferences &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12395;&#12501;&#12523;&#12497;&#12473;&#12391;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12391;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12399;&#33258;&#21205;&#30340;&#12395;&#26908;&#32034;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#36890;&#24120;&#12289;&#19979;&#12398; "assert" &#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#32154;&#12365;&#12414;&#12377;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12395;&#12399;&#12289;&#19979;&#12395;&#26360;&#12363;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12395;&#24467;&#12387;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<pre>Fatal server error:
assert failed on line 454 of darwinKeyboard.c!</pre>
<pre>Fatal server error:
Could not get kernel keymapping! Load keymapping from file instead.</pre>
<p>
Class: Fatal.
Apple &#12398; Mac OS X 10.1 &#12395;&#12362;&#12369;&#12427;&#22793;&#26356;&#12364; XFree86 &#12398;&#12461;&#12540;&#12508;&#12540;&#12489;&#12524;&#12452;&#12450;&#12454;&#12488;&#12434;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12459;&#12540;&#12493;&#12523;&#12363;&#12425;&#35501;&#12416;&#12467;&#12540;&#12489;&#12434;&#22730;&#12375;&#12414;&#12375;&#12383;&#12290;
&#19978;&#35352;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12371;&#12398;&#12383;&#12417;&#12395;&#20986;&#12390;&#12365;&#12414;&#12377;&#12290;
Mac OS X 10.1 &#19978;&#12391;&#12399; "Load from file" keymapping &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#35373;&#23450;&#12399; XDarwin Preferences &#12480;&#12452;&#12450;&#12525;&#12464;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12501;&#12449;&#12452;&#12523;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#30906;&#35469;&#12375;&#12414;&#12377; ("Pick file" &#12508;&#12479;&#12531;&#12434;&#20351;&#12358;) &#12290;
XDarwin &#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12399;&#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12434;&#12458;&#12531;&#12395;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#21205;&#20316;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12418;&#12375; XDarin &#12364;&#30452;&#12368;&#12395;&#32066;&#20102;&#12375;&#12390; Preferences &#12480;&#12452;&#12450;&#12525;&#12464;&#12414;&#12391;&#12383;&#12393;&#12426;&#30528;&#12369;&#12394;&#12356;&#22580;&#21512;&#12289;
<tt style="white-space: nowrap;">startx -- -quartz -keymap USA.keymapping</tt> &#12434;&#23455;&#34892;&#12375;&#12390;&#12479;&#12540;&#12511;&#12490;&#12523;&#12363;&#12425;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12391;&#36890;&#24120;&#12399; XDarwin &#12364;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;
Preferences &#12391;&#35373;&#23450;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;
</p>
<pre>Fatal server error:
Could not find keymapping file .</pre>
<p>
Class: Fatal (&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36890;&#12426;).  
&#12371;&#12428;&#12399; Panther &#12391;&#12461;&#12540;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12364;&#12394;&#12356;&#12383;&#12417;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">xfree86-4.3.99-16</tt> &#20197;&#38477;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12461;&#12540;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#24517;&#35201;&#12392;&#12375;&#12394;&#12356;&#12398;&#12391;&#12289;&#12371;&#12428;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<pre>Warning: no access to tty (Inappropriate ioctl for device).
Thus no job control in this shell.</pre>
<p>
Class: Mostly harmless.
XDarwin 1.0a2 &#20197;&#38477;&#12391;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#36215;&#21205;&#12501;&#12449;&#12452;&#12523; (.xinitrc) &#12434;&#23455;&#34892;&#12377;&#12427;&#38555;&#12395;&#35023;&#12391;&#23550;&#35441;&#30340;&#12395;&#12471;&#12455;&#12523;&#12434;&#36215;&#21205;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12387;&#12390; PATH &#12434;&#35373;&#23450;&#12379;&#12378;&#12395;&#12377;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
&#12471;&#12455;&#12523;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#23455;&#38555;&#12398;&#12479;&#12540;&#12511;&#12490;&#12523;&#12395;&#12399;&#25509;&#32154;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30330;&#12375;&#12414;&#12377;&#12364;&#12289;&#12472;&#12519;&#12502;&#31649;&#29702;&#12394;&#12393;&#12395;&#12399;&#12471;&#12455;&#12523;&#12434;&#20351;&#12431;&#12394;&#12356;&#12398;&#12391;&#28961;&#35222;&#12375;&#12414;&#12377;&#12290;
</p>
<pre>Fatal server error:
failed to connect as window server!</pre>
<p>
Class: Fatal.
Aqua &#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#12398;&#12395;&#12467;&#12531;&#12477;&#12540;&#12523;&#12514;&#12540;&#12489;&#12398;&#12469;&#12540;&#12496; (&#32020;&#31883;&#12394; Darwin) &#12364;&#36215;&#21205;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#36890;&#24120;&#12289;&#20844;&#24335; XFree &#12496;&#12452;&#12490;&#12522;&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390; XQuartz.tgz tarball 
&#12434;&#27531;&#12375;&#12390;&#12356;&#12383;&#22580;&#21512;&#12395;&#12371;&#12398;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12289; /usr/X11R6/bin &#12398;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;&#12364;&#22730;&#12428;&#12390;&#12356;&#12383;&#12426;&#12289;&#12479;&#12540;&#12511;&#12490;&#12523;&#12363;&#12425;<tt style="white-space: nowrap;">XDarwin</tt> 
&#12434;&#23455;&#34892;&#12375;&#12390;&#12418;&#30330;&#29983;&#12377;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;
(&#12479;&#12540;&#12511;&#12490;&#12523;&#12363;&#12425;&#12398;&#36215;&#21205;&#12395;&#12399; startx &#12434;&#20351;&#12356;&#12414;&#12377;&#12290;<a href="#run-xfree86">XFree86&#12398;&#36215;&#21205;</a> &#12434;&#21442;&#29031;) &#12290;
</p>
<p>
&#12356;&#12378;&#12428;&#12398;&#22580;&#21512;&#12418;&#12289; <tt style="white-space: nowrap;">ls -l /usr/X11R6/bin/X*</tt> &#12434;&#23455;&#34892;&#12375;&#12390;&#20986;&#21147;&#12398;&#12289;&#29305;&#12395;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#65300;&#12459;&#25152;&#12434;&#35211;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">X</tt> <tt style="white-space: nowrap;">XDarwinStartup</tt> &#12408;&#12398;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;;
<tt style="white-space: nowrap;">XDarwin</tt>, &#23455;&#34892;&#21487;&#33021;&#12501;&#12449;&#12452;&#12523; (&#12467;&#12531;&#12477;&#12540;&#12523;&#12514;&#12540;&#12489;&#12469;&#12540;&#12496;);
<tt style="white-space: nowrap;">XDarwinQuartz</tt> <tt style="white-space: nowrap;">/Applications/XDarwin.app/Contents/MacOS/XDarwin</tt> &#12408;&#12398;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12522;&#12531;&#12463;;
<tt style="white-space: nowrap;">XDarwinStartup</tt> &#23567;&#12373;&#12356;&#23455;&#34892;&#21487;&#33021;&#12501;&#12449;&#12452;&#12523;&#12290;
&#12418;&#12375;&#12393;&#12428;&#12363;&#19968;&#12388;&#12391;&#12418;&#12394;&#12356;&#12363;&#12289;&#36949;&#12358;&#12501;&#12449;&#12452;&#12523;&#12408;&#12522;&#12531;&#12463;&#12373;&#12428;&#12390;&#12356;&#12383;&#12425;&#12289;&#20462;&#27491;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#20462;&#27491;&#12398;&#26041;&#27861;&#12399;&#12393;&#12358;&#12420;&#12387;&#12390; XFree86 &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12383;&#12363;&#12395;&#12424;&#12426;&#12414;&#12377;&#12290;
<a href="#inst-xfree86.rootless">&#12493;&#12483;&#12488;&#19978;&#12398;&#12523;&#12540;&#12488;&#12524;&#12473;&#12469;&#12540;&#12496;</a>&#12434;&#21442;&#32771;&#12395;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>
<pre>The XKEYBOARD keymap compiler (xkbcomp) reports:
&gt; Error:            Can't find file "unknown" for geometry include
&gt;                   Exiting
&gt;                   Abandoning geometry file "(null)"
Errors from xkbcomp are not fatal to the X server</pre>
<p>
Class: Mostly harmless.
&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36890;&#12426;&#12289;&#33268;&#21629;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#31169;&#12364;&#30693;&#12387;&#12390;&#12356;&#12427;&#38480;&#12426;&#12289; XDarwin &#12399; XKB &#25313;&#24373;&#12399;&#20351;&#12387;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
&#12362;&#12381;&#12425;&#12367;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12503;&#12525;&#12464;&#12521;&#12512;&#12395;&#12424;&#12387;&#12390;&#12399;&#20351;&#12387;&#12390;&#12427;&#12371;&#12392;&#12418;&#12354;&#12427;&#12391;&#12375;&#12423;&#12358;&#12364;...
</p>
<pre>startx: Command not found.</pre>
<p>
Class: Fatal.
&#12371;&#12428;&#12399; XDarwin 1.0a2 &#12392; 1.0a3 &#12391; &#12471;&#12455;&#12523;&#12398;&#21021;&#26399;&#12363;&#12501;&#12449;&#12452;&#12523;&#12364; /usr/X11R6/bin 
&#12434; PATH &#22793;&#25968;&#12395;&#36861;&#21152;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
Fink &#12434;&#20351;&#12387;&#12390;&#12356;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12471;&#12455;&#12523;&#12434;&#22793;&#12360;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289; (Fink &#12398;&#35299;&#35500;&#12398;&#36890;&#12426;)
<tt style="white-space: nowrap;">source /sw/bin/init.csh</tt> &#12392;&#12356;&#12358;&#19968;&#34892;&#12434;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398; 
<tt style="white-space: nowrap;">.cshrc</tt> &#12395;&#36861;&#21152;&#12377;&#12428;&#12400;&#21313;&#20998;&#12391;&#12377;&#12290;
</p>
<pre>_XSERVTransSocketUNIXCreateListener: ...SocketCreateListener() failed
_XSERVTransMakeAllCOTSServerListeners: server already running</pre>
<pre>Fatal server error:
Cannot establish any listening sockets - Make sure an X server isn't already
running</pre>
<p>
Class: Fatal.
&#12371;&#12428;&#12399;&#12289;&#38291;&#36949;&#12387;&#12390;&#35079;&#25968;&#12398; XDarwin &#12434;&#36215;&#21205;&#12375;&#12424;&#12358;&#12392;&#12375;&#12383;&#12392;&#12365;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
&#12354;&#12427;&#12356;&#12399;&#12289; (&#12463;&#12521;&#12483;&#12471;&#12517;&#12394;&#12393;) XDarwin &#12434;&#27491;&#24120;&#12395;&#32066;&#20102;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12418;&#12354;&#12426;&#24471;&#12414;&#12377;&#12290;
&#12414;&#12383;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#25509;&#32154;&#29992;&#12477;&#12465;&#12483;&#12488;&#12398;&#12501;&#12449;&#12452;&#12523;&#27177;&#38480;&#12398;&#21839;&#38988;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
<tt style="white-space: nowrap;">rm -rf /tmp/.X11-unix</tt> &#12391;&#12365;&#12428;&#12356;&#12395;&#12377;&#12427;&#12363;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#20877;&#36215;&#21205;&#12391;&#12394;&#12362;&#12426;&#12414;&#12377;
(Mac OS X &#12391;&#12399;&#33258;&#21205;&#30340;&#12395;&#36215;&#21205;&#26178;&#12395; /tmp &#12434;&#12365;&#12428;&#12356;&#12395;&#12375;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12473;&#12479;&#12483;&#12463;&#12434;&#12522;&#12475;&#12483;&#12488;&#12375;&#12414;&#12377;) &#12290;
</p>
<pre>Xlib: connection to ":0.0" refused by server
Xlib: Client is not authorized to connect to Server</pre>
<p>
Class: Fatal.
&#35492;&#12387;&#12383;&#35469;&#35388;&#12487;&#12540;&#12479;&#12398;&#12383;&#12417;&#12395;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364;&#34920;&#31034;&#12469;&#12540;&#12496; (XDarwin) &#12395;&#25509;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12399;&#12354;&#12427;&#31278;&#12398; VNC &#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12289; root &#12391; XDarwin &#12434;&#36215;&#21205;&#12289;&#12354;&#12427;&#12356;&#12399;&#12377;&#12372;&#12367;&#22793;&#12394;&#29366;&#27841;&#19979;&#12364;&#21407;&#22240;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
&#36890;&#24120;&#12289;&#12507;&#12540;&#12512;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12363;&#12425; <tt style="white-space: nowrap;">.Xauthority</tt> &#12501;&#12449;&#12452;&#12523; 
(&#35469;&#35388;&#12487;&#12540;&#12479;&#12364;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12427;) &#12434;&#21066;&#38500;&#12375;&#12289;&#31354;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;:
</p>
<pre>cd
rm .Xauthority
touch .Xauthority</pre>
<p>
&#12371;&#12398;&#20182;&#12395;&#12289; <tt style="white-space: nowrap;">.xinitrc</tt> &#12501;&#12449;&#12452;&#12523;&#12364;&#21407;&#22240;&#12392;&#12394;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#30452;&#12368;&#12395;&#32066;&#20102;&#12377;&#12427;&#12424;&#12358;&#12394;&#22580;&#21512;&#12289; <tt style="white-space: nowrap;">xinit</tt> &#12399;
&#12518;&#12540;&#12470;&#12540;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#32066;&#20102;&#12375;&#12383;&#12392;&#35299;&#37320;&#12375;&#12390; XDarwin &#12434;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;
<a href="#run-xfree86.xinitrc">.xinitrc &#31680;</a> &#12398;&#35443;&#32048;&#12434;&#12372;&#35239;&#19979;&#12373;&#12356;&#12290;
PATH &#12434;&#35373;&#23450;&#12375;&#12289;&#32066;&#20102;&#12375;&#12394;&#12356;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#12402;&#12392;&#12388;&#12384;&#12369;&#36215;&#21205;&#12373;&#12379;&#12427;&#12371;&#12392;&#12399;&#32118;&#23550;&#12395;&#24536;&#12428;&#12394;&#12356;&#12391;&#19979;&#12373;&#12356;&#12290;
<tt style="white-space: nowrap;">exec xterm</tt> &#12434;&#36861;&#21152;&#12375;&#12390;&#12289;&#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#22580;&#21512;&#12398;&#23433;&#20840;&#31574;&#12395;&#12377;&#12427;&#26041;&#27861;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
</p>

<h3><a name="trouble.black">7.2 GNOME &#12497;&#12493;&#12523;&#12420; GNOME &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12513;&#12491;&#12517;&#12398;&#12450;&#12452;&#12467;&#12531;&#12364;&#40658;&#12356;</a></h3>

<p>
&#12424;&#12367;&#12354;&#12427;&#21839;&#38988;&#12395;&#12289;&#12450;&#12452;&#12467;&#12531;&#12420;&#20182;&#12398;&#30011;&#20687;&#12364;&#40658;&#12356;&#38263;&#26041;&#24418;&#12420;&#36650;&#37101;&#12384;&#12369;&#34920;&#31034;&#12373;&#12428;&#12427;&#12392;&#12356;&#12387;&#12383;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#31350;&#26997;&#30340;&#12395;&#12399;&#12289;&#12371;&#12428;&#12399;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12471;&#12473;&#12486;&#12512;&#12398;&#38480;&#30028;&#12395;&#12424;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12399; Apple &#12395;&#22577;&#21578;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#29694;&#26178;&#28857;&#12391;&#12399;&#20462;&#27491;&#12377;&#12427;&#27671;&#12399;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
<a href="http://www.opensource.apple.com/bugs/X/Kernel/2691632.html">Darwin bug report</a> &#12434;&#12362;&#35501;&#12415;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
&#29694;&#29366;&#12399;&#12289; X11 &#12503;&#12525;&#12488;&#12467;&#12523;&#12398; MIT-SHM &#25313;&#24373; &#12364; Darwin &#12392; Mac OS X &#12391;&#12399;&#23455;&#29992;&#30340;&#12395;&#12399;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12391;&#12377;&#12290;
&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#25313;&#24373;&#12399;&#12469;&#12540;&#12496;&#20596;&#12414;&#12383;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12391;&#28961;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
Fink &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383; XFree86 &#12469;&#12540;&#12496; (xfree86-server &#12392; xfree86-rootless) &#12399;&#26082;&#12395;&#28961;&#21177;&#21270;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
GIMP &#12392; GNOME &#12497;&#12493;&#12523;&#12418;&#23550;&#20966;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#21516;&#27096;&#12398;&#21839;&#38988;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12289; <tt style="white-space: nowrap;">--no-xshm</tt> 
&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12388;&#12369;&#12390;&#23455;&#34892;&#12375;&#12390;&#12415;&#12390;&#19979;&#12373;&#12356;&#12290;
</p>

<h3><a name="trouble.keyboard">7.3 &#12461;&#12540;&#12508;&#12540;&#12489;&#12364; XFree86 &#12391;&#21453;&#24540;&#12375;&#12394;&#12356;</a></h3>

<p>
&#12371;&#12398;&#21839;&#38988;&#12399;&#20170;&#12398;&#12392;&#12371;&#12429;&#12494;&#12540;&#12488; (PowerBook, iBook) &#12384;&#12369;&#12391;&#30330;&#29983;&#12377;&#12427;&#12424;&#12358;&#12391;&#12377;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12434;&#22238;&#36991;&#12377;&#12427;&#12383;&#12417;&#12395; "Load from file" keymapping &#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#23455;&#35013;&#12373;&#12428;&#12414;&#12375;&#12383;&#12290;
&#29694;&#22312;&#12391;&#12399;&#21476;&#12356;&#26041;&#27861; (&#12459;&#12540;&#12493;&#12523;&#12363;&#12425;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#35501;&#12416;) &#12399; Mac OS X 10.1 &#12391;&#20351;&#12360;&#12394;&#12367;&#12394;&#12387;&#12383;&#12383;&#12417;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
&#12418;&#12375;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289; XDarwin &#12398; Preferences &#12480;&#12452;&#12450;&#12525;&#12464;&#12391;&#26377;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;
"Load from file" &#12481;&#12455;&#12483;&#12463;&#12508;&#12483;&#12463;&#12473;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12390;&#12461;&#12540;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
 XDarwin &#12434;&#20877;&#36215;&#21205;&#24460;&#12289;&#12461;&#12540;&#12508;&#12540;&#12489;&#12364;&#20351;&#12360;&#12427;&#12399;&#12378;&#12391;&#12377; (&#19979;&#35352;&#21442;&#29031;)&#12290;
</p>
<p>
XFree86 &#12434;&#12467;&#12510;&#12531;&#12489;&#12521;&#12452;&#12531;&#12363;&#12425;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#12461;&#12540;&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12434;&#28193;&#12377;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;:
</p>
<pre>startx -- -quartz -keymap USA.keymapping</pre>

<h3><a name="trouble.delete-key">7.4 Back Space &#12461;&#12540;&#12364;&#21205;&#12363;&#12394;&#12356;</a></h3>

<p>
&#12371;&#12428;&#12399;&#12289; "Load keymapping from file" &#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#22580;&#21512;&#12395;&#12362;&#12371;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12510;&#12483;&#12500;&#12531;&#12464;&#12501;&#12449;&#12452;&#12523;&#12399;&#12496;&#12483;&#12463;&#12473;&#12506;&#12540;&#12473;&#12461;&#12540;&#12434; "Delete" &#12461;&#12540;&#12392;&#12375;&#12390;&#30331;&#37682;&#12375;&#12289; "Backspace" &#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12399;&#12289; <tt style="white-space: nowrap;">.xinitrc</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#20197;&#19979;&#12398;&#34892;&#12434;&#36861;&#21152;&#12375;&#12390;&#30452;&#12375;&#12414;&#12377;:
</p>
<pre>xmodmap -e "keycode 59 = BackSpace"</pre>
<p>
&#12418;&#12375;&#31169;&#12398;&#35352;&#25014;&#12364;&#27491;&#12375;&#12369;&#12428;&#12400;&#12289; XDarwin 1.0a2 &#20197;&#38477;&#12391;&#12399;&#33258;&#21205;&#30340;&#12395; Backspace &#12461;&#12540;&#12392;&#12375;&#12390;&#12510;&#12483;&#12503;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>

<h3><a name="trouble.locale">7.5 "Warning: locale not supported by C library"</a></h3>

<p>
&#12371;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12424;&#12367;&#35211;&#12363;&#12369;&#12414;&#12377;&#12364;&#12289;&#28961;&#23475;&#12391;&#12377;&#12290;
&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36890;&#12426;&#12289;&#22269;&#38555;&#21270;&#12364;&#27161;&#28310; C &#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#36890;&#12375;&#12390;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#33521;&#35486;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12289;&#26085;&#26178;&#12394;&#12393;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12398;&#23550;&#20966;&#27861;&#12399;&#12356;&#12367;&#12388;&#12363;&#12354;&#12426;:
</p>
<ul>
<li>
<p>
&#28961;&#35222;&#12377;&#12427;.

</p>
</li>
<li>
<p>
&#29872;&#22659;&#22793;&#25968; LANG &#12434;&#12450;&#12531;&#12475;&#12483;&#12488;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#20986;&#12390;&#12371;&#12394;&#12367;&#12377;&#12427;&#12290;
&#12371;&#12428;&#12399;&#12289;&#22269;&#38555;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12364; (gettext/libintl &#12398;) &#12469;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#27880;&#24847;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12398;&#20363;&#12392;&#12375;&#12390;&#12289;  
</p>
<pre>unset LANG</pre>
<p>
<tt style="white-space: nowrap;">.cshrc</tt> &#12398;&#20363;:
</p>
<pre>unsetenv LANG</pre>
</li>
<li>
<p>
(10.1 &#12398;&#12415;) <tt style="white-space: nowrap;">libxpg4</tt> Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#20351;&#29992;&#12377;&#12427;&#12290;
&#12371;&#12428;&#12399;&#12471;&#12473;&#12486;&#12512;&#12521;&#12452;&#12502;&#12521;&#12522;&#12424;&#12426;&#21069;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427; (DYLD_INSERT_LIBRARIES &#29872;&#22659;&#22793;&#25968;&#12434;&#20351;&#12387;&#12383;)
&#12525;&#12465;&#12540;&#12523;&#38306;&#25968;&#12394;&#12393;&#12434;&#21547;&#12416;&#23567;&#12373;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;&#12391;&#12377;&#12290;
&#12371;&#12398;&#22580;&#21512;&#12289; LANG &#29872;&#22659;&#22793;&#25968;&#12395;&#23436;&#20840;&#12394;&#20516;&#12289;&#20363;&#12360;&#12400; <tt style="white-space: nowrap;">ja_JP.eucJP</tt> &#12434;&#20351;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">ja</tt> &#12420; <tt style="white-space: nowrap;">ja_JP</tt> &#12391;&#12399;&#21205;&#20316;&#12375;&#12414;&#12379;&#12435;&#12290;
</p>
</li>
<li>
<p>
Apple &#12395;&#23558;&#26469;&#12398; Mac OS X &#12395;&#12289;&#12385;&#12419;&#12435;&#12392;&#12375;&#12383;&#12525;&#12465;&#12540;&#12523;&#12469;&#12509;&#12540;&#12488;&#12434;&#36861;&#21152;&#12375;&#12390;&#12418;&#12425;&#12358;&#12290;
</p>
</li>
</ul>

<h2><a name="tips">8 &#20351;&#29992;&#19978;&#12398; Tips</a></h2>


<h3><a name="tips.terminal-app">8.1 
&#12479;&#12540;&#12511;&#12490;&#12523;.app &#12363;&#12425;&#12398; X11 &#12450;&#12503;&#12522;&#12398;&#36215;&#21205;
</a></h3>

<p>
X11 &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12479;&#12540;&#12511;&#12490;&#12523;.app &#12363;&#12425;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#29872;&#22659;&#22793;&#25968; "DISPLAY" &#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
&#12371;&#12398;&#20516;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12393;&#12371;&#12391; X11 &#12454;&#12451;&#12531;&#12489;&#12454;&#12469;&#12540;&#12496;&#12434;&#25506;&#12377;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12391;&#12399;&#12289; XDarwin &#12399;&#21516;&#12376;&#12510;&#12471;&#12531;&#19978;&#12391;&#21205;&#20316;&#12375;&#12289; tcsh &#12391;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#29872;&#22659;&#22793;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;:
</p>
<pre>setenv DISPLAY :0.0</pre>
<p>
&#12525;&#12464;&#12452;&#12531;&#26178;&#12395; XDarwin.app &#12434;&#36215;&#21205;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375; (&#12471;&#12473;&#12486;&#12512;&#29872;&#22659;&#35373;&#23450;&#12398;&#12525;&#12464;&#12452;&#12531;&#12497;&#12493;&#12523;&#12391;) &#12289;&#20197;&#19979;&#12434; 
<tt style="white-space: nowrap;">.cshrc</tt> &#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#12424;&#12356;&#12391;&#12375;&#12423;&#12358;:
</p>
<pre>if (! $?DISPLAY) then
  setenv DISPLAY :0.0
endif</pre>
<p>
&#20840;&#12390;&#12398;&#12471;&#12455;&#12523;&#12391; DISPLAY &#12434;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12364;&#12289;&#26082;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#19978;&#26360;&#12365;&#12434;&#12375;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12428;&#12395;&#12424;&#12426;&#12289; X11 &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36960;&#38548;&#12363;&#12425;&#12289; ssh &#12420; X11 &#12488;&#12531;&#12493;&#12522;&#12531;&#12464;&#12391;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
</p>

<h3><a name="tips.open">8.2 xterm &#12363;&#12425;&#12398; Aqua &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36215;&#21205;</a></h3>

<p>
Aqua &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398; xterm (&#20182;&#12398;&#12471;&#12455;&#12523;&#12391;&#12418;) &#12363;&#12425;&#12398;&#36215;&#21205;&#26041;&#27861;&#12399;&#12289; <tt style="white-space: nowrap;">open</tt> &#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
&#20363;&#12360;&#12400;:
</p>
<pre>open /Applications/TextEdit.app
open SomeDocument.rtf
open -a /Applications/TextEdit.app index.html</pre>
<p>
&#65298;&#30058;&#30446;&#12398;&#20363;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#36899;&#12377;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#38283;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;
&#65299;&#30058;&#30446;&#12398;&#20363;&#12391;&#12399;&#12289;&#26126;&#31034;&#30340;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
</p>

<h3><a name="tips.copy-n-paste">8.3 &#12467;&#12500;&#12540;&#12392;&#12506;&#12540;&#12473;&#12488;</a></h3>

<p>
&#12467;&#12500;&#12540;&#12392;&#12506;&#12540;&#12473;&#12488;&#12399; Aqua &#12392; X11 &#29872;&#22659;&#38291;&#12391;&#12418;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12496;&#12464;&#12418;&#12414;&#12384;&#27531;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
Emacs &#12399;&#29694;&#22312;&#12398;&#36984;&#25246;&#12395;&#22909;&#12365;&#23244;&#12356;&#12364;&#22810;&#12356;&#12392;&#12356;&#12358;&#22577;&#21578;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
Classic &#12392; X11 &#38291;&#12391;&#12399;&#12289;&#12467;&#12500;&#12540;&#12392;&#12506;&#12540;&#12473;&#12488;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p>
<p>
&#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;&#29872;&#22659;&#12391;&#12381;&#12428;&#12382;&#12428;&#12398;&#26041;&#27861;&#12434;&#20351;&#12358;&#12384;&#12369;&#12391;&#12377;&#12290;
&#12486;&#12461;&#12473;&#12488;&#12434; Aqua &#12363;&#12425; X11 &#12408;&#31227;&#12377;&#12395;&#12399;&#12289; Aqua &#12391; Cmd-C &#12392;&#12375;&#12289;&#31227;&#12377;&#20808;&#12398;&#12454;&#12451;&#12531;&#12489;&#12454;&#12434;&#38283;&#12356;&#12390;
"&#12511;&#12489;&#12523;&#12510;&#12454;&#12473;&#12508;&#12479;&#12531;" &#12289;&#12527;&#12531;&#12508;&#12479;&#12531;&#12510;&#12454;&#12473;&#12398;&#22580;&#21512;&#12399; Option-click &#12434;&#25276;&#12375;&#12390;
(&#12371;&#12428;&#12399; XDarwin &#12398; Preferences &#12391;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;) &#12506;&#12540;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;
&#12486;&#12461;&#12473;&#12488;&#12434; X11 &#12363;&#12425; Aqua &#12395;&#31227;&#12377;&#22580;&#21512;&#12289; X11 &#12391;&#12399;&#12510;&#12454;&#12473;&#12391;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12375;&#12289; Aqua 
&#20596;&#12391; Cmd-V &#12375;&#12390;&#12506;&#12540;&#12473;&#12488;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
X11 &#12471;&#12473;&#12486;&#12512;&#12399;&#35079;&#25968;&#12398;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489; (X11 &#30340;&#12394;&#35328;&#33865;&#12391;&#12399; &#12459;&#12483;&#12488;&#12496;&#12483;&#12501;&#12449;) 
&#12434;&#25345;&#12387;&#12390;&#12356;&#12390;&#12289; &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12399;&#22793;&#12394;&#12371;&#12392;&#12434;&#12375;&#12390;&#12356;&#12427;&#12418;&#12398;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
&#29305;&#12395;&#12289; GNU Emacs &#12420; XEmacs &#12395;&#12506;&#12540;&#12473;&#12488;&#12377;&#12427;&#12392;&#12365;&#12395;&#12358;&#12414;&#12367;&#34892;&#12363;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt style="white-space: nowrap;">autocutsel</tt> &#12392;&#12356;&#12358;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12371;&#12428;&#12434;&#35299;&#28040;&#12377;&#12427;&#12383;&#12417;&#12395;&#33258;&#21205;&#30340;&#12395;&#20001;&#26041;&#12398;&#12459;&#12483;&#12488;&#12496;&#12483;&#12501;&#12449;&#12434;&#21516;&#26399;&#12373;&#12379;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12434;&#23455;&#34892;&#12377;&#12427;&#12395;&#12399;&#12289; Fink &#12497;&#12483;&#12465;&#12540;&#12472;&#12398; autoculset &#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12390;&#12289;&#20197;&#19979;&#12398;&#34892;&#12434;
<tt style="white-space: nowrap;">.xinitrc</tt> &#12395;&#36861;&#21152;&#12375;&#12414;&#12377;:
</p>
<pre>autocutsel &amp;</pre>
<p>
(&#27880;&#35352;: &#12454;&#12451;&#12531;&#12489;&#12454;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434; exec &#12377;&#12427;<b>&#21069;&#12395;</b>&#12289;&#12496;&#12483;&#12463;&#12464;&#12521;&#12454;&#12531;&#12489;&#12391;&#23455;&#34892;&#12375;&#12390;&#19979;&#12373;&#12356;&#12290;
&#26368;&#24460;&#12395;&#36861;&#21152;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#36215;&#21205;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;)
</p>
<p>
Apple X11 &#12434;&#20351;&#12358;&#22580;&#21512;&#12289;&#36890;&#24120;&#12398; Map &#12450;&#12503;&#12522;&#12398;&#12424;&#12358;&#12395; Command-C &#12363; Edit-&gt;Copy 
&#12434;&#20351;&#12387;&#12390;&#12463;&#12522;&#12483;&#12503;&#12508;&#12540;&#12489;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12375;&#12363;&#12375;&#12289; Apple X11 &#12391; Command-V &#12434;&#20351;&#12387;&#12383;&#12506;&#12540;&#12473;&#12488;&#12399;&#12414;&#12384;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
</p>

<hr><h2>Copyright Notice</h2><p>Copyright (c) 2001 Christoph Pfisterer,
Copyright (c) 2001-2004 The Fink Project.
You may distribute this document in print for private purposes,
provided the document and this copyright notice remain complete and
unmodified. Any commercial reproduction and any online publication
requires the explicit consent of the author.</p><hr><p>Generated from <i>$Fink: x11.ja.xml,v 1.1 2004/02/27 09:04:12 babayoshihiko Exp $</i></p></body></html>
