<?php
$title = "Использование X11 - Xtools";
$cvs_author = 'Author: gecko2';
$cvs_date = 'Date: 2012/11/11 15:20:18';
$metatags = '<link rel="contents" href="index.php?phpLang=ru" title="Использование X11 Contents"><link rel="next" href="other.php?phpLang=ru" title="Другие возможности X11"><link rel="prev" href="run-xfree86.php?phpLang=ru" title="Запуск XFree86">';


include_once "header.ru.inc";
?>
<h1>Использование X11 - 5. Xtools</h1>
        
        
        <h2><a name="install">5.1 Инсталляция Xtools</a></h2>
            
            <p> Теперь это легко изменить. Получите инсталлятор, дважды щелкните на нем и
                следуйте инструкциям. Внимательно выберите объем запуска, когда
                об этом появится запрос.</p>
            <p> При использовании Fink надо инсталлировать
                пакет <code>system-xtools</code> после инсталляции
                Xtools. Этот пакет не инсталлирует никакие файлы, а просто
                проверяет наличие библиотек и т.п., а также действует в качестве заполнителя в
                системе зависимостей Fink.</p>
        
        <h2><a name="run">5.2 Запуск Xtools</a></h2>
            
            <p> Для запуска Xtools надо дважды щелкнуть на Xtools.app в каталоге
                приложений. Как и XFree86, Xtools производит запуск клиентов, указанных вами в
                файле <code>.xinitrc</code>. Помимо этого, Xtools
                позволяет делать запуск клиентов через меню.</p>
        
        <h2><a name="opengl">5.3 Примечания в связи с OpenGL</a></h2>
            
            <p> Xtools применяет аппаратное ускорение OpenGL в бескорневом режиме и
                имеет библиотеки для его поддержки. Основная библиотека libGL
                очень хорошая, тогда как библиотеки libGLU и libglut представлены только в
                статическом виде, чего недостаточно для полной бинарной совместимости
                с XFree86. Кроме того, не хватает некоторых заголовков.
                На данный момент Fink не может предложить решения этой проблемы. Будем надеяться, что
                она будет решена в Xtools 1.1.</p>
        
    <p align="right"><?php echo FINK_NEXT ; ?>:
<a href="other.php?phpLang=ru">6. Другие возможности X11</a></p>
<?php include_once "../../footer.inc"; ?>
