<?
$title = "Download Overview";
$cvs_author = '$Author: jeff_yecn $';
$cvs_date = '$Date: 2004/03/02 03:24:11 $';

include "header.inc";
?>

<h1>下载概述</h1>

<p>
有很多方法可以获取 Fink。
本页试图解释这些不同的选择，以及它们之间的区别－有些时候这很容易混淆。
但首先，需要明白两件很重要的事情：
</p>

<p>
<b>源代码方式和二进制包方式。</b>
一个软件包可以有两种形式：源代码和二进制。
二进制包里面包括了已经经过编译，可以马上运行的程序。
你只需要下载和解包（安装）它们以后，就马上可以使用。
源代码包里面包括了程序原始的程序代码，Fink特有的补丁和构建指令。
从源代码安装的时间会比较长，因为这些源代码需要在你的计算机上进行编译以后才可以产生可以运行程序。
</p>

<p>
<b>各种 Fink 安装的最终结果都是等效的</b>。
无论你用什么方法安装 Fink，你总可以选择用源代码方式构建某个软件包。
另外，如果 Fink 是安装在 <tt>/sw</tt></u> 目录的话，你总可以选择下载安装二进制软件包。
你需要做的只是选择合适的工具和安装流程。
</p>

<p>
好，那么有些什么实际选项呢？
现在我们就开始，从最方便的到最前沿的方式：
</p>

<p>
<a href="bindist.php">二进制版本</a>使用的是二进制文件组成的软件包。
它包括一个图形界面的安装程序来进行首次安装，还包括一个软件包浏览器和一个选择程序（dselect）。
它跟踪最新的源程序发布；通常它会在源程序版本发布以后几天提供。
有时候，它会在版本发布中间进行更新。
更新到新的版本是自动的－只需要要求 dselect 或 apt-get 获取最新的软件包清单就可以了。
二进制版本的缺点是并不是所有软件包都是有二进制版本提供的。
一些是因为没有达到我们的品质标准或具有一些技术问题，一些由于它们的限制性条款而不能由我们发布，一些的加密算法被纳入到限制出口的范畴。
</p>

<p>
<a href="srcdist.php">源代码版本</a>安装是从源代码来构建整个软件包（除非你选择了其它选项），并使用命令行脚本进行驱动。
源代码版本可以使用 'fink selfupdate' 命令来更新自己到最新的版本。
这样做的好处是你可以获得所有已经被标为“稳定”的软件包。
不利之处以前也提到过－编译需要花比较长的时间，而且安装软件包的过程需要你输入命令。
</p>

<p>
Fink 软件的开发过程储存在一个 CVS 库里面。
你可以追踪它而保持你获得最新的版本。
使用方法和源代码发布类似，只是你需要通过其它渠道获取软件包描述文件。
（注：'fink selfupdate' 在这里是无效的）。
参考 <a href="../doc/cvsaccess/index.php">CVS 使用指南</a>获取有关细节。
</p>


<?
include "footer.inc";
?>
