<?
$title = "Download Overview";
$cvs_author = '$Author: babayoshihiko $';
$cvs_date = '$Date: 2004/03/02 16:21:21 $';

include "header.inc";
?>

<h1>Download Overview</h1>

<p>
Fink をダウンロードするには多くの方法があります。
このページは様々なオプションおよび - よく混同する- 相違を説明することを試みます。
最初に、前提となる2 つの重要な事を述べます:
</p>

<p>
<b>バイナリパッケージ vs ソース。 </b>
パッケージは2 つの形態が存在する: ソースとバイナリである。
バイナリパッケージはコンパイル済みで 、実行可能なプログラム含んでいるパッケージのアーカイブです。
ダウンロードし、解凍(インストール)することで、すぐに使用することができます。
ソースパッケージはオリジナルのソースコード、Fink 固有のパッチおよびビルドの指示からなっています。
ソースパッケージは、実行可能プログラムを作り出すために、ソースコードがコンパイルをするが、これは非常に時間がかかります。
</p>

<p>
<b>Fink のインストールは全て同等である。 </b>
Fink をどのようにインストールしても、常にソースからのパッケージをビルドすることができます。
同様に、 <u>Fink が <tt>/sw</tt> に取付けられている限り</u>、常にダウンロードされたバイナリ パッケージをインストールすることができます。
注意しなければならないのは、適切なツールと更新のプロシージャを使用することだけです。
</p>

<p>
それでは、実際の選択は何があるでしょうか。
最先を覗いてみましょう:
</p>

<p>
<a href="bindist.php?phpLang=ja">バイナリリリース</a>は バイナリパッケージを使用します。
これには、最初のインストール用のインストーラとパッケージブラウザ、選択アプリ (dselect) が含まれています。
これは最新のソースリリースを追跡しますが、新しいリリースが出た直後は何日か遅れが出ます; 
また、リリース間に更新が入ることもあります。
新しいリリースへの更新は自動的です。
dselect か apt-get で最新のパッケージ一覧を取得するだけです。
バイナリリリースの欠点は、全てのパッケージが手に入る訳ではないということです。
パッケージによっては、品質や技術的な問題、あるいは制限のあるライセンスは暗号の輸出制限によるためです。
</p>

<p>
<a href="srcdist.php">ソースリリース</a> はソースから全てを (他では選ばなければ) コマンドラインスクリプトでビルドします。
ソースリリースは 'fink selfupdate' のコマンドで最新版のリリースに自身を更新できます。
長所は 'stable' として印が付いていたパッケージすべてを更新できることです。
短所は、既に述べたようにソースからのコンパイル時間と、コマンドから実行しなければならないことです</p>

<p>
Fink ディストリビューションの実際の開発現場はCVS レポジトリです。
リリース間の最新版も追跡できます。
使用法はそソースリリースと同じで、違いはパッケージ詳細を別ルートで入手しなければいけないことです。
(' fink selfupdate' は動作しません)
詳細については<a href="../doc/cvsaccess/index.php">CVS 解説</a>をご覧下さい。
</p>


<?
include "footer.inc";
?>
