<?
$title = "Download Overview";
$cvs_author = '$Author: babayoshihiko $';
$cvs_date = '$Date: 2004/03/25 01:26:22 $';

include "header.inc";
?>

<h1>Download Overview</h1>

<p>
Fink をダウンロードするには多くの方法があります。
このページは様々なオプション、特に細かな相違を説明します。
最初に、前提となる2つの重要事項の確認:
</p>

<p>
<b>バイナリパッケージ vs ソース。 </b>
パッケージはバイナリソースの2つの形態が存在します。
バイナリパッケージはコンパイル済みで 、実行可能なプログラム含んでいるパッケージのアーカイブです。
ダウンロードし、解凍(インストール)することで、すぐに使用することができます。
ソースパッケージはオリジナルのソースコード、Fink 固有のパッチおよびビルドの指示からなっています。
ソースパッケージは、実行可能プログラムを作り出すために、ソースコードがコンパイルをするのですが、これは非常に時間がかかります。
</p>

<p>
<b>Fink のインストールは全て等価です。 </b>
Fink をどのようにインストールしても、常にソースからのパッケージをビルドすることができます。
同様に、 <u>Fink が <tt>/sw</tt> にインストールされている限り</u>、常にバイナリパッケージをインストールすることもできます。
注意しなければならないのは、適切なツールと更新のプロシージャを使用することだけです。
</p>

<p>
それでは、実際の選択は何があるでしょうか。
先を眺めてみましょう:
</p>

<p>
<a href="bindist.php?phpLang=ja">バイナリリリース</a>は バイナリパッケージを使用します。
これには、最初のインストール用のインストーラとパッケージブラウザ、選択アプリ (dselect) が含まれています。
これは最新のソースリリースを追跡しますが、新しいリリースが出た直後は何日か遅れが出ます; 
また、リリース間に更新が入ることもあります。
新しいリリースへの更新は自動的です。
dselect か apt-get で最新のパッケージ一覧を取得するだけです。
バイナリリリースの欠点は、全てのパッケージが手に入る訳ではないということです。
パッケージによりますが、品質や技術的な問題、あるいは制限のあるライセンスは暗号の輸出制限によるためです。
</p>

<p>
<a href="srcdist.php">ソースリリース</a> はソースから全てを (他では選ばなければ) コマンドラインスクリプトでビルドします。
ソースリリースは 'fink selfupdate' のコマンドで最新版のリリースに自身を更新できます。
長所は 'stable' として印が付いていたパッケージすべてを更新できることです。
短所は、既に述べたようにソースからのコンパイル時間と、コマンドから実行しなければならないことです</p>

<p>
Fink ディストリビューションの実際の開発現場は CVS レポジトリです。
リリース間の最新版も追跡できます。
使用法はソースリリースと同じで、違いはパッケージ詳細を別ルートで入手しなければいけないことです。
(' fink selfupdate' は動作しません)
詳細については <a href="../doc/cvsaccess/index.php">CVS アクセス</a>をご覧下さい。
</p>


<?
include "footer.inc";
?>
